import { useState, useMemo } from 'react';
import {
  RefreshCw,
  Send,
  History,
  Edit3,
  CheckCircle,
  AlertTriangle,
  User,
  Users,
  Award,
  Search,
  CheckSquare,
  Square,
  X,
  Mail,
  TrendingUp,
  BarChart3,
  Clock,
  ArrowUpRight,
  AlertCircle,
  BookOpen,
  ExternalLink,
  GraduationCap
} from 'lucide-react';

// Raw Employees Data
// [id, org, exec, team, name, rank, isPromo, badges]
const RAW_EMPLOYEES: Array<[number, string, string, string, string, string, number, Record<string, string>]> = [[1, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "백주원", "G2", 0, {"CL": "G", "DA": "SC", "PP": "G", "ML": "G", "AU": "SC"}], [2, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "신미자", "G1", 1, {"CL": "G", "DA": "GC", "PE": "G"}], [3, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "왕해인", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "GC", "DV": "B"}], [4, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "장봄", "G2", 0, {"CL": "B", "DA": "G", "ML": "G", "AU": "G"}], [5, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "천건우", "G2", 0, {"CL": "G", "DA": "Y", "PP": "SC", "ML": "B", "AU": "G"}], [6, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "하서연", "G3", 0, {"CL": "Y", "ML": "G"}], [7, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "엄미자", "G1", 0, {"CL": "Y", "ML": "B", "DV": "G"}], [8, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "서예준", "G2", 0, {"CL": "B", "DA": "G", "PP": "GC", "ML": "G", "AU": "B"}], [9, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "최서연", "G3", 0, {"CL": "G", "DA": "Y", "PP": "Y", "ML": "GC", "DV": "G", "AU": "SC", "PE": "B"}], [10, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "신다은", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "SC", "ML": "B", "DV": "G"}], [11, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "석준서", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B"}], [12, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "신준우", "G3", 0, {"CL": "Y", "ML": "G", "AU": "Y"}], [13, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "허서현", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "G", "AU": "B"}], [14, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "안지훈", "G3", 0, {"CL": "Y", "PP": "B", "ML": "B", "AU": "G"}], [15, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "최하은", "G1", 0, {"CL": "G", "DA": "SC", "DV": "G", "PE": "G"}], [16, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "장나은", "G1", 0, {"DS": "B", "CL": "G", "DA": "GC", "ML": "B", "DV": "B", "PE": "B"}], [17, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "심미자", "G2", 0, {"ML": "Y"}], [18, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "백단아", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "B"}], [19, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "가선우", "G2", 0, {"DA": "B", "ML": "G", "AU": "B"}], [20, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "권지훈", "G3", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "B", "AU": "Y"}], [21, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "진서준", "G2", 0, {"DA": "B", "PP": "Y", "ML": "G", "AU": "Y"}], [22, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "유나은", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [23, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "위나은", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "AU": "G"}], [24, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "유다은", "G3", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "G", "DV": "G", "AU": "SC"}], [25, "정밀화학사업본부", "하임원", "정밀화학 연구팀 1", "신준우", "G1", 0, {"CL": "B", "DA": "GC", "ML": "SC"}], [26, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "양선우", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "GC"}], [27, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "위정우", "G2", 0, {"DA": "Y", "PP": "Y", "ML": "B", "AU": "Y"}], [28, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "기단아", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "SC", "AU": "G"}], [29, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "황정우", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "SC"}], [30, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "전해인", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "G", "PE": "G"}], [31, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "홍준우", "G2", 0, {"DA": "G", "PP": "B", "ML": "G"}], [32, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "유지훈", "G3", 0, {"CL": "G", "DA": "SC", "ML": "G", "DV": "B", "AU": "SC"}], [33, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "라민준", "G2", 0, {"CL": "Y", "ML": "G"}], [34, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "심채원", "G1", 1, {"CL": "Y", "DA": "SC", "ML": "B", "DV": "B"}], [35, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "소은우", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "Y"}], [36, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "위서진", "G1", 0, {"CL": "B", "DA": "B", "DV": "G", "PE": "SC"}], [37, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "노유찬", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "GC", "AU": "Y"}], [38, "첨단소재사업본부", "하임원", "첨단소재 물류팀 2", "위준서", "G1", 0, {"CL": "B", "DA": "G", "ML": "B"}], [39, "DX센터", "하임원", "DX 전략팀 3", "최시아", "G2", 0, {"DA": "Y", "PP": "G", "ML": "G", "AU": "B"}], [40, "DX센터", "하임원", "DX 전략팀 3", "주소율", "G2", 0, {"DA": "G", "ML": "B"}], [41, "DX센터", "하임원", "DX 전략팀 3", "민유찬", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "AU": "B"}], [42, "DX센터", "하임원", "DX 전략팀 3", "박다은", "G3", 0, {"CL": "G", "ML": "SC", "AU": "Y"}], [43, "DX센터", "하임원", "DX 전략팀 3", "박봄", "G1", 0, {"CL": "B", "DA": "G", "ML": "B", "DV": "B"}], [44, "DX센터", "하임원", "DX 전략팀 3", "왕지우", "G1", 1, {"CL": "G"}], [45, "DX센터", "하임원", "DX 전략팀 3", "금하준", "G3", 0, {"CL": "G", "PP": "G", "ML": "GC"}], [46, "DX센터", "하임원", "DX 전략팀 3", "천지아", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "G"}], [47, "DX센터", "하임원", "DX 전략팀 3", "조채원", "G1", 1, {"CL": "Y", "DA": "G", "ML": "SC", "DV": "SC"}], [48, "DX센터", "하임원", "DX 전략팀 3", "최지훈", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G", "DV": "GC", "AU": "B"}], [49, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "양수아", "G3", 0, {"CL": "G", "DA": "B", "ML": "B"}], [50, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "권서준", "G3", 0, {"PP": "B", "ML": "B"}], [51, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "류지우", "G1", 0, {"DA": "Y", "ML": "B", "DV": "G"}], [52, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "반주원", "G3", 0, {"CL": "Y", "DA": "Y", "ML": "G", "AU": "G"}], [53, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "강영태", "G1", 0, {"CL": "Y", "DA": "G", "DV": "Y"}], [54, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "배영태", "G2", 0, {"CL": "G", "DA": "B", "PP": "GC", "ML": "G", "AU": "GC"}], [55, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "황영태", "G2", 0, {"CL": "B", "DA": "B", "PP": "Y", "ML": "G", "AU": "B"}], [56, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "가광남", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B"}], [57, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "원민준", "G2", 1, {"DA": "Y", "ML": "G"}], [58, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "조건우", "G3", 0, {"PP": "Y", "ML": "G", "AU": "B"}], [59, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "강주아", "G2", 0, {"CL": "Y", "DA": "B", "PP": "GC", "ML": "B"}], [60, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "서정우", "G1", 0, {"CL": "B", "DA": "G", "PE": "G"}], [61, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "전도윤", "G1", 0, {"DS": "Y", "CL": "B", "DA": "G", "ML": "B", "DV": "B", "AU": "G", "PE": "SC"}], [62, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "오도윤", "G3", 0, {"CL": "G", "DA": "B", "PP": "B", "ML": "B"}], [63, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "기아인", "G3", 0, {"CL": "Y", "PP": "G", "ML": "B", "AU": "G"}], [64, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "이광남", "G3", 0, {"PP": "G", "ML": "G"}], [65, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "유준우", "G1", 0, {"CL": "G", "DA": "SC", "ML": "B", "DV": "SC", "PE": "B"}], [66, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "최광남", "G1", 0, {"DS": "G", "CL": "B", "DA": "B", "DV": "Y"}], [67, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "노하윤", "G2", 1, {"DA": "Y", "PP": "B", "ML": "G", "AU": "B"}], [68, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "소채원", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "B", "AU": "Y"}], [69, "정밀화학사업본부", "하임원", "정밀화학 사업팀 1", "라지유", "G3", 0, {"ML": "G", "AU": "G"}], [70, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "성정현", "G3", 0, {"ML": "Y"}], [71, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "금우진", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "SC", "AU": "SC"}], [72, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "류서진", "G2", 0, {"CL": "Y", "DA": "G"}], [73, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "전연우", "G3", 0, {"CL": "G", "PP": "G", "ML": "G", "AU": "B"}], [74, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "금준서", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "AU": "SC"}], [75, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "채서진", "G2", 0, {"CL": "G", "ML": "G"}], [76, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "길지유", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "GC"}], [77, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "도서준", "G3", 0, {"CL": "Y", "PP": "G", "ML": "G"}], [78, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "구미자", "G1", 0, {"CL": "Y", "DA": "SC", "ML": "B"}], [79, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "진서준", "G3", 0, {"CL": "G", "PP": "G", "ML": "G", "AU": "G"}], [80, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "선지우", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [81, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "구주원", "G3", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "B", "DV": "G", "AU": "GC", "PE": "G"}], [82, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "유해인", "G2", 1, {"CL": "B", "DA": "G", "ML": "B"}], [83, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "표주아", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "GC", "DV": "SC", "AU": "B"}], [84, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "윤주아", "G1", 0, {"CL": "B", "DA": "GC", "ML": "B", "DV": "SC"}], [85, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "공도윤", "G1", 0, {"CL": "G", "DA": "B"}], [86, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "신서연", "G1", 0, {"DS": "G", "CL": "G", "DA": "SC", "ML": "B", "DV": "G", "AU": "B", "PE": "Y"}], [87, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "현하윤", "G3", 0, {"CL": "SC", "PP": "B", "ML": "G", "AU": "G"}], [88, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "임서윤", "G1", 0, {"CL": "G", "DV": "SC"}], [89, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "기건우", "G3", 0, {"PP": "Y", "ML": "G", "AU": "B"}], [90, "글로벌사업센터", "하임원", "글로벌사업 생산팀", "표서연", "G3", 0, {"CL": "G", "ML": "G", "AU": "B"}], [91, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "구준우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "G", "DV": "GC", "AU": "B"}], [92, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "지시우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "Y"}], [93, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "김준우", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "G", "DV": "G", "AU": "G"}], [94, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "공채원", "G2", 0, {"DA": "B", "ML": "B"}], [95, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "안시우", "G2", 1, {"CL": "Y", "PP": "Y", "ML": "B"}], [96, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "현연우", "G2", 0, {"CL": "G", "DA": "B", "PP": "B", "ML": "GC", "AU": "G"}], [97, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "민연우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "B"}], [98, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "도유찬", "G2", 0, {"PP": "Y", "ML": "G", "AU": "G"}], [99, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "김해인", "G2", 0, {"PP": "B", "ML": "B", "AU": "GC"}], [100, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "우정우", "G1", 0, {"CL": "G", "DA": "G"}], [101, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "신준우", "G2", 1, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "SC", "AU": "B"}], [102, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "백연우", "G3", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [103, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "황유찬", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "G"}], [104, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "인미자", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B", "DV": "G", "PE": "G"}], [105, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "강지유", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "G", "PE": "G"}], [106, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "지건우", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "AU": "B"}], [107, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "홍영태", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "SC"}], [108, "글로벌사업센터", "우임원", "글로벌사업 관리팀 1", "신다은", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [109, "인재개발센터", "우임원", "인재개발 생산팀", "심소율", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "GC", "AU": "B"}], [110, "인재개발센터", "우임원", "인재개발 생산팀", "서수아", "G3", 0, {"DS": "G", "CL": "Y", "DA": "B", "PP": "B", "ML": "B", "DV": "G", "AU": "B", "TB": "SC", "PE": "G"}], [111, "인재개발센터", "우임원", "인재개발 생산팀", "진광남", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G", "AU": "G"}], [112, "인재개발센터", "우임원", "인재개발 생산팀", "지하준", "G2", 0, {"CL": "B", "DA": "B", "PP": "Y", "ML": "B", "AU": "G"}], [113, "인재개발센터", "우임원", "인재개발 생산팀", "권도윤", "G3", 0, {"CL": "G", "ML": "G", "AU": "B"}], [114, "인재개발센터", "우임원", "인재개발 생산팀", "진하은", "G1", 1, {"CL": "G", "DA": "B", "PE": "B"}], [115, "인재개발센터", "우임원", "인재개발 생산팀", "인하준", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "Y", "ML": "G", "AU": "G"}], [116, "인재개발센터", "우임원", "인재개발 생산팀", "조봄", "G1", 0, {"CL": "B", "DA": "SC", "DV": "B", "PE": "G"}], [117, "인재개발센터", "우임원", "인재개발 생산팀", "이지훈", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "Y"}], [118, "첨단소재사업본부", "우임원", "첨단소재 전략팀 1", "조우진", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "SC", "DV": "SC", "PE": "B"}], [119, "첨단소재사업본부", "우임원", "첨단소재 전략팀 1", "전해인", "G3", 0, {"CL": "Y", "ML": "G"}], [120, "첨단소재사업본부", "우임원", "첨단소재 전략팀 1", "위지민", "G3", 0, {"CL": "G", "PP": "Y", "ML": "SC", "AU": "SC"}], [121, "첨단소재사업본부", "우임원", "첨단소재 전략팀 1", "현연우", "G2", 0, {"ML": "G"}], [122, "첨단소재사업본부", "우임원", "첨단소재 전략팀 1", "문지우", "G3", 0, {"CL": "G", "PP": "Y", "ML": "GC", "AU": "G"}], [123, "첨단소재사업본부", "우임원", "첨단소재 전략팀 1", "정서진", "G3", 0, {"PP": "B", "ML": "B", "AU": "B"}], [124, "첨단소재사업본부", "우임원", "첨단소재 전략팀 1", "백정현", "G2", 0, {"CL": "G", "DA": "GC", "ML": "B", "AU": "B"}], [125, "첨단소재사업본부", "우임원", "첨단소재 전략팀 1", "홍영태", "G2", 0, {"CL": "Y", "DA": "SC", "PP": "B", "ML": "G"}], [126, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "조유찬", "G1", 0, {"DA": "B"}], [127, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "소준서", "G2", 0, {"DS": "Y", "CL": "Y", "DA": "G", "PP": "B", "ML": "B", "DV": "SC", "AU": "B", "PE": "G"}], [128, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "전유찬", "G3", 0, {"CL": "G", "DA": "B", "ML": "B", "DV": "SC", "AU": "B"}], [129, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "류광남", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "G", "AU": "GC"}], [130, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "선하준", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B"}], [131, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "강서윤", "G1", 0, {"DS": "B", "CL": "Y", "DA": "G", "ML": "SC", "DV": "G", "PE": "B"}], [132, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "공도윤", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "SC", "PE": "G"}], [133, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "구민준", "G2", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [134, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "설주희", "G3", 0, {"ML": "G", "AU": "SC"}], [135, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "천수아", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "Y"}], [136, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "인민준", "G1", 1, {"CL": "Y", "DA": "G", "ML": "G", "DV": "G", "PE": "B"}], [137, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "장지훈", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "GC"}], [138, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "남미자", "G1", 0, {"CL": "SC", "DA": "G", "ML": "B", "DV": "G"}], [139, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "구시아", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "G"}], [140, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "왕유찬", "G1", 0, {"CL": "B", "ML": "G", "DV": "G"}], [141, "정밀화학사업본부", "조임원", "정밀화학 관리팀 2", "안지우", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "DV": "B", "AU": "G"}], [142, "환경안전센터", "조임원", "환경안전 환경팀 2", "곽선우", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "B"}], [143, "환경안전센터", "조임원", "환경안전 환경팀 2", "노시우", "G3", 0, {"CL": "Y", "ML": "G"}], [144, "환경안전센터", "조임원", "환경안전 환경팀 2", "왕채원", "G3", 0, {"CL": "G", "ML": "G", "AU": "G"}], [145, "환경안전센터", "조임원", "환경안전 환경팀 2", "권정우", "G2", 0, {"DA": "G", "ML": "SC", "AU": "B"}], [146, "환경안전센터", "조임원", "환경안전 환경팀 2", "육준우", "G1", 0, {"CL": "Y", "DA": "SC", "ML": "G", "DV": "B", "PE": "G"}], [147, "환경안전센터", "조임원", "환경안전 환경팀 2", "황지호", "G3", 0, {"CL": "G", "ML": "G"}], [148, "환경안전센터", "조임원", "환경안전 환경팀 2", "진아인", "G2", 0, {"CL": "Y", "DA": "B", "PP": "Y", "ML": "SC", "AU": "G"}], [149, "환경안전센터", "조임원", "환경안전 환경팀 2", "인지훈", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "Y"}], [150, "환경안전센터", "조임원", "환경안전 환경팀 2", "연나은", "G2", 0, {"CL": "Y", "DA": "GC", "ML": "B"}], [151, "환경안전센터", "조임원", "환경안전 환경팀 2", "유유찬", "G1", 1, {"CL": "Y", "DA": "B", "ML": "G", "DV": "GC", "PE": "Y"}], [152, "환경안전센터", "조임원", "환경안전 환경팀 2", "유단아", "G3", 0, {"PP": "G", "ML": "Y", "AU": "B"}], [153, "환경안전센터", "조임원", "환경안전 환경팀 2", "윤민준", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "GC", "PE": "G"}], [154, "환경안전센터", "조임원", "환경안전 환경팀 2", "소서윤", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "DV": "B", "AU": "G", "PE": "Y"}], [155, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "전도윤", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "G", "AU": "G"}], [156, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "조준서", "G3", 0, {"CL": "Y", "ML": "B"}], [157, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "주해인", "G3", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "B", "AU": "Y"}], [158, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "송봄", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "SC", "DV": "B", "AU": "G"}], [159, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "설도윤", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "G", "PE": "G"}], [160, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "왕주희", "G2", 0, {"CL": "Y", "DA": "B", "PP": "GC", "ML": "GC"}], [161, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "여우진", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "DV": "G", "AU": "B", "PE": "B"}], [162, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "윤민준", "G3", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "G", "AU": "B"}], [163, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "추미자", "G1", 0, {"CL": "B", "DA": "G", "DV": "G"}], [164, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "육지우", "G3", 0, {"PP": "Y", "ML": "G", "AU": "GC"}], [165, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "위주희", "G2", 0, {"CL": "Y", "ML": "B", "AU": "G"}], [166, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "백우진", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B", "AU": "B"}], [167, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "표영태", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "Y"}], [168, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "유우진", "G3", 0, {"CL": "G", "ML": "G", "AU": "SC"}], [169, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "남수아", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [170, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "최하윤", "G3", 0, {"CL": "G", "PP": "Y", "ML": "SC", "AU": "G"}], [171, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "주소율", "G2", 1, {"CL": "G", "DA": "Y", "ML": "B", "AU": "G"}], [172, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "채수아", "G2", 0, {"DA": "Y", "ML": "Y"}], [173, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "석지유", "G1", 0, {"CL": "B", "DA": "G", "ML": "SC", "DV": "B"}], [174, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "천윤서", "G2", 0, {"DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [175, "친환경소재사업본부", "조임원", "친환경소재 안전팀 2", "소민준", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "SC"}], [176, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "심다은", "G2", 0, {"DA": "Y", "PP": "G", "ML": "B", "AU": "GC"}], [177, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "소도윤", "G1", 0, {"DS": "Y", "CL": "B", "DA": "GC", "ML": "G", "DV": "G"}], [178, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "우민서", "G1", 0, {"DS": "Y", "CL": "G", "DA": "GC", "DV": "SC"}], [179, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "금주아", "G2", 0, {"CL": "Y", "DA": "B", "PP": "SC", "ML": "B", "AU": "G"}], [180, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "백광남", "G1", 0, {"CL": "B", "DA": "Y", "ML": "SC", "DV": "SC", "PE": "B"}], [181, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "명수아", "G1", 0, {"CL": "Y", "DA": "SC", "ML": "G", "DV": "G", "PE": "B"}], [182, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "임채원", "G3", 0, {"CL": "G", "ML": "SC", "AU": "B"}], [183, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "원하준", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "DV": "GC", "AU": "B"}], [184, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "한도윤", "G2", 0, {"DA": "Y", "PP": "G", "ML": "B", "AU": "G"}], [185, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "소민준", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "SC", "AU": "B"}], [186, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "노민서", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "SC", "PE": "B"}], [187, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "조민준", "G1", 0, {"CL": "G", "DA": "G", "DV": "G"}], [188, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "주영태", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "B"}], [189, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "정민준", "G2", 0, {"DA": "G", "PP": "G", "ML": "SC", "AU": "G"}], [190, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "주건우", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "GC", "AU": "G"}], [191, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "한지유", "G3", 0, {"CL": "B", "PP": "G", "ML": "GC"}], [192, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "심시아", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "G", "PE": "G"}], [193, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "신서윤", "G1", 0, {"DS": "G", "CL": "Y", "DA": "B", "ML": "G", "DV": "B", "PE": "B"}], [194, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "전미자", "G3", 0, {"ML": "G", "AU": "B"}], [195, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "가광남", "G3", 0, {"CL": "Y", "DA": "SC", "PP": "G", "ML": "B", "DV": "G", "AU": "G"}], [196, "정밀화학사업본부", "표임원", "정밀화학 사업팀 3", "오준우", "G2", 0, {"CL": "B", "DA": "G", "ML": "B"}], [197, "환경안전센터", "표임원", "환경안전 관리팀 3", "한지호", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [198, "환경안전센터", "표임원", "환경안전 관리팀 3", "한서준", "G3", 0, {"CL": "Y", "PP": "B", "ML": "B", "AU": "G"}], [199, "환경안전센터", "표임원", "환경안전 관리팀 3", "명우진", "G3", 0, {"PP": "Y", "ML": "B", "AU": "SC"}], [200, "환경안전센터", "표임원", "환경안전 관리팀 3", "차도윤", "G3", 0, {"PP": "Y", "ML": "G", "AU": "G"}], [201, "환경안전센터", "표임원", "환경안전 관리팀 3", "진미자", "G2", 0, {"CL": "G", "DA": "B", "ML": "G"}], [202, "환경안전센터", "표임원", "환경안전 관리팀 3", "조광남", "G2", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "G", "DV": "G", "AU": "G"}], [203, "환경안전센터", "표임원", "환경안전 관리팀 3", "방민준", "G3", 0, {"ML": "Y"}], [204, "환경안전센터", "표임원", "환경안전 관리팀 3", "오은우", "G1", 0, {"CL": "Y", "DA": "G"}], [205, "환경안전센터", "표임원", "환경안전 관리팀 3", "반지아", "G2", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "G", "DV": "GC", "AU": "B"}], [206, "환경안전센터", "표임원", "환경안전 관리팀 3", "전정우", "G3", 0, {"CL": "G", "PP": "Y", "ML": "G", "AU": "B"}], [207, "환경안전센터", "표임원", "환경안전 관리팀 3", "최준우", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "G", "PE": "B"}], [208, "환경안전센터", "표임원", "환경안전 관리팀 3", "배하은", "G2", 0, {"DS": "Y", "CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "DV": "G", "AU": "G", "PE": "B"}], [209, "환경안전센터", "표임원", "환경안전 관리팀 3", "위지민", "G1", 0, {"DS": "G", "CL": "B", "DA": "G", "ML": "G", "DV": "G", "PE": "B"}], [210, "환경안전센터", "표임원", "환경안전 관리팀 3", "함윤서", "G3", 0, {"ML": "Y", "AU": "G"}], [211, "환경안전센터", "표임원", "환경안전 관리팀 3", "강은우", "G3", 0, {"CL": "Y", "DA": "B", "ML": "G", "AU": "SC"}], [212, "환경안전센터", "표임원", "환경안전 관리팀 3", "우하윤", "G1", 0, {"CL": "G", "DA": "B", "DV": "B"}], [213, "품질경영센터", "표임원", "품질경영 생산팀 2", "박주아", "G3", 0, {"CL": "B", "PP": "G", "ML": "B", "DV": "G", "AU": "B"}], [214, "품질경영센터", "표임원", "품질경영 생산팀 2", "심다은", "G2", 0, {"CL": "Y", "ML": "G"}], [215, "품질경영센터", "표임원", "품질경영 생산팀 2", "신미자", "G1", 1, {"DS": "G", "CL": "G", "DA": "SC", "DV": "SC", "PE": "B"}], [216, "품질경영센터", "표임원", "품질경영 생산팀 2", "원아인", "G2", 1, {"CL": "G", "DA": "G", "ML": "G"}], [217, "품질경영센터", "표임원", "품질경영 생산팀 2", "옥유찬", "G3", 0, {"CL": "G", "DA": "Y", "PP": "GC", "ML": "G", "AU": "G"}], [218, "품질경영센터", "표임원", "품질경영 생산팀 2", "주지훈", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "Y"}], [219, "품질경영센터", "표임원", "품질경영 생산팀 2", "홍하윤", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "GC"}], [220, "품질경영센터", "표임원", "품질경영 생산팀 2", "금준서", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [221, "품질경영센터", "표임원", "품질경영 생산팀 2", "명연우", "G1", 0, {"DS": "G", "CL": "B", "DA": "G", "ML": "B", "DV": "GC", "PE": "B"}], [222, "품질경영센터", "표임원", "품질경영 생산팀 2", "반주희", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "B", "DV": "G", "PE": "G"}], [223, "품질경영센터", "표임원", "품질경영 생산팀 2", "가유찬", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "G"}], [224, "품질경영센터", "표임원", "품질경영 생산팀 2", "연주원", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "GC", "AU": "G"}], [225, "품질경영센터", "표임원", "품질경영 생산팀 2", "소민준", "G3", 0, {"CL": "G", "ML": "Y"}], [226, "품질경영센터", "표임원", "품질경영 생산팀 2", "곽하은", "G2", 0, {"CL": "B", "DA": "G", "ML": "B"}], [227, "품질경영센터", "표임원", "품질경영 생산팀 2", "정채원", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B", "AU": "G"}], [228, "품질경영센터", "표임원", "품질경영 생산팀 2", "허민서", "G2", 0, {"CL": "Y", "DA": "G", "PP": "GC", "ML": "G", "AU": "B"}], [229, "품질경영센터", "표임원", "품질경영 생산팀 2", "한수아", "G1", 0, {"CL": "SC"}], [230, "품질경영센터", "표임원", "품질경영 생산팀 2", "고은우", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "B", "DV": "G", "PE": "Y"}], [231, "품질경영센터", "표임원", "품질경영 생산팀 2", "석유찬", "G3", 0, {"PP": "SC", "ML": "B", "AU": "G"}], [232, "품질경영센터", "표임원", "품질경영 생산팀 2", "임은우", "G2", 0, {"CL": "Y", "DA": "SC", "PP": "G", "ML": "B", "DV": "B", "AU": "B", "PE": "G"}], [233, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "기윤서", "G2", 0, {"ML": "B", "AU": "G"}], [234, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "반서현", "G2", 1, {"DA": "Y", "ML": "B"}], [235, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "설하윤", "G2", 0, {"CL": "B", "DA": "SC", "ML": "SC"}], [236, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "곽서준", "G2", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "SC", "DV": "G", "AU": "G"}], [237, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "왕하은", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "B", "ML": "G", "DV": "B", "AU": "B", "PE": "G"}], [238, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "남주원", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "AU": "B"}], [239, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "인하윤", "G2", 1, {"CL": "Y", "DA": "SC", "PP": "B", "ML": "B", "AU": "G"}], [240, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "엄정우", "G3", 0, {"CL": "SC", "ML": "SC", "AU": "G"}], [241, "생산기술센터", "표임원", "생산기술 마케팅팀 1", "소하은", "G3", 0, {"PP": "G", "ML": "G"}], [242, "기초소재사업본부", "표임원", "기초소재 기술팀", "구아인", "G2", 0, {"CL": "B", "DA": "Y", "ML": "B", "AU": "G"}], [243, "기초소재사업본부", "표임원", "기초소재 기술팀", "배주아", "G3", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "B", "AU": "G"}], [244, "기초소재사업본부", "표임원", "기초소재 기술팀", "배시아", "G3", 0, {"PP": "Y", "ML": "G"}], [245, "기초소재사업본부", "표임원", "기초소재 기술팀", "주하준", "G1", 0, {"CL": "B", "DA": "G"}], [246, "기초소재사업본부", "표임원", "기초소재 기술팀", "배정현", "G3", 0, {"CL": "G", "PP": "Y", "ML": "B", "AU": "B"}], [247, "기초소재사업본부", "표임원", "기초소재 기술팀", "선지아", "G3", 0, {"CL": "G", "PP": "Y", "ML": "Y"}], [248, "기초소재사업본부", "표임원", "기초소재 기술팀", "진해인", "G3", 0, {"CL": "G", "DA": "B", "ML": "G", "AU": "G"}], [249, "기초소재사업본부", "표임원", "기초소재 기술팀", "유준우", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B", "DV": "G"}], [250, "기초소재사업본부", "표임원", "기초소재 기술팀", "석윤서", "G1", 0, {"CL": "Y", "ML": "G", "DV": "B", "PE": "Y"}], [251, "기초소재사업본부", "표임원", "기초소재 기술팀", "길하윤", "G1", 1, {"CL": "G", "DA": "B", "ML": "G", "DV": "B", "PE": "B"}], [252, "기초소재사업본부", "표임원", "기초소재 기술팀", "왕광남", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "AU": "B"}], [253, "기초소재사업본부", "표임원", "기초소재 기술팀", "전지민", "G1", 0, {"CL": "Y", "DA": "SC"}], [254, "기초소재사업본부", "표임원", "기초소재 기술팀", "진윤서", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "B", "PE": "G"}], [255, "기초소재사업본부", "표임원", "기초소재 기술팀", "소준서", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B", "DV": "G", "AU": "Y"}], [256, "기초소재사업본부", "표임원", "기초소재 기술팀", "석시아", "G3", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "B", "AU": "B"}], [257, "기초소재사업본부", "표임원", "기초소재 기술팀", "원아인", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "AU": "G"}], [258, "기초소재사업본부", "표임원", "기초소재 기술팀", "주나은", "G1", 0, {"CL": "B", "DA": "Y", "ML": "G", "DV": "SC", "PE": "B"}], [259, "기초소재사업본부", "표임원", "기초소재 기술팀", "성영태", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "Y", "ML": "B", "DV": "B", "AU": "G"}], [260, "기초소재사업본부", "표임원", "기초소재 기술팀", "정지민", "G2", 0, {"DA": "Y", "PP": "G", "ML": "G", "AU": "GC"}], [261, "기초소재사업본부", "표임원", "기초소재 기술팀", "왕도윤", "G1", 1, {"CL": "G", "ML": "B", "DV": "SC"}], [262, "기초소재사업본부", "표임원", "기초소재 기술팀", "신나은", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "G"}], [263, "기초소재사업본부", "표임원", "기초소재 기술팀", "조서윤", "G2", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "G", "AU": "B"}], [264, "기초소재사업본부", "표임원", "기초소재 기술팀", "안선우", "G3", 0, {"CL": "G", "ML": "B", "AU": "Y"}], [265, "기초소재사업본부", "표임원", "기초소재 기술팀", "최정우", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "B", "DV": "SC", "PE": "G"}], [266, "기초소재사업본부", "표임원", "기초소재 기술팀", "소채원", "G1", 0, {"DS": "Y", "CL": "B", "DA": "Y", "ML": "G", "DV": "GC", "AU": "SC", "PE": "G"}], [267, "기초소재사업본부", "표임원", "기초소재 기술팀", "설하윤", "G1", 0, {"CL": "G", "DA": "Y", "ML": "B", "DV": "G"}], [268, "R&D센터", "홍임원", "R&D 마케팅팀 2", "석소율", "G3", 0, {"CL": "G", "PP": "G", "ML": "B"}], [269, "R&D센터", "홍임원", "R&D 마케팅팀 2", "현채원", "G1", 0, {"DA": "G", "DV": "G"}], [270, "R&D센터", "홍임원", "R&D 마케팅팀 2", "정건우", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G", "AU": "G"}], [271, "R&D센터", "홍임원", "R&D 마케팅팀 2", "윤소율", "G2", 0, {"DS": "G", "CL": "Y", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "G", "PE": "B"}], [272, "R&D센터", "홍임원", "R&D 마케팅팀 2", "황나은", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "AU": "G"}], [273, "R&D센터", "홍임원", "R&D 마케팅팀 2", "설단아", "G1", 0, {"CL": "G", "DA": "Y", "ML": "GC", "DV": "G", "PE": "Y"}], [274, "R&D센터", "홍임원", "R&D 마케팅팀 2", "라미자", "G2", 0, {"ML": "B"}], [275, "R&D센터", "홍임원", "R&D 마케팅팀 2", "이해인", "G2", 0, {"CL": "B", "DA": "Y", "PP": "B", "ML": "B"}], [276, "R&D센터", "홍임원", "R&D 마케팅팀 2", "임윤서", "G3", 0, {"PP": "G", "ML": "B", "AU": "B"}], [277, "R&D센터", "홍임원", "R&D 마케팅팀 2", "연지훈", "G1", 0, {"DS": "G", "CL": "B", "DA": "B", "ML": "GC", "DV": "SC", "PE": "Y"}], [278, "R&D센터", "홍임원", "R&D 마케팅팀 2", "추준우", "G1", 0, {"CL": "G", "DA": "G"}], [279, "R&D센터", "홍임원", "R&D 마케팅팀 2", "김지민", "G3", 0, {"CL": "G", "ML": "G", "AU": "B"}], [280, "R&D센터", "홍임원", "R&D 마케팅팀 2", "홍은우", "G1", 0, {"DS": "B", "CL": "G", "DA": "Y", "ML": "SC", "DV": "B", "PE": "GC"}], [281, "R&D센터", "홍임원", "R&D 마케팅팀 2", "윤하윤", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "B"}], [282, "R&D센터", "홍임원", "R&D 마케팅팀 2", "민준서", "G2", 0, {"DA": "B", "ML": "B"}], [283, "R&D센터", "홍임원", "R&D 마케팅팀 2", "조예준", "G2", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "G", "AU": "G"}], [284, "R&D센터", "홍임원", "R&D 마케팅팀 2", "임지민", "G3", 0, {"CL": "Y", "PP": "G", "ML": "GC", "AU": "B"}], [285, "R&D센터", "홍임원", "R&D 마케팅팀 2", "라윤서", "G2", 0, {"DS": "Y", "CL": "G", "DA": "SC", "PP": "B", "ML": "G", "DV": "G", "AU": "G", "TB": "B", "PE": "G"}], [286, "DX센터", "홍임원", "DX 혁신팀 1", "위지유", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "AU": "B"}], [287, "DX센터", "홍임원", "DX 혁신팀 1", "엄광남", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "Y"}], [288, "DX센터", "홍임원", "DX 혁신팀 1", "전지훈", "G3", 0, {"ML": "G"}], [289, "DX센터", "홍임원", "DX 혁신팀 1", "차연우", "G2", 0, {"CL": "B", "DA": "Y", "PP": "Y", "ML": "G", "DV": "B", "AU": "B", "PE": "B"}], [290, "DX센터", "홍임원", "DX 혁신팀 1", "남해인", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B", "AU": "G"}], [291, "DX센터", "홍임원", "DX 혁신팀 1", "정주아", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "AU": "GC"}], [292, "DX센터", "홍임원", "DX 혁신팀 1", "연미자", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B"}], [293, "DX센터", "홍임원", "DX 혁신팀 1", "주해인", "G3", 0, {"CL": "G", "ML": "G"}], [294, "DX센터", "홍임원", "DX 혁신팀 1", "전수아", "G1", 0, {"CL": "B", "DA": "G", "ML": "B", "PE": "B"}], [295, "DX센터", "홍임원", "DX 혁신팀 1", "진정현", "G2", 0, {"CL": "G", "ML": "G"}], [296, "DX센터", "홍임원", "DX 혁신팀 1", "차서윤", "G3", 0, {"CL": "B", "PP": "G", "ML": "G", "DV": "B", "AU": "Y"}], [297, "DX센터", "홍임원", "DX 혁신팀 1", "오수아", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "G"}], [298, "DX센터", "홍임원", "DX 혁신팀 1", "염채원", "G2", 0, {"DA": "G", "ML": "GC", "AU": "B"}], [299, "DX센터", "홍임원", "DX 혁신팀 1", "구지민", "G1", 0, {"DS": "Y", "CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "B", "PE": "G"}], [300, "신사업기획센터", "홍임원", "신사업기획 생산팀", "차우진", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "SC", "DV": "B", "AU": "G"}], [301, "신사업기획센터", "홍임원", "신사업기획 생산팀", "강지아", "G2", 0, {"CL": "B", "ML": "G"}], [302, "신사업기획센터", "홍임원", "신사업기획 생산팀", "성은우", "G2", 1, {"CL": "B", "DA": "G", "ML": "B"}], [303, "신사업기획센터", "홍임원", "신사업기획 생산팀", "유단아", "G3", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "B", "DV": "G", "AU": "G"}], [304, "신사업기획센터", "홍임원", "신사업기획 생산팀", "유우진", "G2", 0, {"DA": "Y", "ML": "G", "AU": "B"}], [305, "신사업기획센터", "홍임원", "신사업기획 생산팀", "임선우", "G2", 0, {"CL": "G", "DA": "B", "ML": "G", "AU": "G"}], [306, "신사업기획센터", "홍임원", "신사업기획 생산팀", "현광남", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "B", "AU": "G"}], [307, "신사업기획센터", "홍임원", "신사업기획 생산팀", "육서윤", "G3", 0, {"CL": "B", "ML": "G"}], [308, "신사업기획센터", "홍임원", "신사업기획 생산팀", "위시우", "G1", 0, {"CL": "Y", "ML": "B", "DV": "G", "PE": "G"}], [309, "신사업기획센터", "홍임원", "신사업기획 생산팀", "윤예준", "G1", 1, {"DS": "G", "CL": "B", "DA": "G", "PP": "SC", "ML": "G", "DV": "SC", "PE": "G"}], [310, "신사업기획센터", "홍임원", "신사업기획 생산팀", "현민준", "G1", 0, {"CL": "G", "DA": "Y", "ML": "SC", "DV": "G", "PE": "B"}], [311, "신사업기획센터", "홍임원", "신사업기획 생산팀", "염준서", "G1", 0, {"DS": "G", "CL": "B", "DA": "B", "ML": "SC", "DV": "G", "PE": "B"}], [312, "신사업기획센터", "홍임원", "신사업기획 생산팀", "금민서", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [313, "신사업기획센터", "홍임원", "신사업기획 생산팀", "도은우", "G2", 1, {"CL": "Y", "DA": "B", "ML": "GC", "AU": "B"}], [314, "신사업기획센터", "홍임원", "신사업기획 생산팀", "송도윤", "G1", 0, {"CL": "B", "DA": "G", "DV": "B"}], [315, "신사업기획센터", "홍임원", "신사업기획 생산팀", "오윤서", "G3", 0, {"CL": "Y", "DA": "G", "PP": "GC", "ML": "G", "AU": "G"}], [316, "신사업기획센터", "홍임원", "신사업기획 생산팀", "백영태", "G2", 0, {"CL": "G", "DA": "Y", "ML": "B"}], [317, "신사업기획센터", "홍임원", "신사업기획 생산팀", "황민서", "G3", 0, {}], [318, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "가아인", "G1", 0, {"CL": "Y", "DV": "B", "PE": "B"}], [319, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "문서윤", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "B", "DV": "B", "PE": "GC"}], [320, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "위정우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "SC", "AU": "SC"}], [321, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "강해인", "G1", 0, {"CL": "Y", "DA": "B", "ML": "Y", "DV": "B", "PE": "G"}], [322, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "소준서", "G1", 0, {"CL": "G", "DA": "Y", "ML": "B", "PE": "GC"}], [323, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "방광남", "G3", 0, {"PP": "Y", "ML": "Y", "AU": "G"}], [324, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "엄민준", "G3", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "AU": "SC"}], [325, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "문하윤", "G1", 0, {"CL": "B", "DA": "B", "ML": "B"}], [326, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "노건우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "Y"}], [327, "친환경소재사업본부", "홍임원", "친환경소재 구매팀 2", "임정현", "G3", 0, {"CL": "B", "PP": "B", "ML": "G", "DV": "GC", "AU": "B"}], [328, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "한지호", "G1", 0, {"CL": "G", "DA": "B", "ML": "G", "DV": "G", "PE": "SC"}], [329, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "임지우", "G2", 0, {"DS": "Y", "CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "B", "AU": "SC", "PE": "G"}], [330, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "전아인", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "AU": "B"}], [331, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "마서현", "G2", 0, {"CL": "B", "DA": "G", "PP": "SC", "ML": "G", "DV": "G", "AU": "G"}], [332, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "육준우", "G1", 0, {"CL": "B", "DV": "Y"}], [333, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "유서진", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "B", "AU": "B"}], [334, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "이정우", "G2", 0, {"ML": "Y", "AU": "GC"}], [335, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "명단아", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "AU": "B"}], [336, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "정단아", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "G"}], [337, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "진지민", "G3", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "SC", "AU": "G"}], [338, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "이예준", "G2", 0, {"DA": "G", "PP": "SC", "ML": "SC", "AU": "B"}], [339, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "손하준", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "DV": "G", "AU": "G"}], [340, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "엄다은", "G2", 0, {"CL": "Y", "ML": "B", "AU": "Y"}], [341, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "차서연", "G2", 1, {"DA": "B", "PP": "B", "ML": "G", "AU": "B"}], [342, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "유하준", "G2", 0, {"DA": "B", "ML": "Y"}], [343, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "조지우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "Y", "DV": "SC", "PE": "B"}], [344, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "선지우", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "B"}], [345, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "남단아", "G2", 0, {"CL": "SC", "DA": "G", "ML": "G"}], [346, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "엄서연", "G3", 0, {"CL": "B", "DA": "B", "PP": "B", "ML": "B", "AU": "G"}], [347, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "위도윤", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "B"}], [348, "정밀화학사업본부", "홍임원", "정밀화학 연구팀 3", "주지유", "G3", 0, {"DS": "G", "CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "B"}], [349, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "방나은", "G3", 0, {"PP": "G", "ML": "B", "AU": "Y"}], [350, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "류정우", "G2", 0, {"DA": "G", "PP": "G", "ML": "G"}], [351, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "백지호", "G1", 0, {"CL": "Y", "ML": "Y", "DV": "B"}], [352, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "박예준", "G1", 0, {"CL": "G", "ML": "SC", "DV": "B", "PE": "SC"}], [353, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "우단아", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "Y", "ML": "G", "DV": "G", "AU": "G", "PE": "SC"}], [354, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "구미자", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "SC", "AU": "B"}], [355, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "유아인", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "G", "AU": "B"}], [356, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "허민서", "G3", 0, {"CL": "G", "ML": "B", "AU": "G"}], [357, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "권지호", "G1", 0, {"CL": "B", "DA": "G", "PE": "B"}], [358, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "성예준", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "DV": "B", "AU": "G"}], [359, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "신서진", "G3", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "G", "DV": "B", "AU": "B"}], [360, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "남서진", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "B"}], [361, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "하선우", "G3", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "B", "AU": "B"}], [362, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "정정현", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "SC", "DV": "G", "AU": "B"}], [363, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "설하준", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "B", "AU": "B"}], [364, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "문도윤", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "B", "DV": "G", "AU": "G"}], [365, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "위하은", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "G", "AU": "G"}], [366, "첨단소재사업본부", "주임원", "첨단소재 지원팀 1", "유하윤", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [367, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "장시우", "G3", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "B", "DV": "G", "AU": "G", "PE": "Y"}], [368, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "천건우", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B", "AU": "SC"}], [369, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "진지훈", "G2", 0, {"CL": "G", "DA": "G", "ML": "G", "AU": "G"}], [370, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "하광남", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B"}], [371, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "한선우", "G3", 0, {"CL": "G", "ML": "SC", "AU": "B"}], [372, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "오하은", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "AU": "B"}], [373, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "양주희", "G3", 0, {"CL": "Y", "PP": "G", "ML": "B", "DV": "G", "AU": "G"}], [374, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "송영태", "G3", 0, {"CL": "G", "ML": "G"}], [375, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "마예준", "G1", 0, {"DS": "Y", "CL": "G", "DA": "B", "DV": "SC"}], [376, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "김민서", "G2", 0, {"ML": "G"}], [377, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "홍지우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [378, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "전수아", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "SC", "AU": "G"}], [379, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "조준서", "G3", 0, {"CL": "G", "PP": "G", "ML": "SC", "AU": "B"}], [380, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "문아인", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "AU": "B"}], [381, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "고수아", "G2", 0, {"DA": "B", "PP": "B", "ML": "B", "AU": "G"}], [382, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "마연우", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G", "DV": "GC", "AU": "B", "PE": "B"}], [383, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "옥지아", "G2", 0, {"DA": "B", "ML": "SC", "AU": "G"}], [384, "신사업기획센터", "주임원", "신사업기획 물류팀 3", "윤수아", "G1", 0, {"CL": "G", "DA": "G", "ML": "B", "DV": "B"}], [385, "생산기술센터", "주임원", "생산기술 혁신팀 3", "한주아", "G1", 0, {"CL": "Y", "ML": "G"}], [386, "생산기술센터", "주임원", "생산기술 혁신팀 3", "인영태", "G3", 0, {"CL": "B", "PP": "G", "ML": "B", "DV": "B", "AU": "Y"}], [387, "생산기술센터", "주임원", "생산기술 혁신팀 3", "조봄", "G1", 0, {"CL": "G", "ML": "G", "DV": "SC", "PE": "B"}], [388, "생산기술센터", "주임원", "생산기술 혁신팀 3", "석연우", "G3", 0, {"ML": "B"}], [389, "생산기술센터", "주임원", "생산기술 혁신팀 3", "마서준", "G3", 0, {"CL": "Y", "ML": "B", "AU": "B"}], [390, "생산기술센터", "주임원", "생산기술 혁신팀 3", "전우진", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "SC", "AU": "G"}], [391, "생산기술센터", "주임원", "생산기술 혁신팀 3", "위정현", "G2", 0, {"DA": "Y", "AU": "B"}], [392, "생산기술센터", "주임원", "생산기술 혁신팀 3", "공다은", "G1", 0, {"CL": "B", "DA": "Y", "ML": "Y", "DV": "B", "PE": "SC"}], [393, "생산기술센터", "주임원", "생산기술 혁신팀 3", "길민준", "G3", 0, {"PP": "G", "ML": "Y", "AU": "G"}], [394, "생산기술센터", "주임원", "생산기술 혁신팀 3", "염아인", "G1", 0, {"CL": "B", "DA": "B", "DV": "G", "PE": "G"}], [395, "생산기술센터", "주임원", "생산기술 혁신팀 3", "유광남", "G2", 0, {"DA": "G", "ML": "GC"}], [396, "생산기술센터", "주임원", "생산기술 혁신팀 3", "반지훈", "G2", 0, {"ML": "B", "AU": "B"}], [397, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "노미자", "G3", 0, {"CL": "G", "PP": "B", "ML": "B", "AU": "B"}], [398, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "유정우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "SC", "AU": "Y"}], [399, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "왕주아", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "G"}], [400, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "표민서", "G2", 0, {"DA": "Y", "PP": "G", "ML": "Y", "AU": "SC"}], [401, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "인채원", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "G", "PE": "Y"}], [402, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "손봄", "G2", 0, {"CL": "Y", "DA": "B", "ML": "B", "AU": "B"}], [403, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "남서윤", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "AU": "GC"}], [404, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "심미자", "G1", 0, {"CL": "G", "DV": "G"}], [405, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "노지아", "G3", 0, {"CL": "Y", "DA": "G", "ML": "B", "AU": "G"}], [406, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "인서현", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "AU": "G"}], [407, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "강민준", "G2", 1, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "AU": "GC"}], [408, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "추채원", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "G"}], [409, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "조주아", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "GC", "DV": "B", "AU": "G", "PE": "G"}], [410, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "정준우", "G3", 0, {"CL": "G", "PP": "Y", "ML": "B", "AU": "G"}], [411, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "하주아", "G2", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "G"}], [412, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "이주아", "G1", 1, {"CL": "B", "DA": "G", "ML": "G", "DV": "G", "PE": "B"}], [413, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "한서준", "G2", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "B", "AU": "G"}], [414, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "유건우", "G1", 0, {"CL": "G", "DA": "B"}], [415, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "마미자", "G2", 0, {"DA": "G", "ML": "Y", "AU": "B"}], [416, "바이오소재사업본부", "주임원", "바이오소재 기획팀", "조지유", "G3", 0, {"PP": "G", "ML": "B", "AU": "B"}], [417, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "한서진", "G2", 0, {"DA": "G", "ML": "G"}], [418, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "전해인", "G3", 0, {"CL": "G", "ML": "G", "AU": "B"}], [419, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "연아인", "G1", 0, {"CL": "G", "DA": "G", "ML": "B", "DV": "B", "PE": "B"}], [420, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "배서연", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "DV": "SC", "PE": "G"}], [421, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "안민서", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "SC", "DV": "G", "AU": "B"}], [422, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "왕준우", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "B", "DV": "G", "AU": "B"}], [423, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "유서준", "G2", 0, {"CL": "B", "DA": "B", "PP": "SC", "ML": "B", "DV": "G", "AU": "G"}], [424, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "홍수아", "G3", 0, {"CL": "Y", "PP": "G", "ML": "SC"}], [425, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "염우진", "G3", 0, {"CL": "B", "PP": "G", "ML": "G", "AU": "B"}], [426, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "류미자", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "SC", "AU": "B"}], [427, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "표지유", "G3", 0, {"CL": "Y", "PP": "G", "ML": "Y"}], [428, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "강건우", "G3", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "AU": "B"}], [429, "첨단소재사업본부", "주임원", "첨단소재 영업팀 2", "도봄", "G3", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "B", "PE": "G"}], [430, "DX센터", "정임원", "DX 마케팅팀 3", "허소율", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "B"}], [431, "DX센터", "정임원", "DX 마케팅팀 3", "위유찬", "G1", 0, {"DS": "G", "CL": "Y", "DA": "Y", "ML": "G", "DV": "B", "PE": "G"}], [432, "DX센터", "정임원", "DX 마케팅팀 3", "심하은", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "AU": "B"}], [433, "DX센터", "정임원", "DX 마케팅팀 3", "송준우", "G1", 0, {"CL": "Y"}], [434, "DX센터", "정임원", "DX 마케팅팀 3", "고아인", "G1", 0, {"CL": "G", "ML": "Y", "DV": "B"}], [435, "DX센터", "정임원", "DX 마케팅팀 3", "민민서", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "G"}], [436, "DX센터", "정임원", "DX 마케팅팀 3", "지지우", "G3", 0, {"CL": "B", "DA": "B", "PP": "Y", "ML": "B", "AU": "GC"}], [437, "DX센터", "정임원", "DX 마케팅팀 3", "가우진", "G3", 0, {"CL": "G", "PP": "G", "ML": "B", "AU": "SC"}], [438, "DX센터", "정임원", "DX 마케팅팀 3", "기하준", "G1", 1, {"DS": "Y", "CL": "G", "DA": "G", "ML": "G", "DV": "B"}], [439, "DX센터", "정임원", "DX 마케팅팀 3", "남선우", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "GC", "DV": "G", "AU": "G", "PE": "G"}], [440, "DX센터", "정임원", "DX 마케팅팀 3", "육하은", "G2", 0, {"DA": "Y", "PP": "B", "ML": "B", "AU": "B"}], [441, "DX센터", "정임원", "DX 마케팅팀 3", "양서준", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "SC"}], [442, "DX센터", "정임원", "DX 마케팅팀 3", "왕지우", "G2", 0, {"DA": "Y", "PP": "G", "ML": "B"}], [443, "DX센터", "정임원", "DX 마케팅팀 3", "육서연", "G2", 1, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "DV": "SC", "AU": "B"}], [444, "DX센터", "정임원", "DX 마케팅팀 3", "공민서", "G2", 1, {"DA": "B", "ML": "SC", "AU": "G"}], [445, "DX센터", "정임원", "DX 마케팅팀 3", "엄준서", "G1", 0, {"CL": "G", "DA": "B", "DV": "GC"}], [446, "DX센터", "정임원", "DX 마케팅팀 3", "민주희", "G2", 0, {"CL": "B", "DA": "G", "ML": "G"}], [447, "DX센터", "정임원", "DX 마케팅팀 3", "가아인", "G1", 0, {"DS": "Y", "CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "GC", "PE": "G"}], [448, "DX센터", "정임원", "DX 마케팅팀 3", "고지우", "G3", 0, {"CL": "G", "PP": "B", "ML": "B", "AU": "B"}], [449, "DX센터", "정임원", "DX 마케팅팀 3", "심예준", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "AU": "SC"}], [450, "DX센터", "정임원", "DX 마케팅팀 3", "주도윤", "G3", 0, {"CL": "B", "PP": "G", "ML": "G", "AU": "B"}], [451, "DX센터", "정임원", "DX 마케팅팀 3", "양유찬", "G2", 1, {"DA": "Y", "ML": "G", "AU": "G"}], [452, "DX센터", "정임원", "DX 마케팅팀 3", "노다은", "G1", 0, {"DS": "G", "CL": "G", "DA": "G", "ML": "SC", "DV": "GC", "AU": "G", "PE": "B"}], [453, "DX센터", "정임원", "DX 마케팅팀 3", "선하윤", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "G"}], [454, "DX센터", "정임원", "DX 마케팅팀 3", "방아인", "G1", 0, {"CL": "G", "DA": "G", "ML": "SC", "DV": "GC", "PE": "G"}], [455, "인재개발센터", "정임원", "인재개발 안전팀 3", "가소율", "G3", 0, {"CL": "G", "DA": "B", "ML": "G", "AU": "G"}], [456, "인재개발센터", "정임원", "인재개발 안전팀 3", "유미자", "G1", 1, {"CL": "Y", "DA": "GC"}], [457, "인재개발센터", "정임원", "인재개발 안전팀 3", "김서진", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "B", "DV": "SC", "AU": "G"}], [458, "인재개발센터", "정임원", "인재개발 안전팀 3", "진하준", "G1", 0, {"DS": "Y", "CL": "G", "DA": "SC", "ML": "G", "DV": "G", "AU": "B", "PE": "B"}], [459, "인재개발센터", "정임원", "인재개발 안전팀 3", "현지우", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "AU": "G"}], [460, "인재개발센터", "정임원", "인재개발 안전팀 3", "마광남", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "B", "AU": "B"}], [461, "인재개발센터", "정임원", "인재개발 안전팀 3", "마건우", "G1", 0, {"DS": "Y", "CL": "G", "DA": "Y", "ML": "G", "DV": "B", "PE": "G"}], [462, "인재개발센터", "정임원", "인재개발 안전팀 3", "유서진", "G1", 0, {"CL": "G", "DA": "G", "ML": "B"}], [463, "인재개발센터", "정임원", "인재개발 안전팀 3", "표지호", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "B", "AU": "B"}], [464, "인재개발센터", "정임원", "인재개발 안전팀 3", "박미자", "G3", 0, {"DA": "G", "ML": "B", "AU": "B"}], [465, "인재개발센터", "정임원", "인재개발 안전팀 3", "왕주아", "G2", 0, {"DA": "G", "PP": "B", "ML": "B", "AU": "B"}], [466, "인재개발센터", "정임원", "인재개발 안전팀 3", "라민서", "G3", 0, {"CL": "B", "PP": "G", "ML": "G", "AU": "B"}], [467, "인재개발센터", "정임원", "인재개발 안전팀 3", "윤정우", "G2", 0, {"DA": "Y", "ML": "G"}], [468, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "기하은", "G2", 1, {"CL": "Y", "DA": "G", "ML": "B", "AU": "G"}], [469, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "홍윤서", "G2", 0, {"CL": "G", "DA": "GC", "PP": "G", "ML": "SC", "AU": "B"}], [470, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "강윤서", "G1", 0, {"CL": "Y", "DA": "B"}], [471, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "함시아", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [472, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "원주희", "G2", 0, {"DA": "G", "PP": "B", "ML": "G", "AU": "B"}], [473, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "배정현", "G2", 0, {"CL": "Y", "DA": "B", "ML": "G", "AU": "B"}], [474, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "윤주희", "G3", 0, {"CL": "G", "DA": "SC", "ML": "B", "AU": "SC"}], [475, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "류서준", "G2", 1, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "B", "AU": "G"}], [476, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "손미자", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [477, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "유민준", "G1", 0, {"CL": "Y", "DV": "G"}], [478, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "엄준우", "G1", 0, {"CL": "G", "DA": "G", "ML": "SC", "DV": "G"}], [479, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "여주원", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "DV": "G", "AU": "G"}], [480, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "조연우", "G1", 0, {"CL": "B", "DA": "Y", "ML": "G", "DV": "B", "PE": "SC"}], [481, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "지주희", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "AU": "G"}], [482, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "함지호", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "SC", "AU": "G"}], [483, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "허정현", "G3", 0, {"ML": "G", "AU": "G"}], [484, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "홍소율", "G2", 0, {"CL": "G", "DA": "G", "ML": "G"}], [485, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "채준서", "G2", 0, {"CL": "G", "DA": "B", "ML": "SC", "AU": "G"}], [486, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "인하준", "G2", 1, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "DV": "G", "AU": "G"}], [487, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "천시우", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B", "DV": "G", "AU": "B"}], [488, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "육정현", "G2", 0, {"CL": "G", "DA": "B", "ML": "SC"}], [489, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "유서진", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "G", "DV": "B", "AU": "G"}], [490, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "홍지아", "G1", 0, {"CL": "G", "ML": "G", "DV": "G"}], [491, "신사업기획센터", "정임원", "신사업기획 기획팀 3", "위나은", "G2", 0, {"CL": "B", "DA": "G", "ML": "SC", "AU": "G"}], [492, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "김지훈", "G1", 1, {"DS": "B", "CL": "B", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "B"}], [493, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "홍미자", "G1", 0, {"DS": "G", "CL": "G", "DA": "SC", "ML": "G", "DV": "G", "AU": "B", "PE": "G"}], [494, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "위소율", "G2", 0, {"DA": "G"}], [495, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "신채원", "G2", 0, {"DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [496, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "윤단아", "G3", 0, {}], [497, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "문지우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "SC", "DV": "B", "PE": "B"}], [498, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "송서진", "G1", 0, {"DS": "G", "CL": "B", "DA": "G", "ML": "G", "DV": "B", "PE": "G"}], [499, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "오정우", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "SC", "PE": "G"}], [500, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "유봄", "G1", 0, {"DS": "G", "CL": "G", "DA": "B", "DV": "B", "PE": "Y"}], [501, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "함유찬", "G1", 0, {"CL": "B", "DA": "Y", "ML": "B", "DV": "G"}], [502, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "심민준", "G1", 0, {"CL": "Y", "DA": "B", "DV": "G"}], [503, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "천은우", "G2", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "G", "AU": "G"}], [504, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "문지훈", "G2", 0, {"CL": "G", "DA": "Y", "ML": "G", "AU": "B"}], [505, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "석은우", "G3", 0, {"CL": "G", "ML": "SC", "AU": "G"}], [506, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "백지우", "G2", 0, {"CL": "B", "DA": "B", "ML": "G"}], [507, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "이주아", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "G", "PE": "SC"}], [508, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "유나은", "G2", 0, {"CL": "B", "DA": "B", "PP": "B", "ML": "B"}], [509, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "옥서진", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "SC"}], [510, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "현지유", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "DV": "GC", "PE": "Y"}], [511, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "천광남", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "AU": "SC"}], [512, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "황시우", "G3", 0, {"PP": "B", "ML": "Y", "AU": "B"}], [513, "기초소재사업본부", "김임원", "기초소재 인사팀 2", "금단아", "G2", 0, {"DA": "G", "ML": "G", "AU": "G"}], [514, "구매물류센터", "김임원", "구매물류 환경팀", "조단아", "G2", 1, {"CL": "Y", "DA": "SC", "ML": "SC", "AU": "G"}], [515, "구매물류센터", "김임원", "구매물류 환경팀", "노정현", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "DV": "G", "AU": "Y"}], [516, "구매물류센터", "김임원", "구매물류 환경팀", "염광남", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "AU": "GC"}], [517, "구매물류센터", "김임원", "구매물류 환경팀", "함하은", "G3", 0, {"ML": "SC", "AU": "B"}], [518, "구매물류센터", "김임원", "구매물류 환경팀", "함주원", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "B", "AU": "G"}], [519, "구매물류센터", "김임원", "구매물류 환경팀", "육서윤", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "SC", "DV": "G", "AU": "G"}], [520, "구매물류센터", "김임원", "구매물류 환경팀", "천지호", "G2", 1, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "DV": "SC", "AU": "B"}], [521, "구매물류센터", "김임원", "구매물류 환경팀", "현지아", "G3", 0, {"ML": "G"}], [522, "구매물류센터", "김임원", "구매물류 환경팀", "표채원", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "DV": "G", "AU": "B"}], [523, "구매물류센터", "김임원", "구매물류 환경팀", "신하윤", "G1", 0, {"DS": "B", "CL": "Y", "DA": "G", "ML": "B", "DV": "B", "PE": "G"}], [524, "구매물류센터", "김임원", "구매물류 환경팀", "신민서", "G2", 0, {"CL": "G", "DA": "G", "ML": "B"}], [525, "R&D센터", "김임원", "R&D 개발팀 1", "유준우", "G1", 0, {"CL": "G", "ML": "B"}], [526, "R&D센터", "김임원", "R&D 개발팀 1", "손우진", "G2", 1, {"CL": "B", "DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [527, "R&D센터", "김임원", "R&D 개발팀 1", "옥소율", "G2", 1, {"CL": "G", "DA": "G", "PP": "Y", "ML": "G", "DV": "G", "AU": "G"}], [528, "R&D센터", "김임원", "R&D 개발팀 1", "노해인", "G1", 0, {"CL": "B", "DA": "B", "ML": "G", "DV": "B"}], [529, "R&D센터", "김임원", "R&D 개발팀 1", "류선우", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "G", "AU": "B"}], [530, "R&D센터", "김임원", "R&D 개발팀 1", "심준우", "G2", 0, {"CL": "G", "DA": "G", "ML": "G", "AU": "G"}], [531, "R&D센터", "김임원", "R&D 개발팀 1", "한준서", "G1", 1, {"CL": "G", "DA": "B"}], [532, "R&D센터", "김임원", "R&D 개발팀 1", "우서준", "G1", 0, {"CL": "G", "DA": "G", "ML": "SC"}], [533, "R&D센터", "김임원", "R&D 개발팀 1", "주봄", "G3", 0, {"CL": "G", "PP": "G", "ML": "G", "AU": "G"}], [534, "R&D센터", "김임원", "R&D 개발팀 1", "권채원", "G1", 0, {"CL": "Y", "DA": "G", "DV": "B"}], [535, "R&D센터", "김임원", "R&D 개발팀 1", "유하은", "G1", 0, {"CL": "B", "DA": "Y", "ML": "G", "DV": "G", "PE": "G"}], [536, "R&D센터", "김임원", "R&D 개발팀 1", "추하윤", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "AU": "Y"}], [537, "R&D센터", "김임원", "R&D 개발팀 1", "유주원", "G3", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "G", "AU": "G"}], [538, "R&D센터", "김임원", "R&D 개발팀 1", "금지유", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G"}], [539, "R&D센터", "김임원", "R&D 개발팀 1", "위나은", "G3", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "B", "AU": "GC"}], [540, "R&D센터", "김임원", "R&D 개발팀 1", "위아인", "G2", 0, {"CL": "G", "DA": "SC", "ML": "B", "AU": "B"}], [541, "R&D센터", "김임원", "R&D 개발팀 1", "신지훈", "G2", 0, {"DA": "Y", "PP": "B", "ML": "B"}], [542, "R&D센터", "김임원", "R&D 개발팀 1", "손민서", "G1", 0, {"CL": "G", "DA": "G", "ML": "B", "DV": "B", "PE": "Y"}], [543, "R&D센터", "김임원", "R&D 개발팀 1", "민서준", "G3", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G", "AU": "B"}], [544, "R&D센터", "김임원", "R&D 개발팀 1", "임예준", "G1", 0, {"DS": "G", "CL": "G", "DA": "B", "ML": "G", "DV": "G", "AU": "G", "PE": "G"}], [545, "R&D센터", "김임원", "R&D 개발팀 1", "최서현", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G"}], [546, "R&D센터", "김임원", "R&D 개발팀 1", "금수아", "G3", 0, {"CL": "B", "DA": "Y", "PP": "B", "ML": "G", "AU": "SC"}], [547, "R&D센터", "김임원", "R&D 개발팀 1", "안민서", "G2", 0, {"CL": "B", "DA": "B", "ML": "B", "AU": "G"}], [548, "R&D센터", "김임원", "R&D 개발팀 1", "백시아", "G2", 0, {"DA": "G", "ML": "Y", "AU": "G"}], [549, "R&D센터", "김임원", "R&D 개발팀 1", "윤서진", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "B", "PE": "G"}], [550, "R&D센터", "김임원", "R&D 개발팀 1", "류우진", "G3", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "SC", "AU": "G"}], [551, "R&D센터", "김임원", "R&D 개발팀 1", "염서윤", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "PE": "B"}], [552, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "이단아", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "SC", "DV": "GC", "AU": "SC", "PE": "B"}], [553, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "고하은", "G1", 0, {"DA": "Y", "DV": "B"}], [554, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "육지훈", "G1", 0, {"CL": "G", "DA": "GC", "ML": "G", "DV": "G"}], [555, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "민시아", "G3", 0, {"ML": "B", "AU": "G"}], [556, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "엄서진", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "SC"}], [557, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "여주아", "G3", 0, {"CL": "G", "ML": "B", "AU": "GC"}], [558, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "박지호", "G3", 0, {"CL": "Y", "PP": "G", "ML": "GC", "AU": "G"}], [559, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "우은우", "G1", 0, {"CL": "B", "DA": "SC", "ML": "G", "DV": "GC", "PE": "B"}], [560, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "육광남", "G2", 1, {"CL": "G", "DA": "G", "PP": "SC", "ML": "GC"}], [561, "정밀화학사업본부", "김임원", "정밀화학 연구팀 2", "위다은", "G2", 0, {"DA": "B", "ML": "G"}], [562, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "길선우", "G1", 0, {"CL": "B", "ML": "G", "PE": "SC"}], [563, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "라주아", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "G", "DV": "GC", "PE": "G"}], [564, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "염서진", "G2", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "G", "DV": "B", "AU": "B"}], [565, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "정광남", "G1", 0, {"CL": "G", "DA": "SC", "DV": "G"}], [566, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "함서준", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [567, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "라서현", "G3", 0, {"CL": "B", "DA": "B", "PP": "Y", "ML": "G", "DV": "G", "AU": "G"}], [568, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "허하준", "G3", 0, {"CL": "B", "PP": "G", "ML": "B", "AU": "B"}], [569, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "정하윤", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "SC", "DV": "G", "AU": "B"}], [570, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "표정현", "G1", 0, {"DS": "Y", "CL": "G", "DA": "B", "ML": "G", "DV": "B", "AU": "B", "PE": "B"}], [571, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "임민준", "G2", 0, {"ML": "G"}], [572, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "오단아", "G2", 0, {"CL": "G", "DA": "Y", "PP": "SC", "ML": "SC", "AU": "Y"}], [573, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "인시아", "G1", 0, {"CL": "B", "DA": "G", "DV": "B", "PE": "SC"}], [574, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "고정현", "G2", 0, {"CL": "B", "DA": "B", "ML": "GC", "AU": "B"}], [575, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "임준서", "G2", 0, {"DA": "G", "ML": "G", "AU": "SC"}], [576, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "우서연", "G3", 0, {"CL": "Y", "PP": "G", "ML": "G", "AU": "G"}], [577, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "방시아", "G1", 0, {"CL": "Y", "DA": "SC", "ML": "B", "DV": "G"}], [578, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "홍주원", "G1", 0, {"CL": "B", "DA": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "B"}], [579, "글로벌사업센터", "김임원", "글로벌사업 마케팅팀", "위민준", "G2", 1, {"CL": "Y", "DA": "G", "PP": "G", "ML": "GC"}], [580, "구매물류센터", "허임원", "구매물류 AX팀 2", "남하은", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "G", "AU": "G"}], [581, "구매물류센터", "허임원", "구매물류 AX팀 2", "차주희", "G2", 0, {"CL": "Y", "DA": "B", "ML": "B"}], [582, "구매물류센터", "허임원", "구매물류 AX팀 2", "정광남", "G3", 0, {"CL": "G", "PP": "Y", "ML": "B", "AU": "SC"}], [583, "구매물류센터", "허임원", "구매물류 AX팀 2", "전미자", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "AU": "B"}], [584, "구매물류센터", "허임원", "구매물류 AX팀 2", "함예준", "G1", 0, {"DS": "B", "CL": "Y", "DA": "Y", "ML": "G", "DV": "B", "AU": "B", "PE": "G"}], [585, "구매물류센터", "허임원", "구매물류 AX팀 2", "성아인", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "GC"}], [586, "구매물류센터", "허임원", "구매물류 AX팀 2", "곽단아", "G2", 0, {"CL": "G", "DA": "G", "ML": "B"}], [587, "구매물류센터", "허임원", "구매물류 AX팀 2", "연아인", "G2", 0, {"CL": "B", "ML": "B"}], [588, "구매물류센터", "허임원", "구매물류 AX팀 2", "전준우", "G3", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "B", "AU": "G"}], [589, "구매물류센터", "허임원", "구매물류 AX팀 2", "정하윤", "G3", 0, {"CL": "G", "PP": "G", "ML": "B", "AU": "G"}], [590, "구매물류센터", "허임원", "구매물류 AX팀 2", "신나은", "G1", 0, {"DS": "Y", "CL": "B", "DA": "G", "ML": "G", "DV": "G"}], [591, "구매물류센터", "허임원", "구매물류 AX팀 2", "신서윤", "G2", 0, {"CL": "G", "DA": "B", "ML": "B", "AU": "G"}], [592, "구매물류센터", "허임원", "구매물류 AX팀 2", "허영태", "G2", 0, {"CL": "Y", "DA": "B", "ML": "B", "AU": "B"}], [593, "구매물류센터", "허임원", "구매물류 AX팀 2", "성수아", "G1", 1, {"CL": "Y", "DA": "G", "ML": "G", "DV": "G"}], [594, "구매물류센터", "허임원", "구매물류 AX팀 2", "유우진", "G2", 0, {"ML": "Y", "AU": "B"}], [595, "구매물류센터", "허임원", "구매물류 AX팀 2", "전영태", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "SC", "PE": "Y"}], [596, "구매물류센터", "허임원", "구매물류 AX팀 2", "백지우", "G3", 0, {"CL": "G", "PP": "Y", "ML": "G", "DV": "B", "AU": "SC"}], [597, "구매물류센터", "허임원", "구매물류 AX팀 2", "정다은", "G3", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "GC", "AU": "B"}], [598, "구매물류센터", "허임원", "구매물류 AX팀 2", "라서진", "G1", 0, {"DA": "Y", "ML": "Y", "DV": "G"}], [599, "구매물류센터", "허임원", "구매물류 AX팀 2", "추선우", "G2", 0, {"CL": "G", "DA": "G", "ML": "G", "AU": "G"}], [600, "구매물류센터", "허임원", "구매물류 AX팀 2", "천정현", "G2", 0, {"CL": "Y", "DA": "B", "PP": "SC", "ML": "B", "DV": "G", "AU": "G"}], [601, "구매물류센터", "허임원", "구매물류 AX팀 2", "송지호", "G2", 0, {"DA": "G", "PP": "B", "ML": "G", "AU": "Y"}], [602, "구매물류센터", "허임원", "구매물류 AX팀 2", "석수아", "G2", 0, {"CL": "B", "DA": "B", "ML": "Y"}], [603, "구매물류센터", "허임원", "구매물류 AX팀 2", "심도윤", "G3", 0, {"CL": "SC", "ML": "SC", "AU": "B"}], [604, "구매물류센터", "허임원", "구매물류 AX팀 2", "강지훈", "G2", 0, {"DS": "Y", "CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "DV": "B", "AU": "SC", "PE": "G"}], [605, "구매물류센터", "허임원", "구매물류 AX팀 2", "육우진", "G2", 0, {"CL": "SC", "DA": "B", "ML": "SC", "AU": "G"}], [606, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "박민준", "G1", 0, {"CL": "G", "DA": "Y", "DV": "B", "PE": "G"}], [607, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "연소율", "G2", 0, {"CL": "G", "PP": "Y", "ML": "G"}], [608, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "차봄", "G1", 0, {"CL": "B", "DA": "G", "ML": "SC", "DV": "B", "AU": "G", "PE": "B"}], [609, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "민해인", "G1", 0, {"CL": "Y", "DA": "G", "ML": "SC", "DV": "B", "AU": "G", "PE": "Y"}], [610, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "류다은", "G1", 0, {"CL": "B", "DA": "SC", "ML": "G", "DV": "G", "PE": "B"}], [611, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "선주희", "G1", 0, {"CL": "Y", "DV": "G"}], [612, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "채채원", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "B"}], [613, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "김봄", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G"}], [614, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "위유찬", "G1", 0, {"CL": "Y", "DA": "G", "DV": "G", "PE": "B"}], [615, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "왕광남", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [616, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "송지유", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "SC", "PE": "G"}], [617, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "신지아", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "G"}], [618, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "장하준", "G1", 0, {"CL": "B", "DA": "G", "ML": "B", "DV": "B"}], [619, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "노주아", "G1", 0, {"DS": "G", "CL": "Y", "DA": "B", "ML": "SC", "DV": "G", "PE": "G"}], [620, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "옥시우", "G1", 0, {"CL": "G", "DA": "B"}], [621, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "반정우", "G1", 0, {"CL": "G", "DA": "G"}], [622, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "신주희", "G3", 0, {"CL": "G", "DA": "Y", "ML": "G", "AU": "G"}], [623, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "민은우", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "Y", "DV": "B"}], [624, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "박아인", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "GC", "AU": "B"}], [625, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "조수아", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "SC", "DV": "SC", "AU": "Y"}], [626, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "엄지유", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "DV": "G", "AU": "SC"}], [627, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "류주희", "G2", 0, {"CL": "Y", "DA": "Y", "ML": "SC", "AU": "B"}], [628, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "성단아", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "G", "DV": "G"}], [629, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "황유찬", "G3", 0, {"CL": "G", "PP": "GC", "ML": "G", "AU": "B"}], [630, "환경안전센터", "허임원", "환경안전 마케팅팀 2", "소도윤", "G1", 0, {"CL": "B", "DA": "B", "DV": "G"}], [631, "환경안전센터", "허임원", "환경안전 인사팀 1", "우해인", "G1", 0, {"DS": "B", "CL": "B", "DA": "B", "ML": "SC", "DV": "G", "PE": "B"}], [632, "환경안전센터", "허임원", "환경안전 인사팀 1", "강정우", "G3", 0, {"CL": "G", "ML": "G", "AU": "B"}], [633, "환경안전센터", "허임원", "환경안전 인사팀 1", "장해인", "G3", 0, {"DA": "G", "PP": "G", "ML": "G", "AU": "B"}], [634, "환경안전센터", "허임원", "환경안전 인사팀 1", "임연우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "G"}], [635, "환경안전센터", "허임원", "환경안전 인사팀 1", "천서진", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "SC", "AU": "G"}], [636, "환경안전센터", "허임원", "환경안전 인사팀 1", "표수아", "G3", 0, {"CL": "Y", "PP": "G", "ML": "G", "AU": "B"}], [637, "환경안전센터", "허임원", "환경안전 인사팀 1", "송지호", "G2", 0, {"CL": "Y", "DA": "Y", "ML": "SC", "AU": "G"}], [638, "환경안전센터", "허임원", "환경안전 인사팀 1", "설예준", "G1", 0, {"CL": "G", "DA": "SC", "ML": "B", "PE": "Y"}], [639, "환경안전센터", "허임원", "환경안전 인사팀 1", "원주희", "G2", 0, {"CL": "Y", "ML": "G"}], [640, "환경안전센터", "허임원", "환경안전 인사팀 1", "차하윤", "G1", 0, {"CL": "Y", "DA": "B", "ML": "SC", "DV": "B", "PE": "G"}], [641, "환경안전센터", "허임원", "환경안전 인사팀 1", "염지민", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "SC", "DV": "B", "AU": "B", "PE": "G"}], [642, "환경안전센터", "허임원", "환경안전 인사팀 1", "조지훈", "G3", 0, {"ML": "B", "AU": "GC"}], [643, "환경안전센터", "허임원", "환경안전 인사팀 1", "윤시우", "G1", 0, {"CL": "B", "DA": "B", "ML": "G", "DV": "G"}], [644, "환경안전센터", "허임원", "환경안전 인사팀 1", "손건우", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "SC", "AU": "G"}], [645, "환경안전센터", "허임원", "환경안전 인사팀 1", "성서연", "G1", 0, {"DS": "G", "CL": "Y", "DA": "B", "PP": "G", "ML": "B", "DV": "G", "AU": "GC", "TB": "SC", "PE": "B"}], [646, "환경안전센터", "허임원", "환경안전 인사팀 1", "양시아", "G3", 0, {"PP": "Y", "ML": "G", "AU": "B"}], [647, "환경안전센터", "허임원", "환경안전 인사팀 1", "배서현", "G2", 1, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "AU": "G"}], [648, "환경안전센터", "허임원", "환경안전 인사팀 1", "김우진", "G2", 1, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "G", "DV": "G", "AU": "SC", "PE": "G"}], [649, "환경안전센터", "허임원", "환경안전 인사팀 1", "강연우", "G2", 0, {"CL": "G", "DA": "SC", "ML": "SC", "AU": "B"}], [650, "환경안전센터", "허임원", "환경안전 인사팀 1", "현도윤", "G3", 0, {"CL": "Y", "ML": "B", "AU": "SC"}], [651, "R&D센터", "허임원", "R&D 관리팀", "허윤서", "G1", 1, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "G"}], [652, "R&D센터", "허임원", "R&D 관리팀", "최민서", "G2", 0, {"CL": "G", "DA": "Y", "PP": "Y", "ML": "B", "DV": "G", "AU": "G"}], [653, "R&D센터", "허임원", "R&D 관리팀", "민서진", "G1", 0, {"CL": "G"}], [654, "R&D센터", "허임원", "R&D 관리팀", "임주원", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "GC", "AU": "SC"}], [655, "R&D센터", "허임원", "R&D 관리팀", "조유찬", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "DV": "G", "AU": "G"}], [656, "R&D센터", "허임원", "R&D 관리팀", "지해인", "G2", 0, {"CL": "B", "DA": "SC", "PP": "B", "ML": "G", "AU": "SC"}], [657, "R&D센터", "허임원", "R&D 관리팀", "함지민", "G2", 0, {"DA": "G", "ML": "B", "AU": "G"}], [658, "R&D센터", "허임원", "R&D 관리팀", "안하윤", "G1", 0, {"CL": "Y", "DA": "G", "DV": "G"}], [659, "R&D센터", "허임원", "R&D 관리팀", "송지유", "G2", 0, {"DS": "Y", "CL": "Y", "DA": "G", "PP": "G", "ML": "SC", "DV": "SC", "AU": "B", "PE": "G"}], [660, "R&D센터", "허임원", "R&D 관리팀", "강연우", "G2", 0, {"DA": "B", "PP": "B", "ML": "G", "AU": "G"}], [661, "R&D센터", "허임원", "R&D 관리팀", "기예준", "G3", 0, {"CL": "Y", "ML": "GC", "AU": "G"}], [662, "R&D센터", "허임원", "R&D 관리팀", "조주원", "G3", 0, {"ML": "G"}], [663, "R&D센터", "허임원", "R&D 관리팀", "표선우", "G3", 0, {"CL": "Y", "DA": "B", "ML": "SC", "AU": "B"}], [664, "R&D센터", "허임원", "R&D 관리팀", "공아인", "G2", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "GC", "AU": "G"}], [665, "R&D센터", "허임원", "R&D 관리팀", "현정우", "G2", 0, {"CL": "G", "DA": "G", "ML": "B"}], [666, "R&D센터", "허임원", "R&D 관리팀", "공미자", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "PP": "G", "ML": "B", "DV": "G", "AU": "B", "PE": "B"}], [667, "R&D센터", "허임원", "R&D 관리팀", "권서준", "G3", 0, {"CL": "Y", "ML": "G", "AU": "Y"}], [668, "R&D센터", "허임원", "R&D 관리팀", "현영태", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "G"}], [669, "R&D센터", "허임원", "R&D 관리팀", "인미자", "G3", 0, {"CL": "G", "DA": "Y", "ML": "G"}], [670, "R&D센터", "허임원", "R&D 관리팀", "노주희", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "SC", "AU": "B"}], [671, "R&D센터", "허임원", "R&D 관리팀", "하예준", "G2", 0, {"ML": "B"}], [672, "R&D센터", "허임원", "R&D 관리팀", "왕건우", "G3", 0, {"CL": "Y", "DA": "SC", "ML": "G", "AU": "SC"}], [673, "R&D센터", "박임원", "R&D 사업팀 1", "배선우", "G2", 0, {"CL": "SC", "DA": "GC", "ML": "G"}], [674, "R&D센터", "박임원", "R&D 사업팀 1", "여서진", "G1", 0, {"CL": "Y", "DA": "G", "ML": "GC", "DV": "G"}], [675, "R&D센터", "박임원", "R&D 사업팀 1", "임다은", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "DV": "G", "AU": "G"}], [676, "R&D센터", "박임원", "R&D 사업팀 1", "신준우", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B"}], [677, "R&D센터", "박임원", "R&D 사업팀 1", "신유찬", "G2", 0, {"CL": "B", "DA": "G", "PP": "SC", "ML": "G", "AU": "B"}], [678, "R&D센터", "박임원", "R&D 사업팀 1", "주시우", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "AU": "SC"}], [679, "R&D센터", "박임원", "R&D 사업팀 1", "황지훈", "G3", 0, {"CL": "B", "DA": "SC", "PP": "B", "ML": "B", "AU": "Y"}], [680, "R&D센터", "박임원", "R&D 사업팀 1", "차광남", "G1", 0, {"CL": "Y", "DA": "G", "DV": "B"}], [681, "R&D센터", "박임원", "R&D 사업팀 1", "염미자", "G2", 0, {"CL": "G", "DA": "Y", "ML": "G", "AU": "G"}], [682, "R&D센터", "박임원", "R&D 사업팀 1", "송주아", "G2", 0, {"CL": "SC", "DA": "G", "ML": "SC"}], [683, "R&D센터", "박임원", "R&D 사업팀 1", "지지우", "G1", 0, {"CL": "G", "DA": "B", "ML": "G", "DV": "SC", "PE": "B"}], [684, "R&D센터", "박임원", "R&D 사업팀 1", "심광남", "G2", 0, {"CL": "B", "ML": "G"}], [685, "신사업기획센터", "박임원", "신사업기획 연구팀", "장미자", "G2", 0, {"CL": "B", "DA": "G", "PP": "SC", "ML": "G", "DV": "G", "AU": "B", "PE": "G"}], [686, "신사업기획센터", "박임원", "신사업기획 연구팀", "공시아", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "SC"}], [687, "신사업기획센터", "박임원", "신사업기획 연구팀", "옥하은", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "B", "DV": "G", "AU": "Y"}], [688, "신사업기획센터", "박임원", "신사업기획 연구팀", "곽민서", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B", "DV": "SC"}], [689, "신사업기획센터", "박임원", "신사업기획 연구팀", "공나은", "G1", 0, {"CL": "G", "DA": "G", "ML": "B", "DV": "Y"}], [690, "신사업기획센터", "박임원", "신사업기획 연구팀", "추광남", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "GC", "AU": "Y"}], [691, "신사업기획센터", "박임원", "신사업기획 연구팀", "권서준", "G3", 0, {"CL": "G", "PP": "G", "ML": "B", "AU": "B"}], [692, "신사업기획센터", "박임원", "신사업기획 연구팀", "유소율", "G2", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "G", "DV": "SC", "AU": "G", "PE": "B"}], [693, "신사업기획센터", "박임원", "신사업기획 연구팀", "오주희", "G1", 0, {"CL": "B", "DA": "SC", "ML": "B", "DV": "G"}], [694, "신사업기획센터", "박임원", "신사업기획 연구팀", "손지유", "G2", 1, {"CL": "Y", "DA": "G", "ML": "B", "AU": "B"}], [695, "신사업기획센터", "박임원", "신사업기획 연구팀", "조연우", "G2", 0, {"DA": "G", "ML": "G", "AU": "B"}], [696, "신사업기획센터", "박임원", "신사업기획 연구팀", "배봄", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "G", "PE": "G"}], [697, "신사업기획센터", "박임원", "신사업기획 연구팀", "정수아", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "DV": "G", "AU": "B"}], [698, "신사업기획센터", "박임원", "신사업기획 연구팀", "노서연", "G2", 0, {"CL": "G", "DA": "B", "ML": "G", "AU": "G"}], [699, "신사업기획센터", "박임원", "신사업기획 연구팀", "우영태", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "B"}], [700, "신사업기획센터", "박임원", "신사업기획 연구팀", "안서준", "G1", 0, {"DS": "G", "CL": "G", "DA": "B", "ML": "B", "DV": "G", "AU": "G", "PE": "G"}], [701, "신사업기획센터", "박임원", "신사업기획 연구팀", "표봄", "G2", 0, {"CL": "Y", "ML": "G", "AU": "SC"}], [702, "신사업기획센터", "박임원", "신사업기획 연구팀", "차채원", "G3", 0, {"CL": "B", "ML": "SC", "AU": "B"}], [703, "신사업기획센터", "박임원", "신사업기획 연구팀", "송서현", "G3", 0, {"CL": "Y", "ML": "SC", "AU": "G"}], [704, "신사업기획센터", "박임원", "신사업기획 연구팀", "민주희", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "AU": "B"}], [705, "신사업기획센터", "박임원", "신사업기획 연구팀", "추서준", "G2", 0, {"CL": "G", "DA": "Y", "ML": "G", "AU": "GC"}], [706, "신사업기획센터", "박임원", "신사업기획 연구팀", "오윤서", "G2", 0, {"ML": "G"}], [707, "신사업기획센터", "박임원", "신사업기획 연구팀", "라지호", "G2", 0, {"DA": "G", "PP": "B", "ML": "B"}], [708, "신사업기획센터", "박임원", "신사업기획 연구팀", "차주희", "G1", 0, {"DS": "Y", "CL": "B", "DA": "G", "ML": "SC", "DV": "SC", "PE": "Y"}], [709, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "현봄", "G1", 0, {"DS": "Y", "CL": "B", "DA": "B", "ML": "G", "DV": "B", "PE": "B"}], [710, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "함영태", "G3", 0, {"CL": "Y", "PP": "G", "ML": "G"}], [711, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "명정현", "G1", 0, {"CL": "Y", "DA": "G", "DV": "G", "PE": "G"}], [712, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "백도윤", "G1", 0, {"CL": "G", "DA": "GC", "ML": "SC"}], [713, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "정서현", "G3", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "B", "DV": "G", "AU": "G"}], [714, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "한채원", "G1", 0, {"CL": "Y", "ML": "G", "DV": "B"}], [715, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "유지호", "G1", 0, {"CL": "Y", "ML": "G", "DV": "G"}], [716, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "구윤서", "G3", 0, {"CL": "Y", "PP": "SC", "ML": "G", "AU": "B"}], [717, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "허건우", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "Y"}], [718, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "김나은", "G2", 0, {"CL": "B", "DA": "G", "ML": "G", "AU": "B"}], [719, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "인다은", "G3", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "B"}], [720, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "왕준우", "G3", 0, {"CL": "B", "PP": "G", "ML": "SC"}], [721, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "장지아", "G3", 0, {"CL": "B", "ML": "B"}], [722, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "기지민", "G3", 0, {"CL": "G", "PP": "G", "ML": "G", "AU": "SC"}], [723, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "소민서", "G2", 0, {"DA": "Y", "PP": "G", "ML": "Y"}], [724, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "인지민", "G2", 0, {"CL": "Y", "DA": "SC", "PP": "B", "ML": "G", "DV": "B", "AU": "G"}], [725, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "노서현", "G2", 0, {"CL": "G", "DA": "G", "ML": "SC"}], [726, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "민우진", "G2", 1, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "AU": "B"}], [727, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "여서윤", "G2", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "B"}], [728, "친환경소재사업본부", "박임원", "친환경소재 지원팀", "함도윤", "G2", 0, {"DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [729, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "여영태", "G1", 0, {"DS": "Y", "CL": "B", "DA": "G", "ML": "G", "DV": "SC", "PE": "B"}], [730, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "조민준", "G3", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "GC", "DV": "SC", "AU": "Y"}], [731, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "임단아", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "G", "PE": "B"}], [732, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "기다은", "G2", 1, {"CL": "G", "DA": "Y", "PP": "Y", "ML": "G", "DV": "B", "AU": "B"}], [733, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "신지민", "G1", 0, {"CL": "SC", "DA": "B", "ML": "G"}], [734, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "위준우", "G1", 0, {"CL": "G", "DA": "Y", "ML": "SC", "DV": "G", "PE": "G"}], [735, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "여예준", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "G"}], [736, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "금하준", "G3", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "DV": "B", "AU": "B", "PE": "B"}], [737, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "공하윤", "G2", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "G", "DV": "B", "AU": "B"}], [738, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "서준우", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G", "AU": "Y"}], [739, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "강서윤", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "SC", "AU": "Y"}], [740, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "유지민", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "GC", "PE": "GC"}], [741, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "추서현", "G3", 0, {"CL": "G", "PP": "G", "ML": "Y"}], [742, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "조은우", "G1", 0, {"DS": "G", "CL": "G", "DA": "G", "ML": "G", "DV": "G", "PE": "SC"}], [743, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "전지민", "G2", 0, {"DA": "Y", "ML": "Y", "AU": "G"}], [744, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "소선우", "G1", 0, {"CL": "G", "DA": "B", "ML": "B", "DV": "B"}], [745, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "표지유", "G1", 0, {"CL": "G", "DA": "SC", "DV": "SC", "PE": "B"}], [746, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "유미자", "G3", 0, {"CL": "Y", "ML": "B", "AU": "B"}], [747, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "추미자", "G1", 0, {"CL": "Y", "DA": "G", "DV": "Y"}], [748, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "석광남", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [749, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "차지민", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "DV": "SC", "AU": "G", "PE": "Y"}], [750, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "윤준서", "G2", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "G", "AU": "G"}], [751, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "백주희", "G2", 0, {"CL": "G", "DA": "G", "ML": "G"}], [752, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "전미자", "G2", 0, {"DA": "Y", "PP": "Y", "ML": "B", "AU": "B"}], [753, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "인주희", "G1", 0, {"CL": "G", "DA": "Y", "ML": "GC", "DV": "B", "PE": "G"}], [754, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "남예준", "G3", 0, {"CL": "G", "PP": "Y", "ML": "G", "AU": "B"}], [755, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "조수아", "G2", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "B", "DV": "B", "AU": "Y"}], [756, "신사업기획센터", "박임원", "신사업기획 인사팀 3", "지시우", "G1", 0, {"CL": "G", "DA": "B", "ML": "G", "DV": "G"}], [757, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "추서윤", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B"}], [758, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "표서윤", "G1", 1, {"CL": "G", "DA": "B", "ML": "G", "DV": "GC"}], [759, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "마소율", "G1", 1, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G", "PE": "G"}], [760, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "하채원", "G3", 0, {"CL": "Y", "PP": "SC", "ML": "SC", "AU": "GC"}], [761, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "조수아", "G1", 1, {"CL": "Y", "DA": "SC", "DV": "G"}], [762, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "강해인", "G3", 0, {"CL": "B", "PP": "Y", "ML": "G", "DV": "B", "AU": "G"}], [763, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "권소율", "G3", 0, {"PP": "G", "ML": "B", "AU": "SC"}], [764, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "주아인", "G2", 0, {"CL": "Y", "DA": "B", "PP": "SC", "ML": "SC", "AU": "Y"}], [765, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "명지민", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "SC"}], [766, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "장영태", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "B", "AU": "G"}], [767, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "장선우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "B", "DV": "SC", "AU": "B", "PE": "G"}], [768, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "허유찬", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "B", "DV": "B", "PE": "G"}], [769, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "도나은", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "AU": "SC"}], [770, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "노소율", "G3", 0, {"CL": "Y", "ML": "B", "AU": "B"}], [771, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "라민서", "G2", 0, {"DA": "Y", "PP": "Y", "ML": "B", "AU": "B"}], [772, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "노은우", "G2", 0, {"DA": "Y", "PP": "G", "ML": "SC", "AU": "GC"}], [773, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "공지호", "G3", 0, {"CL": "Y", "PP": "SC", "ML": "SC", "AU": "G"}], [774, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "민민서", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "DV": "SC", "AU": "B"}], [775, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "유준서", "G3", 0, {"CL": "G", "PP": "G", "ML": "G", "AU": "SC"}], [776, "기초소재사업본부", "박임원", "기초소재 물류팀 1", "유아인", "G1", 0, {"CL": "G", "DA": "G", "DV": "B", "PE": "G"}], [777, "인재개발센터", "명임원", "인재개발 관리팀 1", "하하윤", "G3", 0, {"CL": "B", "ML": "Y"}], [778, "인재개발센터", "명임원", "인재개발 관리팀 1", "임나은", "G3", 0, {"CL": "G", "ML": "G"}], [779, "인재개발센터", "명임원", "인재개발 관리팀 1", "길하윤", "G2", 0, {"CL": "G", "DA": "G", "ML": "G", "AU": "G"}], [780, "인재개발센터", "명임원", "인재개발 관리팀 1", "함윤서", "G1", 0, {"CL": "B", "DA": "Y", "ML": "B", "DV": "B", "PE": "B"}], [781, "인재개발센터", "명임원", "인재개발 관리팀 1", "하채원", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "G"}], [782, "인재개발센터", "명임원", "인재개발 관리팀 1", "류나은", "G1", 0, {"DS": "G", "CL": "G", "DA": "SC", "ML": "B", "DV": "B", "PE": "SC"}], [783, "인재개발센터", "명임원", "인재개발 관리팀 1", "정지호", "G3", 0, {"DA": "Y", "ML": "B", "AU": "B"}], [784, "인재개발센터", "명임원", "인재개발 관리팀 1", "함영태", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "PE": "SC"}], [785, "인재개발센터", "명임원", "인재개발 관리팀 1", "길주희", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "G", "PE": "SC"}], [786, "인재개발센터", "명임원", "인재개발 관리팀 1", "염우진", "G2", 0, {"DA": "G", "PP": "G", "ML": "B"}], [787, "인재개발센터", "명임원", "인재개발 관리팀 1", "라광남", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "PE": "B"}], [788, "인재개발센터", "명임원", "인재개발 관리팀 1", "추시아", "G2", 0, {}], [789, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "설나은", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "SC"}], [790, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "권수아", "G3", 0, {"CL": "Y", "PP": "G", "ML": "B", "AU": "Y"}], [791, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "이광남", "G1", 0, {"DS": "B", "CL": "Y", "DA": "G", "ML": "G", "DV": "G", "PE": "SC"}], [792, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "심수아", "G2", 0, {"CL": "B", "DA": "B", "ML": "B"}], [793, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "선유찬", "G2", 0, {"DA": "G", "ML": "GC", "AU": "G"}], [794, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "원미자", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "SC", "AU": "SC"}], [795, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "육지유", "G3", 0, {"CL": "B", "ML": "G", "AU": "SC"}], [796, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "현수아", "G1", 0, {"DS": "G", "CL": "G", "DA": "G", "ML": "B", "DV": "G"}], [797, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "하해인", "G3", 0, {"CL": "B", "PP": "SC", "ML": "B", "AU": "G"}], [798, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "차정현", "G3", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "B", "DV": "G", "AU": "SC", "PE": "G"}], [799, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "유아인", "G2", 0, {"DA": "B", "ML": "B"}], [800, "정밀화학사업본부", "명임원", "정밀화학 품질팀 1", "전서준", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "Y", "ML": "B", "DV": "G", "AU": "B", "PE": "Y"}], [801, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "현지민", "G3", 0, {"CL": "G", "PP": "G", "ML": "SC", "AU": "G"}], [802, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "연서윤", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "SC", "DV": "SC", "AU": "G"}], [803, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "정수아", "G1", 0, {"CL": "B", "DA": "Y", "ML": "G"}], [804, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "유나은", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "B", "AU": "Y"}], [805, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "우시우", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "SC", "ML": "G", "DV": "B", "PE": "G"}], [806, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "남연우", "G1", 0, {"CL": "B", "DA": "B"}], [807, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "라채원", "G2", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "G"}], [808, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "육지아", "G2", 0, {"CL": "B", "DA": "Y", "PP": "B", "ML": "G"}], [809, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "현하윤", "G2", 0, {"CL": "Y", "DA": "B", "ML": "B"}], [810, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "유시아", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "SC", "AU": "G"}], [811, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "추주희", "G2", 0, {"PP": "B", "ML": "G"}], [812, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "공다은", "G2", 0, {"DA": "Y", "PP": "G", "ML": "G", "AU": "B"}], [813, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "고건우", "G3", 0, {"CL": "Y", "PP": "B", "ML": "B", "AU": "Y"}], [814, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "도채원", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "G", "AU": "B"}], [815, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "최은우", "G2", 0, {"CL": "B", "DA": "Y", "PP": "B", "ML": "B", "DV": "G", "AU": "G"}], [816, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "금시아", "G2", 0, {"CL": "G", "DA": "B", "ML": "GC"}], [817, "친환경소재사업본부", "명임원", "친환경소재 지원팀", "유서진", "G2", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "G"}], [818, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "염하은", "G3", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "G", "AU": "G"}], [819, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "설지훈", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "B"}], [820, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "인유찬", "G2", 0, {"DA": "Y", "ML": "G"}], [821, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "곽소율", "G1", 0, {"CL": "G", "DV": "G"}], [822, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "홍단아", "G3", 0, {"ML": "G"}], [823, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "유영태", "G2", 1, {"CL": "B", "DA": "Y", "ML": "G"}], [824, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "방하은", "G2", 0, {"DA": "G", "PP": "Y", "ML": "GC"}], [825, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "채정현", "G3", 0, {"CL": "G", "ML": "G"}], [826, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "전주희", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "B", "PE": "Y"}], [827, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "도연우", "G1", 0, {"DS": "G", "CL": "Y", "DA": "G", "ML": "G", "DV": "G"}], [828, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "유은우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [829, "신사업기획센터", "명임원", "신사업기획 사업팀 2", "염선우", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [830, "품질경영센터", "채임원", "품질경영 회계팀", "석서연", "G3", 0, {"CL": "G", "ML": "Y", "AU": "SC"}], [831, "품질경영센터", "채임원", "품질경영 회계팀", "홍우진", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "G", "DV": "B", "AU": "G"}], [832, "품질경영센터", "채임원", "품질경영 회계팀", "신연우", "G2", 0, {"CL": "B", "DA": "G", "PP": "SC", "ML": "G", "AU": "G"}], [833, "품질경영센터", "채임원", "품질경영 회계팀", "배나은", "G3", 0, {"CL": "B", "ML": "G", "AU": "B"}], [834, "품질경영센터", "채임원", "품질경영 회계팀", "전우진", "G2", 0, {"DA": "G", "ML": "B", "AU": "G"}], [835, "품질경영센터", "채임원", "품질경영 회계팀", "양정현", "G2", 0, {"PP": "Y", "ML": "B"}], [836, "품질경영센터", "채임원", "품질경영 회계팀", "육은우", "G1", 0, {"CL": "Y", "DA": "GC", "ML": "G", "DV": "B", "PE": "G"}], [837, "품질경영센터", "채임원", "품질경영 회계팀", "신지호", "G1", 0, {"CL": "B", "ML": "SC", "DV": "GC"}], [838, "품질경영센터", "채임원", "품질경영 회계팀", "설하은", "G1", 0, {"CL": "Y", "ML": "G", "DV": "SC"}], [839, "품질경영센터", "채임원", "품질경영 회계팀", "진하준", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "B", "AU": "G"}], [840, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "천소율", "G3", 0, {"CL": "G", "PP": "B", "ML": "SC", "AU": "SC"}], [841, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "함지아", "G1", 0, {"CL": "Y", "DA": "B", "PE": "G"}], [842, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "안은우", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "SC", "DV": "B", "PE": "SC"}], [843, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "공시아", "G3", 0, {"CL": "B", "ML": "GC", "AU": "Y"}], [844, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "라도윤", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "G"}], [845, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "기광남", "G3", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "B", "AU": "G"}], [846, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "명미자", "G3", 0, {"CL": "G", "PP": "B", "ML": "G", "AU": "Y"}], [847, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "문선우", "G3", 0, {"CL": "Y", "PP": "G", "ML": "B", "AU": "Y"}], [848, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "권단아", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "DV": "G", "AU": "G", "PE": "B"}], [849, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "우하은", "G2", 0, {"CL": "Y", "DA": "B", "ML": "G"}], [850, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "라해인", "G2", 0, {"CL": "G", "ML": "G", "AU": "Y"}], [851, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "황서준", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B", "DV": "G", "PE": "GC"}], [852, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "신봄", "G1", 0, {"CL": "Y"}], [853, "바이오소재사업본부", "채임원", "바이오소재 개발팀", "석미자", "G3", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [854, "환경안전센터", "채임원", "환경안전 혁신팀 1", "문지훈", "G1", 0, {"CL": "G", "DA": "Y"}], [855, "환경안전센터", "채임원", "환경안전 혁신팀 1", "이나은", "G2", 1, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G"}], [856, "환경안전센터", "채임원", "환경안전 혁신팀 1", "곽민서", "G2", 0, {"DS": "Y", "CL": "Y", "DA": "B", "PP": "SC", "ML": "GC", "DV": "G", "AU": "B", "PE": "B"}], [857, "환경안전센터", "채임원", "환경안전 혁신팀 1", "정미자", "G2", 0, {}], [858, "환경안전센터", "채임원", "환경안전 혁신팀 1", "민아인", "G3", 0, {}], [859, "환경안전센터", "채임원", "환경안전 혁신팀 1", "안건우", "G2", 1, {"CL": "G", "DA": "B", "PP": "SC", "ML": "G", "AU": "B"}], [860, "환경안전센터", "채임원", "환경안전 혁신팀 1", "염광남", "G3", 0, {"CL": "G", "PP": "B", "ML": "B", "AU": "G"}], [861, "환경안전센터", "채임원", "환경안전 혁신팀 1", "유단아", "G1", 0, {"DS": "Y", "CL": "G", "DA": "SC", "DV": "G", "PE": "G"}], [862, "환경안전센터", "채임원", "환경안전 혁신팀 1", "전수아", "G3", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "AU": "G"}], [863, "환경안전센터", "채임원", "환경안전 혁신팀 1", "진우진", "G3", 0, {"CL": "G", "DA": "GC", "ML": "G", "AU": "G"}], [864, "환경안전센터", "채임원", "환경안전 혁신팀 1", "문나은", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "GC", "AU": "Y"}], [865, "환경안전센터", "채임원", "환경안전 혁신팀 1", "채미자", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "G"}], [866, "환경안전센터", "채임원", "환경안전 혁신팀 1", "방소율", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "Y"}], [867, "환경안전센터", "채임원", "환경안전 혁신팀 1", "유은우", "G2", 0, {"DA": "Y", "ML": "G", "AU": "SC"}], [868, "환경안전센터", "채임원", "환경안전 혁신팀 1", "임봄", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G"}], [869, "환경안전센터", "채임원", "환경안전 혁신팀 1", "우준서", "G1", 0, {"ML": "G", "DV": "B"}], [870, "환경안전센터", "채임원", "환경안전 혁신팀 1", "서주희", "G2", 1, {"CL": "B", "DA": "B", "PP": "GC", "ML": "B", "DV": "G", "AU": "G"}], [871, "환경안전센터", "채임원", "환경안전 혁신팀 1", "홍윤서", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B", "AU": "GC"}], [872, "환경안전센터", "채임원", "환경안전 혁신팀 1", "백서현", "G1", 0, {"CL": "SC", "DA": "GC"}], [873, "환경안전센터", "채임원", "환경안전 혁신팀 1", "오하은", "G2", 0, {"DA": "Y", "PP": "B", "ML": "SC"}], [874, "환경안전센터", "채임원", "환경안전 혁신팀 1", "류우진", "G2", 0, {"DA": "Y", "ML": "B", "AU": "Y"}], [875, "환경안전센터", "채임원", "환경안전 혁신팀 1", "여광남", "G1", 0, {"CL": "Y"}], [876, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "신민준", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "G"}], [877, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "권선우", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "GC", "DV": "GC", "AU": "G"}], [878, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "천하은", "G3", 0, {"CL": "B", "PP": "B", "ML": "G", "AU": "GC"}], [879, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "문서윤", "G3", 0, {"CL": "B", "ML": "G", "AU": "G"}], [880, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "박하윤", "G1", 0, {"CL": "G", "DA": "G", "DV": "B", "PE": "SC"}], [881, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "주유찬", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "G", "AU": "SC"}], [882, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "유주원", "G3", 0, {"CL": "Y", "PP": "B", "ML": "G"}], [883, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "황준우", "G1", 0, {"CL": "Y", "DA": "G", "DV": "B", "PE": "Y"}], [884, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "전서현", "G2", 0, {"DA": "G", "ML": "G"}], [885, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "채지민", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [886, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "정지유", "G1", 1, {"CL": "Y", "DA": "B", "ML": "G", "DV": "B", "PE": "B"}], [887, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "가주희", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "SC"}], [888, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "기주원", "G2", 0, {"CL": "Y", "DA": "G", "PP": "GC", "ML": "B", "AU": "G"}], [889, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "엄주아", "G2", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "B", "AU": "G"}], [890, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "조민서", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "SC", "DV": "B", "AU": "SC", "PE": "G"}], [891, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "육연우", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "B", "DV": "G", "PE": "G"}], [892, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "옥서연", "G3", 0, {"CL": "Y", "PP": "G", "ML": "B", "DV": "B", "AU": "Y"}], [893, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "조건우", "G2", 0, {"CL": "Y", "DA": "B", "ML": "B", "AU": "G"}], [894, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "진서연", "G2", 0, {"CL": "G", "PP": "B", "ML": "G"}], [895, "신사업기획센터", "채임원", "신사업기획 개발팀 2", "송서윤", "G2", 0, {"CL": "B", "DA": "G", "ML": "G", "AU": "B"}], [896, "생산기술센터", "채임원", "생산기술 혁신팀 3", "장하은", "G1", 0, {"CL": "Y", "DV": "G", "PE": "G"}], [897, "생산기술센터", "채임원", "생산기술 혁신팀 3", "조서연", "G2", 0, {"CL": "B", "DA": "G", "PP": "SC", "ML": "Y"}], [898, "생산기술센터", "채임원", "생산기술 혁신팀 3", "박소율", "G2", 1, {"DA": "B", "ML": "GC", "AU": "G"}], [899, "생산기술센터", "채임원", "생산기술 혁신팀 3", "원도윤", "G1", 0, {"DS": "G", "CL": "B", "DA": "B", "DV": "G", "PE": "B"}], [900, "생산기술센터", "채임원", "생산기술 혁신팀 3", "전지호", "G2", 0, {"DA": "B", "ML": "SC"}], [901, "생산기술센터", "채임원", "생산기술 혁신팀 3", "함우진", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "B"}], [902, "생산기술센터", "채임원", "생산기술 혁신팀 3", "심도윤", "G1", 0, {"CL": "Y", "DA": "G", "DV": "G"}], [903, "생산기술센터", "채임원", "생산기술 혁신팀 3", "주영태", "G2", 0, {"DA": "G", "ML": "G"}], [904, "생산기술센터", "채임원", "생산기술 혁신팀 3", "장시우", "G2", 0, {"CL": "Y", "DA": "B", "PP": "SC", "ML": "SC", "AU": "B"}], [905, "생산기술센터", "채임원", "생산기술 혁신팀 3", "길윤서", "G1", 0, {"CL": "G", "DA": "G", "ML": "B", "DV": "B"}], [906, "생산기술센터", "채임원", "생산기술 혁신팀 3", "공서연", "G2", 0, {"DA": "Y", "ML": "G"}], [907, "생산기술센터", "채임원", "생산기술 혁신팀 3", "연유찬", "G3", 0, {"ML": "B"}], [908, "생산기술센터", "채임원", "생산기술 혁신팀 3", "전유찬", "G1", 0, {"CL": "Y", "DA": "G", "ML": "SC", "DV": "SC"}], [909, "생산기술센터", "채임원", "생산기술 혁신팀 3", "구서준", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "SC", "DV": "G", "PE": "G"}], [910, "생산기술센터", "채임원", "생산기술 혁신팀 3", "신광남", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "DV": "B", "AU": "G", "PE": "B"}], [911, "생산기술센터", "채임원", "생산기술 혁신팀 3", "정정현", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "DV": "B", "AU": "B"}], [912, "R&D센터", "서임원", "R&D 관리팀 2", "문다은", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G", "PE": "B"}], [913, "R&D센터", "서임원", "R&D 관리팀 2", "서서준", "G1", 0, {"CL": "G", "DA": "Y", "ML": "SC", "DV": "G", "PE": "SC"}], [914, "R&D센터", "서임원", "R&D 관리팀 2", "송지호", "G3", 0, {"ML": "Y", "AU": "Y"}], [915, "R&D센터", "서임원", "R&D 관리팀 2", "윤봄", "G3", 0, {"CL": "Y", "ML": "G", "AU": "B"}], [916, "R&D센터", "서임원", "R&D 관리팀 2", "소영태", "G3", 0, {"CL": "B", "DA": "Y", "PP": "B", "ML": "G", "DV": "B", "AU": "B"}], [917, "R&D센터", "서임원", "R&D 관리팀 2", "채서윤", "G3", 0, {"CL": "G", "PP": "B", "ML": "B", "AU": "B"}], [918, "R&D센터", "서임원", "R&D 관리팀 2", "조건우", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "AU": "B"}], [919, "R&D센터", "서임원", "R&D 관리팀 2", "지해인", "G3", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "B", "AU": "B"}], [920, "R&D센터", "서임원", "R&D 관리팀 2", "조다은", "G3", 0, {"CL": "Y", "ML": "B"}], [921, "R&D센터", "서임원", "R&D 관리팀 2", "배채원", "G3", 0, {"CL": "G", "ML": "G"}], [922, "R&D센터", "서임원", "R&D 관리팀 2", "민해인", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "SC", "DV": "G", "AU": "G"}], [923, "R&D센터", "서임원", "R&D 관리팀 2", "주서현", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G"}], [924, "R&D센터", "서임원", "R&D 관리팀 2", "주지아", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "SC", "AU": "B"}], [925, "R&D센터", "서임원", "R&D 관리팀 2", "배나은", "G2", 0, {"DA": "G", "PP": "G", "ML": "B", "AU": "B"}], [926, "R&D센터", "서임원", "R&D 관리팀 2", "채하준", "G2", 0, {"CL": "Y", "DA": "B", "ML": "Y"}], [927, "R&D센터", "서임원", "R&D 관리팀 2", "신수아", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "GC", "DV": "B", "AU": "SC", "PE": "B"}], [928, "R&D센터", "서임원", "R&D 관리팀 2", "이채원", "G1", 0, {"CL": "B", "DA": "Y", "ML": "SC", "DV": "SC"}], [929, "R&D센터", "서임원", "R&D 관리팀 2", "서주희", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "GC", "DV": "B", "PE": "Y"}], [930, "R&D센터", "서임원", "R&D 관리팀 2", "조소율", "G3", 0, {"PP": "B", "ML": "G", "AU": "G"}], [931, "R&D센터", "서임원", "R&D 관리팀 2", "하단아", "G2", 0, {"CL": "G", "DA": "GC", "PP": "G", "ML": "G", "DV": "B", "AU": "Y"}], [932, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "정서현", "G2", 0, {"CL": "B", "DA": "B", "PP": "Y", "ML": "B"}], [933, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "민우진", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "SC", "PE": "B"}], [934, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "라정우", "G3", 0, {"PP": "Y", "ML": "B", "AU": "G"}], [935, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "안유찬", "G3", 0, {"CL": "G", "PP": "G", "ML": "G", "AU": "GC"}], [936, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "가채원", "G3", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "G", "AU": "G"}], [937, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "오시아", "G3", 0, {"CL": "G", "DA": "SC", "PP": "B", "ML": "G", "AU": "B"}], [938, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "신서윤", "G2", 0, {"CL": "B", "DA": "G", "ML": "G", "AU": "SC"}], [939, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "방영태", "G2", 1, {"DA": "B", "ML": "G", "AU": "G"}], [940, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "반도윤", "G2", 0, {"CL": "G", "DA": "G", "ML": "B"}], [941, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "강다은", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "SC", "DV": "B", "AU": "Y"}], [942, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "윤다은", "G1", 1, {"CL": "B", "DA": "B", "ML": "G", "DV": "B", "PE": "B"}], [943, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "석준서", "G2", 0, {"CL": "B", "DA": "B", "ML": "G", "AU": "G"}], [944, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "선민준", "G1", 0, {"DS": "G", "CL": "Y", "DA": "B", "ML": "G", "DV": "G", "PE": "G"}], [945, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "현준우", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [946, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "채정우", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "GC", "AU": "Y"}], [947, "글로벌사업센터", "서임원", "글로벌사업 전략팀 3", "홍지우", "G1", 0, {"CL": "Y", "ML": "G", "DV": "B"}], [948, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "이지우", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "G", "AU": "B"}], [949, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "원영태", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [950, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "유영태", "G2", 0, {"CL": "SC", "DA": "B", "ML": "G", "AU": "GC"}], [951, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "유서현", "G2", 0, {"CL": "Y", "DA": "SC", "PP": "G", "ML": "G", "AU": "B"}], [952, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "기지훈", "G2", 0, {"CL": "Y", "DA": "GC", "PP": "B", "ML": "B"}], [953, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "신주아", "G2", 1, {"CL": "B", "DA": "G", "PP": "SC", "ML": "SC"}], [954, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "도주원", "G3", 0, {"PP": "G", "ML": "Y", "AU": "G"}], [955, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "조준우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "B", "PE": "SC"}], [956, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "류주아", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G", "AU": "G"}], [957, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "인광남", "G2", 0, {"CL": "Y", "DA": "G", "ML": "SC", "DV": "G", "AU": "B"}], [958, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "추미자", "G2", 0, {"DA": "Y", "PP": "B", "ML": "B", "AU": "G"}], [959, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "라소율", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "DV": "G", "AU": "SC"}], [960, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "반지아", "G3", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "G", "DV": "B", "AU": "Y"}], [961, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "마우진", "G2", 0, {"CL": "G", "DA": "B", "ML": "B", "AU": "Y"}], [962, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "조준서", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "SC"}], [963, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "공건우", "G1", 0, {"CL": "G", "DA": "G", "ML": "Y"}], [964, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "길서연", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "G"}], [965, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "석서진", "G2", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "G", "DV": "SC", "AU": "G"}], [966, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "소예준", "G1", 0, {"CL": "Y", "ML": "G", "DV": "G", "PE": "B"}], [967, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "석아인", "G3", 0, {"CL": "G", "ML": "SC", "AU": "SC"}], [968, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "함지민", "G3", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G", "DV": "GC", "AU": "B"}], [969, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "함준우", "G2", 0, {"DA": "Y", "PP": "SC", "ML": "G"}], [970, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "설지훈", "G2", 0, {"CL": "B", "DA": "Y", "PP": "B", "ML": "B", "AU": "G"}], [971, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "신서준", "G3", 0, {"CL": "G", "PP": "G", "ML": "SC", "AU": "Y"}], [972, "기초소재사업본부", "서임원", "기초소재 AX팀 1", "마선우", "G3", 0, {"CL": "B", "ML": "SC", "AU": "G"}], [973, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "추나은", "G2", 0, {"DA": "Y", "ML": "Y", "AU": "G"}], [974, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "진지유", "G3", 0, {"CL": "B", "ML": "G"}], [975, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "유하은", "G3", 0, {"DA": "G", "ML": "G", "AU": "G"}], [976, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "정하윤", "G1", 0, {"CL": "G", "DA": "G", "ML": "G"}], [977, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "라시아", "G3", 0, {"CL": "Y", "ML": "Y", "AU": "Y"}], [978, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "반건우", "G3", 0, {"PP": "Y", "ML": "B", "AU": "G"}], [979, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "하우진", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [980, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "지민준", "G1", 0, {"DS": "G", "CL": "G", "DA": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "Y"}], [981, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "지지훈", "G1", 0, {"DS": "B", "CL": "B", "DA": "B", "ML": "B", "DV": "B", "PE": "B"}], [982, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "임수아", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B", "AU": "G"}], [983, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "강지호", "G1", 0, {"CL": "Y", "DA": "SC", "ML": "B"}], [984, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "추건우", "G1", 0, {"DS": "B", "CL": "B", "DA": "Y", "ML": "G", "DV": "B", "AU": "B", "PE": "G"}], [985, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "박소율", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "GC"}], [986, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "길지우", "G2", 0, {"DA": "B", "PP": "G", "ML": "G", "AU": "B"}], [987, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "임지훈", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "DV": "G", "AU": "GC", "PE": "G"}], [988, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "허영태", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "AU": "B"}], [989, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "손영태", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "B"}], [990, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "옥서윤", "G2", 0, {"CL": "SC", "DA": "B", "ML": "B"}], [991, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "염주원", "G3", 0, {"CL": "Y", "ML": "B", "AU": "B"}], [992, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "강정현", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G"}], [993, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "진정현", "G1", 0, {"CL": "B", "DA": "G"}], [994, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "표주아", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "Y"}], [995, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "명광남", "G2", 0, {"CL": "Y", "DA": "G", "ML": "GC"}], [996, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "황서윤", "G3", 0, {"CL": "B", "ML": "SC", "AU": "B"}], [997, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "조시아", "G2", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "B", "AU": "B"}], [998, "글로벌사업센터", "서임원", "글로벌사업 혁신팀 1", "양서준", "G2", 0, {"CL": "G", "DA": "G", "ML": "G"}], [999, "DX센터", "서임원", "DX 기획팀 3", "반서진", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "B", "AU": "G"}], [1000, "DX센터", "서임원", "DX 기획팀 3", "기미자", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "B"}], [1001, "DX센터", "서임원", "DX 기획팀 3", "심하준", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "Y"}], [1002, "DX센터", "서임원", "DX 기획팀 3", "오주희", "G1", 0, {"CL": "B", "DA": "G", "ML": "GC", "DV": "B"}], [1003, "DX센터", "서임원", "DX 기획팀 3", "윤나은", "G1", 0, {"DS": "Y", "CL": "B", "DA": "Y", "PP": "G", "ML": "GC", "DV": "G", "PE": "B"}], [1004, "DX센터", "서임원", "DX 기획팀 3", "선하은", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "GC", "AU": "G"}], [1005, "DX센터", "서임원", "DX 기획팀 3", "안시우", "G2", 0, {"CL": "G", "ML": "SC"}], [1006, "DX센터", "서임원", "DX 기획팀 3", "공주아", "G1", 0, {"CL": "G", "DA": "GC", "ML": "B", "DV": "G"}], [1007, "DX센터", "서임원", "DX 기획팀 3", "황미자", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "B"}], [1008, "DX센터", "서임원", "DX 기획팀 3", "추정현", "G2", 0, {"CL": "G", "DA": "G", "ML": "GC"}], [1009, "DX센터", "서임원", "DX 기획팀 3", "도지호", "G2", 1, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "SC", "DV": "B", "AU": "B", "PE": "G"}], [1010, "DX센터", "서임원", "DX 기획팀 3", "남지훈", "G1", 0, {"CL": "B", "DA": "G"}], [1011, "DX센터", "서임원", "DX 기획팀 3", "노나은", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "GC", "AU": "B"}], [1012, "DX센터", "서임원", "DX 기획팀 3", "위봄", "G2", 1, {"CL": "B", "DA": "G", "PP": "SC", "ML": "GC", "AU": "Y"}], [1013, "DX센터", "서임원", "DX 기획팀 3", "곽선우", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "B", "PE": "G"}], [1014, "DX센터", "서임원", "DX 기획팀 3", "안건우", "G3", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "B", "AU": "G"}], [1015, "DX센터", "서임원", "DX 기획팀 3", "함채원", "G2", 1, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "DV": "B", "AU": "GC", "PE": "B"}], [1016, "DX센터", "서임원", "DX 기획팀 3", "함하준", "G1", 0, {"DS": "B", "CL": "SC", "DA": "B", "ML": "B", "DV": "G", "PE": "G"}], [1017, "DX센터", "서임원", "DX 기획팀 3", "현소율", "G3", 0, {"CL": "G", "ML": "G", "AU": "B"}], [1018, "경영지원센터", "송임원", "경영지원 안전팀 3", "박서현", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "B", "AU": "SC"}], [1019, "경영지원센터", "송임원", "경영지원 안전팀 3", "남지훈", "G1", 0, {"CL": "SC", "DA": "SC", "ML": "G", "DV": "G", "PE": "B"}], [1020, "경영지원센터", "송임원", "경영지원 안전팀 3", "황시우", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "SC", "AU": "G"}], [1021, "경영지원센터", "송임원", "경영지원 안전팀 3", "원주원", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "B", "AU": "B"}], [1022, "경영지원센터", "송임원", "경영지원 안전팀 3", "홍우진", "G2", 1, {"DA": "Y", "PP": "G", "ML": "B", "AU": "B"}], [1023, "경영지원센터", "송임원", "경영지원 안전팀 3", "석아인", "G2", 0, {"CL": "B", "DA": "Y", "ML": "G", "AU": "G"}], [1024, "경영지원센터", "송임원", "경영지원 안전팀 3", "서민서", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "G"}], [1025, "경영지원센터", "송임원", "경영지원 안전팀 3", "조지민", "G1", 0, {"DS": "G", "CL": "G", "DA": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "B"}], [1026, "경영지원센터", "송임원", "경영지원 안전팀 3", "채서진", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "AU": "G"}], [1027, "경영지원센터", "송임원", "경영지원 안전팀 3", "한준서", "G2", 0, {"CL": "B", "DA": "Y", "PP": "B", "ML": "G", "DV": "SC", "AU": "B"}], [1028, "경영지원센터", "송임원", "경영지원 안전팀 3", "소영태", "G2", 0, {"DA": "B", "PP": "SC", "ML": "G", "AU": "Y"}], [1029, "경영지원센터", "송임원", "경영지원 안전팀 3", "류주원", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "Y"}], [1030, "경영지원센터", "송임원", "경영지원 안전팀 3", "심지유", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "DV": "SC", "AU": "B", "PE": "G"}], [1031, "경영지원센터", "송임원", "경영지원 안전팀 3", "옥하윤", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "SC"}], [1032, "경영지원센터", "송임원", "경영지원 안전팀 3", "하서연", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "G", "AU": "G"}], [1033, "경영지원센터", "송임원", "경영지원 안전팀 3", "진수아", "G3", 0, {"CL": "G", "ML": "B", "AU": "G"}], [1034, "경영지원센터", "송임원", "경영지원 안전팀 3", "함주희", "G2", 0, {"ML": "G"}], [1035, "경영지원센터", "송임원", "경영지원 안전팀 3", "반정현", "G2", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "B", "DV": "B", "AU": "B", "PE": "Y"}], [1036, "경영지원센터", "송임원", "경영지원 안전팀 3", "유서연", "G2", 0, {"ML": "Y"}], [1037, "경영지원센터", "송임원", "경영지원 안전팀 3", "엄은우", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G"}], [1038, "경영지원센터", "송임원", "경영지원 안전팀 3", "금우진", "G1", 0, {"CL": "B", "DA": "B", "ML": "Y", "DV": "G"}], [1039, "경영지원센터", "송임원", "경영지원 안전팀 3", "배도윤", "G1", 0, {"CL": "SC", "DA": "B", "ML": "G", "DV": "GC"}], [1040, "경영지원센터", "송임원", "경영지원 안전팀 3", "기지아", "G3", 0, {"CL": "Y", "PP": "B", "ML": "G", "AU": "G"}], [1041, "생산기술센터", "송임원", "생산기술 AX팀 3", "명도윤", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "B", "DV": "SC", "PE": "B"}], [1042, "생산기술센터", "송임원", "생산기술 AX팀 3", "정유찬", "G1", 1, {"CL": "B", "DA": "B"}], [1043, "생산기술센터", "송임원", "생산기술 AX팀 3", "유채원", "G2", 0, {"CL": "Y", "DA": "Y", "ML": "G", "AU": "B"}], [1044, "생산기술센터", "송임원", "생산기술 AX팀 3", "심다은", "G1", 0, {"DS": "B", "CL": "B", "DA": "Y", "ML": "B", "DV": "G", "PE": "SC"}], [1045, "생산기술센터", "송임원", "생산기술 AX팀 3", "양예준", "G3", 0, {"CL": "B", "PP": "B", "ML": "G", "AU": "G"}], [1046, "생산기술센터", "송임원", "생산기술 AX팀 3", "문주아", "G2", 0, {"DS": "G", "CL": "G", "DA": "SC", "PP": "B", "ML": "B", "DV": "G", "AU": "B", "PE": "Y"}], [1047, "생산기술센터", "송임원", "생산기술 AX팀 3", "방준서", "G1", 0, {"DS": "G", "CL": "Y", "DA": "B", "PP": "SC", "ML": "B", "DV": "G", "AU": "SC", "PE": "G"}], [1048, "생산기술센터", "송임원", "생산기술 AX팀 3", "배지유", "G1", 0, {"DS": "G", "CL": "G", "DA": "Y", "ML": "B", "DV": "G", "PE": "G"}], [1049, "생산기술센터", "송임원", "생산기술 AX팀 3", "금지호", "G2", 0, {"DA": "G", "PP": "G", "ML": "SC"}], [1050, "생산기술센터", "송임원", "생산기술 AX팀 3", "전영태", "G2", 0, {"CL": "Y", "DA": "Y", "ML": "G", "AU": "G"}], [1051, "생산기술센터", "송임원", "생산기술 AX팀 3", "진지민", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "GC", "DV": "G", "AU": "G", "PE": "G"}], [1052, "생산기술센터", "송임원", "생산기술 AX팀 3", "육지아", "G1", 0, {"CL": "B", "ML": "G"}], [1053, "생산기술센터", "송임원", "생산기술 AX팀 3", "위준우", "G1", 0, {"CL": "G", "DA": "B", "DV": "G"}], [1054, "생산기술센터", "송임원", "생산기술 AX팀 3", "노다은", "G1", 1, {"CL": "B", "DA": "Y", "ML": "B", "DV": "B", "PE": "G"}], [1055, "생산기술센터", "송임원", "생산기술 AX팀 3", "정지아", "G1", 0, {"DS": "Y", "CL": "B", "DA": "SC", "ML": "G", "DV": "GC", "PE": "G"}], [1056, "생산기술센터", "송임원", "생산기술 AX팀 3", "차아인", "G2", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "B", "AU": "G"}], [1057, "생산기술센터", "송임원", "생산기술 AX팀 3", "정주원", "G1", 0, {"CL": "G", "DA": "G", "ML": "G"}], [1058, "생산기술센터", "송임원", "생산기술 AX팀 3", "석채원", "G3", 0, {"CL": "Y", "PP": "G", "ML": "SC", "AU": "G"}], [1059, "생산기술센터", "송임원", "생산기술 AX팀 3", "공준서", "G1", 0, {}], [1060, "생산기술센터", "송임원", "생산기술 AX팀 3", "구하준", "G2", 0, {"ML": "B"}], [1061, "생산기술센터", "송임원", "생산기술 사업팀", "류봄", "G1", 0, {"CL": "G", "DA": "Y", "ML": "SC"}], [1062, "생산기술센터", "송임원", "생산기술 사업팀", "유준서", "G1", 1, {"DS": "Y", "CL": "B", "DA": "Y", "PP": "G", "ML": "B", "DV": "G", "AU": "B", "PE": "B"}], [1063, "생산기술센터", "송임원", "생산기술 사업팀", "소다은", "G2", 0, {"CL": "Y", "DA": "G", "ML": "Y"}], [1064, "생산기술센터", "송임원", "생산기술 사업팀", "소서현", "G1", 0, {"CL": "Y", "DA": "B", "ML": "SC", "DV": "B"}], [1065, "생산기술센터", "송임원", "생산기술 사업팀", "유도윤", "G3", 0, {"CL": "B", "DA": "G", "PP": "SC", "ML": "B", "DV": "G", "AU": "B", "PE": "Y"}], [1066, "생산기술센터", "송임원", "생산기술 사업팀", "권은우", "G2", 0, {"CL": "G", "DA": "B", "ML": "SC", "AU": "SC"}], [1067, "생산기술센터", "송임원", "생산기술 사업팀", "마소율", "G2", 0, {"DA": "Y", "PP": "G", "ML": "B", "AU": "B"}], [1068, "생산기술센터", "송임원", "생산기술 사업팀", "왕시아", "G3", 0, {"CL": "B", "ML": "G", "AU": "G"}], [1069, "생산기술센터", "송임원", "생산기술 사업팀", "함민준", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "Y"}], [1070, "생산기술센터", "송임원", "생산기술 사업팀", "금준서", "G2", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "G", "DV": "SC", "AU": "G"}], [1071, "생산기술센터", "송임원", "생산기술 사업팀", "허하준", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "DV": "G", "AU": "G", "PE": "B"}], [1072, "생산기술센터", "송임원", "생산기술 사업팀", "채수아", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "B", "DV": "B", "PE": "G"}], [1073, "생산기술센터", "송임원", "생산기술 사업팀", "김주아", "G2", 0, {"CL": "G", "DA": "B", "PP": "SC", "ML": "B"}], [1074, "생산기술센터", "송임원", "생산기술 사업팀", "현우진", "G1", 0, {"CL": "B", "DA": "G"}], [1075, "생산기술센터", "송임원", "생산기술 사업팀", "조서윤", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "G"}], [1076, "경영지원센터", "차임원", "경영지원 안전팀 3", "표지아", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "SC"}], [1077, "경영지원센터", "차임원", "경영지원 안전팀 3", "진주아", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "B", "AU": "B"}], [1078, "경영지원센터", "차임원", "경영지원 안전팀 3", "강지훈", "G2", 0, {"CL": "B", "ML": "GC", "AU": "B"}], [1079, "경영지원센터", "차임원", "경영지원 안전팀 3", "정해인", "G3", 0, {"CL": "G", "ML": "B"}], [1080, "경영지원센터", "차임원", "경영지원 안전팀 3", "유해인", "G3", 0, {"PP": "Y", "ML": "GC"}], [1081, "경영지원센터", "차임원", "경영지원 안전팀 3", "인주희", "G2", 0, {"ML": "B"}], [1082, "경영지원센터", "차임원", "경영지원 안전팀 3", "전다은", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "AU": "GC"}], [1083, "경영지원센터", "차임원", "경영지원 안전팀 3", "고도윤", "G3", 0, {"CL": "Y", "ML": "G"}], [1084, "경영지원센터", "차임원", "경영지원 안전팀 3", "임서진", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "G", "PE": "Y"}], [1085, "경영지원센터", "차임원", "경영지원 안전팀 3", "위지호", "G3", 0, {"CL": "G", "DA": "G", "ML": "GC"}], [1086, "경영지원센터", "차임원", "경영지원 안전팀 3", "기선우", "G2", 0, {"DA": "G", "ML": "G"}], [1087, "경영지원센터", "차임원", "경영지원 안전팀 3", "강건우", "G3", 0, {"CL": "G", "PP": "G", "ML": "Y", "AU": "G"}], [1088, "경영지원센터", "차임원", "경영지원 안전팀 3", "유시아", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "B", "DV": "B", "PE": "Y"}], [1089, "경영지원센터", "차임원", "경영지원 안전팀 3", "명미자", "G2", 0, {"DA": "Y", "ML": "B"}], [1090, "경영지원센터", "차임원", "경영지원 안전팀 3", "선건우", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B", "AU": "B"}], [1091, "경영지원센터", "차임원", "경영지원 안전팀 3", "소은우", "G2", 1, {"CL": "Y", "DA": "G", "ML": "G"}], [1092, "경영지원센터", "차임원", "경영지원 안전팀 3", "류준우", "G1", 0, {"CL": "B", "DA": "G", "DV": "G"}], [1093, "경영지원센터", "차임원", "경영지원 안전팀 3", "손봄", "G3", 0, {"CL": "Y", "PP": "G", "ML": "G", "AU": "G"}], [1094, "경영지원센터", "차임원", "경영지원 안전팀 3", "노하준", "G1", 0, {"CL": "G", "DA": "G", "DV": "G"}], [1095, "생산기술센터", "차임원", "생산기술 물류팀", "우우진", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "AU": "G"}], [1096, "생산기술센터", "차임원", "생산기술 물류팀", "옥준서", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G", "DV": "B", "AU": "Y"}], [1097, "생산기술센터", "차임원", "생산기술 물류팀", "함연우", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "GC", "AU": "B"}], [1098, "생산기술센터", "차임원", "생산기술 물류팀", "인소율", "G3", 0, {"CL": "Y", "ML": "GC", "AU": "G"}], [1099, "생산기술센터", "차임원", "생산기술 물류팀", "허지호", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "DV": "B", "AU": "G", "PE": "Y"}], [1100, "생산기술센터", "차임원", "생산기술 물류팀", "지미자", "G2", 0, {"CL": "Y", "DA": "SC", "ML": "B", "AU": "G"}], [1101, "생산기술센터", "차임원", "생산기술 물류팀", "현해인", "G3", 0, {"CL": "SC", "PP": "G", "ML": "G", "DV": "GC", "AU": "G"}], [1102, "생산기술센터", "차임원", "생산기술 물류팀", "민준우", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "G"}], [1103, "생산기술센터", "차임원", "생산기술 물류팀", "연건우", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "SC"}], [1104, "생산기술센터", "차임원", "생산기술 물류팀", "진수아", "G3", 0, {"CL": "G", "DA": "G", "ML": "G", "AU": "B"}], [1105, "생산기술센터", "차임원", "생산기술 물류팀", "정서진", "G1", 0, {"DS": "G", "CL": "G", "DA": "G", "ML": "GC", "DV": "SC"}], [1106, "생산기술센터", "차임원", "생산기술 물류팀", "소지호", "G2", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "G"}], [1107, "생산기술센터", "차임원", "생산기술 물류팀", "안서진", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G"}], [1108, "생산기술센터", "차임원", "생산기술 물류팀", "반연우", "G1", 0, {"CL": "B", "DV": "Y"}], [1109, "생산기술센터", "차임원", "생산기술 물류팀", "황건우", "G1", 1, {"DS": "Y", "CL": "B", "DA": "G", "ML": "G", "DV": "G", "AU": "B", "PE": "Y"}], [1110, "생산기술센터", "차임원", "생산기술 물류팀", "왕지호", "G1", 0, {"DS": "B", "CL": "G", "DA": "GC", "ML": "B", "DV": "G", "AU": "SC", "PE": "Y"}], [1111, "생산기술센터", "차임원", "생산기술 물류팀", "천광남", "G3", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "GC", "DV": "B", "AU": "SC", "PE": "B"}], [1112, "생산기술센터", "차임원", "생산기술 물류팀", "성준서", "G2", 0, {"DS": "G", "CL": "G", "DA": "Y", "PP": "B", "ML": "B", "DV": "G", "AU": "B", "PE": "SC"}], [1113, "생산기술센터", "차임원", "생산기술 물류팀", "위서현", "G1", 0, {"CL": "Y", "DA": "G", "ML": "GC", "DV": "G"}], [1114, "생산기술센터", "차임원", "생산기술 물류팀", "백도윤", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "GC", "DV": "G", "AU": "SC", "PE": "G"}], [1115, "생산기술센터", "차임원", "생산기술 물류팀", "양건우", "G3", 0, {"CL": "B", "DA": "Y", "ML": "B", "AU": "G"}], [1116, "생산기술센터", "차임원", "생산기술 물류팀", "인시아", "G2", 0, {"DA": "G", "PP": "B", "ML": "B", "AU": "G"}], [1117, "생산기술센터", "차임원", "생산기술 물류팀", "유봄", "G3", 0, {"CL": "G", "ML": "G", "AU": "G"}], [1118, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "원소율", "G1", 0, {"CL": "B", "DA": "G", "DV": "GC"}], [1119, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "금하준", "G3", 0, {"CL": "B", "PP": "G", "ML": "GC", "AU": "B"}], [1120, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "공준서", "G3", 0, {"CL": "Y", "PP": "G", "ML": "B", "AU": "B"}], [1121, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "권정우", "G1", 0, {"CL": "Y", "DA": "B", "DV": "SC"}], [1122, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "길봄", "G2", 0, {"CL": "B", "DA": "B", "ML": "B"}], [1123, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "엄서윤", "G1", 0, {"CL": "G", "DA": "B", "ML": "G", "DV": "G"}], [1124, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "원민준", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "G", "DV": "Y"}], [1125, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "설시아", "G1", 0, {"DS": "Y", "CL": "B", "DA": "G", "ML": "B", "DV": "B", "PE": "G"}], [1126, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "공유찬", "G3", 0, {"CL": "G", "PP": "Y", "ML": "GC", "AU": "G"}], [1127, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "추다은", "G2", 0, {"DA": "B", "ML": "G", "AU": "G"}], [1128, "글로벌사업센터", "차임원", "글로벌사업 환경팀", "진광남", "G1", 0, {"CL": "G", "DA": "G", "ML": "SC"}], [1129, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "장서연", "G1", 0, {"CL": "SC", "DA": "B", "ML": "B", "DV": "G", "PE": "G"}], [1130, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "차지우", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B", "DV": "B", "PE": "G"}], [1131, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "노시아", "G2", 0, {"DA": "B", "PP": "B", "ML": "G"}], [1132, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "전아인", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G"}], [1133, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "송예준", "G2", 0, {"CL": "G", "DA": "Y", "ML": "G", "AU": "G"}], [1134, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "박정현", "G2", 0, {"DA": "G", "ML": "G"}], [1135, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "소봄", "G3", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "SC", "AU": "Y"}], [1136, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "석준서", "G2", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "G"}], [1137, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "설은우", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "G", "AU": "G"}], [1138, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "방유찬", "G2", 0, {"CL": "G", "DA": "Y", "ML": "SC", "AU": "SC"}], [1139, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "안지유", "G2", 0, {"ML": "G"}], [1140, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "원수아", "G3", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "SC", "AU": "SC"}], [1141, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "류선우", "G1", 0, {"CL": "Y", "ML": "G", "DV": "G", "PE": "SC"}], [1142, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "권아인", "G2", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "B"}], [1143, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "문민서", "G2", 0, {"CL": "G", "PP": "SC", "ML": "B", "AU": "B"}], [1144, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "전주희", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "AU": "G"}], [1145, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "권수아", "G1", 1, {"CL": "Y", "DA": "B", "DV": "G"}], [1146, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "위시우", "G1", 1, {"DS": "B", "CL": "G", "DA": "G", "ML": "B", "DV": "G", "PE": "G"}], [1147, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "라시우", "G2", 0, {"CL": "G", "DA": "Y"}], [1148, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "허지호", "G3", 0, {"ML": "Y"}], [1149, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "강영태", "G2", 1, {"DA": "Y", "ML": "B"}], [1150, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "도서윤", "G2", 0, {"CL": "Y", "DA": "B", "ML": "G", "AU": "B"}], [1151, "글로벌사업센터", "노임원", "글로벌사업 혁신팀 2", "황서현", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "AU": "G"}], [1152, "DX센터", "노임원", "DX 사업팀 1", "천준서", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "AU": "SC"}], [1153, "DX센터", "노임원", "DX 사업팀 1", "위채원", "G3", 0, {"CL": "B", "DA": "B", "PP": "B", "ML": "G", "AU": "G"}], [1154, "DX센터", "노임원", "DX 사업팀 1", "문연우", "G1", 0, {"CL": "Y", "ML": "G", "DV": "G", "PE": "B"}], [1155, "DX센터", "노임원", "DX 사업팀 1", "류아인", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "AU": "B"}], [1156, "DX센터", "노임원", "DX 사업팀 1", "원수아", "G2", 1, {"DA": "Y", "PP": "B", "ML": "SC", "AU": "G"}], [1157, "DX센터", "노임원", "DX 사업팀 1", "문예준", "G1", 0, {"DA": "Y"}], [1158, "DX센터", "노임원", "DX 사업팀 1", "최나은", "G3", 0, {"CL": "B", "DA": "Y", "ML": "G", "AU": "GC"}], [1159, "DX센터", "노임원", "DX 사업팀 1", "고소율", "G1", 0, {"CL": "G"}], [1160, "DX센터", "노임원", "DX 사업팀 1", "공연우", "G1", 0, {"CL": "G", "DA": "SC", "ML": "B"}], [1161, "DX센터", "노임원", "DX 사업팀 1", "길지민", "G2", 1, {"DA": "Y", "ML": "G"}], [1162, "DX센터", "노임원", "DX 사업팀 1", "손하준", "G3", 0, {"CL": "G", "PP": "G", "ML": "SC", "AU": "B"}], [1163, "DX센터", "노임원", "DX 사업팀 1", "여서준", "G3", 0, {"CL": "Y", "DA": "B", "ML": "G", "AU": "Y"}], [1164, "DX센터", "노임원", "DX 사업팀 1", "노아인", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "AU": "G"}], [1165, "DX센터", "노임원", "DX 사업팀 1", "권서진", "G2", 0, {"CL": "B", "DA": "B", "ML": "G"}], [1166, "DX센터", "노임원", "DX 사업팀 1", "염유찬", "G1", 0, {"CL": "Y", "DA": "G", "ML": "SC", "DV": "B", "PE": "G"}], [1167, "DX센터", "노임원", "DX 사업팀 1", "지우진", "G3", 0, {"CL": "Y", "PP": "B", "ML": "G", "AU": "B"}], [1168, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "표나은", "G3", 0, {"CL": "B", "PP": "Y", "ML": "B", "AU": "B"}], [1169, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "인미자", "G1", 0, {"DS": "B", "CL": "G", "DA": "G", "ML": "SC", "DV": "GC", "PE": "GC"}], [1170, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "표지호", "G2", 0, {"CL": "G", "DA": "B", "PP": "B", "ML": "G", "DV": "B", "AU": "G"}], [1171, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "추하준", "G1", 0, {"CL": "GC", "DA": "B"}], [1172, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "노하준", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "G", "AU": "B"}], [1173, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "조도윤", "G3", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "G", "DV": "G", "AU": "B", "PE": "Y"}], [1174, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "설채원", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "B"}], [1175, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "고봄", "G3", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "G"}], [1176, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "방민준", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "DV": "SC", "AU": "GC", "PE": "Y"}], [1177, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "임하윤", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "DV": "G", "AU": "B", "PE": "G"}], [1178, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "정준서", "G3", 0, {"CL": "G", "PP": "Y", "ML": "G", "DV": "G", "AU": "G"}], [1179, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "배다은", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "DV": "B", "AU": "G", "PE": "B"}], [1180, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "임미자", "G1", 0, {"CL": "Y", "ML": "Y", "DV": "B"}], [1181, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "유지민", "G3", 0, {"CL": "Y", "ML": "B"}], [1182, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "연나은", "G2", 0, {"CL": "B", "DA": "G", "ML": "B", "AU": "G"}], [1183, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "노은우", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "GC", "ML": "B"}], [1184, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "원도윤", "G3", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "DV": "SC", "AU": "Y"}], [1185, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "길아인", "G2", 0, {"CL": "G", "DA": "G", "ML": "Y", "AU": "B"}], [1186, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "황수아", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "DV": "SC", "AU": "SC", "PE": "G"}], [1187, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "유예준", "G1", 0, {"CL": "G", "DA": "Y", "ML": "Y", "DV": "G", "PE": "B"}], [1188, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "진하윤", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "DV": "G", "PE": "B"}], [1189, "친환경소재사업본부", "노임원", "친환경소재 지원팀 3", "왕준우", "G1", 0, {"CL": "G", "DA": "Y", "ML": "B", "DV": "SC", "PE": "B"}], [1190, "구매물류센터", "노임원", "구매물류 전략팀 2", "유지호", "G1", 0, {}], [1191, "구매물류센터", "노임원", "구매물류 전략팀 2", "채유찬", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B"}], [1192, "구매물류센터", "노임원", "구매물류 전략팀 2", "금지훈", "G1", 0, {"CL": "G"}], [1193, "구매물류센터", "노임원", "구매물류 전략팀 2", "오수아", "G3", 0, {"PP": "SC", "ML": "G"}], [1194, "구매물류센터", "노임원", "구매물류 전략팀 2", "곽민서", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "AU": "G"}], [1195, "구매물류센터", "노임원", "구매물류 전략팀 2", "황시우", "G1", 0, {"CL": "G", "DA": "B", "DV": "G"}], [1196, "구매물류센터", "노임원", "구매물류 전략팀 2", "고서준", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "AU": "Y"}], [1197, "구매물류센터", "노임원", "구매물류 전략팀 2", "인소율", "G2", 0, {"CL": "G", "DA": "Y", "ML": "SC", "AU": "Y"}], [1198, "구매물류센터", "노임원", "구매물류 전략팀 2", "도서현", "G3", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "SC", "AU": "SC"}], [1199, "구매물류센터", "노임원", "구매물류 전략팀 2", "오건우", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "SC", "DV": "G", "AU": "SC", "PE": "SC"}], [1200, "품질경영센터", "노임원", "품질경영 기획팀 2", "강수아", "G2", 0, {"CL": "G", "DA": "Y", "ML": "G", "AU": "G"}], [1201, "품질경영센터", "노임원", "품질경영 기획팀 2", "가지민", "G2", 0, {"ML": "G"}], [1202, "품질경영센터", "노임원", "품질경영 기획팀 2", "여정우", "G3", 0, {"CL": "G", "PP": "G", "ML": "B", "AU": "B"}], [1203, "품질경영센터", "노임원", "품질경영 기획팀 2", "표서연", "G2", 1, {"CL": "G", "DA": "G", "PP": "G", "ML": "GC"}], [1204, "품질경영센터", "노임원", "품질경영 기획팀 2", "정나은", "G3", 0, {"ML": "G", "AU": "G"}], [1205, "품질경영센터", "노임원", "품질경영 기획팀 2", "유서진", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G"}], [1206, "품질경영센터", "노임원", "품질경영 기획팀 2", "안하준", "G1", 0, {"CL": "G", "ML": "G", "DV": "SC"}], [1207, "품질경영센터", "노임원", "품질경영 기획팀 2", "엄예준", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "G", "DV": "G", "AU": "SC"}], [1208, "품질경영센터", "노임원", "품질경영 기획팀 2", "정하윤", "G1", 0, {"DS": "G", "CL": "G", "DA": "B", "ML": "SC", "DV": "G", "AU": "G", "PE": "B"}], [1209, "품질경영센터", "노임원", "품질경영 기획팀 2", "인다은", "G2", 0, {"DA": "Y", "ML": "Y", "AU": "G"}], [1210, "품질경영센터", "노임원", "품질경영 기획팀 2", "송영태", "G3", 0, {"CL": "G", "PP": "G", "ML": "GC", "AU": "B"}], [1211, "품질경영센터", "노임원", "품질경영 기획팀 2", "가윤서", "G3", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "DV": "B", "AU": "G", "PE": "B"}], [1212, "품질경영센터", "노임원", "품질경영 기획팀 2", "남연우", "G3", 0, {"ML": "G", "AU": "G"}], [1213, "품질경영센터", "노임원", "품질경영 기획팀 2", "오유찬", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "Y", "ML": "G", "DV": "G", "AU": "G"}], [1214, "품질경영센터", "노임원", "품질경영 기획팀 2", "원지훈", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "B", "AU": "Y"}], [1215, "품질경영센터", "노임원", "품질경영 기획팀 2", "공연우", "G2", 0, {"DA": "SC", "ML": "B"}], [1216, "품질경영센터", "노임원", "품질경영 기획팀 2", "유준우", "G2", 0, {"CL": "B", "DA": "B", "ML": "G"}], [1217, "품질경영센터", "노임원", "품질경영 기획팀 2", "노도윤", "G2", 0, {"DA": "Y", "PP": "Y", "ML": "B", "AU": "B"}], [1218, "경영지원센터", "추임원", "경영지원 영업팀", "심연우", "G2", 1, {"CL": "Y", "DA": "G", "ML": "G", "AU": "G"}], [1219, "경영지원센터", "추임원", "경영지원 영업팀", "함수아", "G1", 0, {"CL": "B", "DA": "B", "ML": "G", "DV": "G"}], [1220, "경영지원센터", "추임원", "경영지원 영업팀", "전지아", "G3", 0, {"CL": "B", "ML": "B", "AU": "G"}], [1221, "경영지원센터", "추임원", "경영지원 영업팀", "연주원", "G2", 0, {"DA": "Y", "ML": "Y", "AU": "B"}], [1222, "경영지원센터", "추임원", "경영지원 영업팀", "금미자", "G3", 0, {"CL": "G", "PP": "B", "ML": "SC", "AU": "B"}], [1223, "경영지원센터", "추임원", "경영지원 영업팀", "고도윤", "G1", 0, {"DS": "B", "CL": "B", "DA": "B", "ML": "SC", "DV": "G", "PE": "SC"}], [1224, "경영지원센터", "추임원", "경영지원 영업팀", "민건우", "G3", 0, {"CL": "B", "ML": "G", "AU": "B"}], [1225, "경영지원센터", "추임원", "경영지원 영업팀", "구나은", "G1", 0, {"CL": "G", "DV": "G"}], [1226, "경영지원센터", "추임원", "경영지원 영업팀", "강하준", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [1227, "경영지원센터", "추임원", "경영지원 영업팀", "가소율", "G3", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "G", "AU": "Y"}], [1228, "경영지원센터", "추임원", "경영지원 영업팀", "황유찬", "G3", 0, {"CL": "G", "PP": "B", "ML": "G", "DV": "B", "AU": "G"}], [1229, "경영지원센터", "추임원", "경영지원 영업팀", "반광남", "G3", 0, {"CL": "G", "DA": "B", "PP": "SC", "ML": "G", "DV": "B", "AU": "G"}], [1230, "경영지원센터", "추임원", "경영지원 영업팀", "성민서", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "G"}], [1231, "경영지원센터", "추임원", "경영지원 영업팀", "육수아", "G2", 0, {"CL": "GC", "DA": "SC", "ML": "G"}], [1232, "경영지원센터", "추임원", "경영지원 영업팀", "민민서", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "Y", "ML": "B", "AU": "G"}], [1233, "경영지원센터", "추임원", "경영지원 영업팀", "성준서", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [1234, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "마윤서", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "B", "ML": "SC", "DV": "G"}], [1235, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "육서현", "G2", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "G", "PE": "B"}], [1236, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "조윤서", "G2", 0, {"DA": "B", "ML": "G", "AU": "B"}], [1237, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "진정현", "G1", 0, {"DS": "Y", "CL": "G", "DA": "B", "ML": "B", "DV": "G"}], [1238, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "노윤서", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "AU": "B"}], [1239, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "이미자", "G2", 0, {"DA": "G", "ML": "B"}], [1240, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "황정우", "G3", 0, {"CL": "G", "DA": "SC", "PP": "B", "ML": "B", "AU": "G"}], [1241, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "구하은", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "SC", "AU": "G"}], [1242, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "하나은", "G1", 0, {"CL": "G", "DA": "B", "ML": "B", "DV": "B"}], [1243, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "김윤서", "G1", 0, {"CL": "Y", "DA": "GC", "ML": "B", "DV": "SC", "PE": "B"}], [1244, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "한시우", "G1", 0, {"CL": "G", "ML": "B", "DV": "B"}], [1245, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "허소율", "G3", 0, {"CL": "G", "ML": "G", "AU": "B"}], [1246, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "마서연", "G1", 0, {"CL": "G", "DA": "B", "ML": "G", "DV": "B"}], [1247, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "윤서현", "G2", 0, {"CL": "Y", "DA": "Y", "ML": "B"}], [1248, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "엄해인", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "G"}], [1249, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "명민서", "G3", 0, {"CL": "G", "PP": "B", "ML": "G", "AU": "SC"}], [1250, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "전서연", "G2", 1, {"CL": "Y", "DA": "G", "ML": "G", "AU": "B"}], [1251, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "옥서진", "G1", 0, {"DS": "B", "CL": "Y", "DA": "G", "ML": "G", "DV": "GC", "PE": "Y"}], [1252, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "최하윤", "G1", 0, {"DS": "Y", "CL": "B", "DA": "G", "PP": "B", "ML": "G", "DV": "SC", "PE": "B"}], [1253, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "최준서", "G2", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "B"}], [1254, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "서광남", "G3", 0, {"CL": "G", "DA": "B", "PP": "B", "ML": "B", "DV": "B", "AU": "Y"}], [1255, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "기주아", "G1", 0, {"CL": "Y", "DA": "G"}], [1256, "친환경소재사업본부", "추임원", "친환경소재 생산팀 3", "임서현", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "Y", "ML": "SC", "AU": "B"}], [1257, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "지예준", "G3", 0, {"CL": "G", "ML": "G", "DV": "B", "AU": "G"}], [1258, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "서선우", "G3", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "G", "DV": "G", "AU": "B"}], [1259, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "추선우", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B"}], [1260, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "반시우", "G1", 0, {"CL": "G", "DA": "G", "ML": "GC", "DV": "G", "AU": "GC", "PE": "GC"}], [1261, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "노영태", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "G", "PE": "G"}], [1262, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "설채원", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "GC"}], [1263, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "임지훈", "G1", 0, {"CL": "Y", "DV": "G"}], [1264, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "설연우", "G1", 0, {"CL": "G", "DA": "SC", "ML": "G", "DV": "B", "PE": "SC"}], [1265, "바이오소재사업본부", "추임원", "바이오소재 기획팀 2", "양유찬", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "B", "DV": "G"}], [1266, "품질경영센터", "추임원", "품질경영 지원팀 3", "민영태", "G3", 0, {"CL": "G", "PP": "G", "ML": "SC", "AU": "B"}], [1267, "품질경영센터", "추임원", "품질경영 지원팀 3", "표소율", "G3", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "G", "AU": "G"}], [1268, "품질경영센터", "추임원", "품질경영 지원팀 3", "장나은", "G1", 0, {"DS": "B", "CL": "G", "DA": "B", "ML": "SC", "DV": "B", "AU": "GC", "PE": "B"}], [1269, "품질경영센터", "추임원", "품질경영 지원팀 3", "공시우", "G1", 0, {"CL": "B", "DA": "G", "ML": "B", "DV": "B"}], [1270, "품질경영센터", "추임원", "품질경영 지원팀 3", "왕소율", "G3", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "GC", "DV": "B", "AU": "B"}], [1271, "품질경영센터", "추임원", "품질경영 지원팀 3", "권봄", "G2", 0, {"DA": "G", "ML": "G"}], [1272, "품질경영센터", "추임원", "품질경영 지원팀 3", "문다은", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B"}], [1273, "품질경영센터", "추임원", "품질경영 지원팀 3", "염시아", "G2", 0, {"CL": "G", "DA": "B", "ML": "G", "AU": "B"}], [1274, "품질경영센터", "추임원", "품질경영 지원팀 3", "배민준", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [1275, "품질경영센터", "추임원", "품질경영 지원팀 3", "최하은", "G3", 0, {"CL": "Y", "DA": "B", "PP": "Y", "ML": "SC", "DV": "G", "AU": "B"}], [1276, "품질경영센터", "추임원", "품질경영 지원팀 3", "조주원", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "Y", "ML": "B", "AU": "SC"}], [1277, "품질경영센터", "추임원", "품질경영 지원팀 3", "육아인", "G1", 1, {"CL": "G", "DA": "Y", "ML": "B", "DV": "G", "PE": "Y"}], [1278, "품질경영센터", "추임원", "품질경영 지원팀 3", "육주희", "G2", 0, {"DA": "Y", "PP": "Y", "ML": "G", "AU": "G"}], [1279, "품질경영센터", "추임원", "품질경영 지원팀 3", "허민서", "G2", 0, {"CL": "B", "DA": "G", "ML": "SC", "AU": "B"}], [1280, "품질경영센터", "추임원", "품질경영 지원팀 3", "강예준", "G2", 0, {"CL": "B", "DA": "Y", "ML": "G", "AU": "SC"}], [1281, "품질경영센터", "추임원", "품질경영 지원팀 3", "하하은", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "B"}], [1282, "품질경영센터", "추임원", "품질경영 지원팀 3", "현미자", "G1", 0, {"CL": "G", "DA": "B", "ML": "B", "DV": "GC", "AU": "G", "PE": "B"}], [1283, "품질경영센터", "추임원", "품질경영 지원팀 3", "이시우", "G3", 0, {"CL": "B", "PP": "G", "ML": "G", "AU": "G"}], [1284, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "소지아", "G2", 0, {"DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [1285, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "홍지호", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "B"}], [1286, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "소채원", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "B", "DV": "B", "AU": "G"}], [1287, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "박하은", "G2", 0, {"CL": "G", "DA": "G", "PP": "GC", "ML": "G", "AU": "G"}], [1288, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "남도윤", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "DV": "B", "AU": "B", "PE": "G"}], [1289, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "김지호", "G2", 0, {"DA": "G", "ML": "B"}], [1290, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "정연우", "G3", 0, {"CL": "G", "DA": "Y", "PP": "GC", "ML": "G", "DV": "B", "AU": "G"}], [1291, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "서건우", "G1", 0, {"CL": "Y", "DV": "B"}], [1292, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "조수아", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "AU": "B"}], [1293, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "윤채원", "G1", 0, {"CL": "Y", "DA": "SC", "DV": "G"}], [1294, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "현윤서", "G3", 0, {"CL": "G", "DA": "B", "ML": "G", "AU": "B"}], [1295, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "연예준", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "SC", "DV": "G"}], [1296, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "가주희", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "GC", "AU": "B"}], [1297, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "권선우", "G3", 0, {"CL": "B", "PP": "G", "ML": "G", "DV": "G", "AU": "G"}], [1298, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "임시아", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G"}], [1299, "친환경소재사업본부", "추임원", "친환경소재 물류팀", "선연우", "G2", 0, {"DA": "B", "ML": "G", "AU": "G"}], [1300, "경영지원센터", "임임원", "경영지원 AX팀 1", "가민서", "G2", 0, {"CL": "B", "ML": "G"}], [1301, "경영지원센터", "임임원", "경영지원 AX팀 1", "인예준", "G2", 0, {"DA": "G", "ML": "B"}], [1302, "경영지원센터", "임임원", "경영지원 AX팀 1", "손시우", "G1", 0, {"DS": "G", "CL": "G", "DA": "B", "ML": "G", "DV": "B"}], [1303, "경영지원센터", "임임원", "경영지원 AX팀 1", "길정현", "G2", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "GC", "AU": "SC"}], [1304, "경영지원센터", "임임원", "경영지원 AX팀 1", "성서준", "G3", 0, {"CL": "B", "PP": "Y", "ML": "Y", "AU": "B"}], [1305, "경영지원센터", "임임원", "경영지원 AX팀 1", "설나은", "G2", 0, {"CL": "G", "DA": "SC", "PP": "SC", "ML": "G", "DV": "SC", "AU": "B"}], [1306, "경영지원센터", "임임원", "경영지원 AX팀 1", "엄하윤", "G2", 0, {"CL": "Y", "DA": "SC", "PP": "G", "ML": "B"}], [1307, "경영지원센터", "임임원", "경영지원 AX팀 1", "위채원", "G2", 0, {"CL": "G", "DA": "Y", "PP": "SC", "ML": "G"}], [1308, "경영지원센터", "임임원", "경영지원 AX팀 1", "배준서", "G1", 0, {"CL": "Y", "DA": "B", "DV": "B"}], [1309, "경영지원센터", "임임원", "경영지원 AX팀 1", "엄서준", "G2", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G"}], [1310, "경영지원센터", "임임원", "경영지원 AX팀 1", "명소율", "G3", 0, {"CL": "Y", "DA": "B", "ML": "G", "AU": "Y"}], [1311, "경영지원센터", "임임원", "경영지원 AX팀 1", "엄민서", "G1", 0, {"CL": "G", "DV": "G"}], [1312, "경영지원센터", "임임원", "경영지원 AX팀 1", "가민준", "G1", 0, {"DS": "Y", "CL": "B", "DA": "SC", "ML": "G", "DV": "SC", "AU": "GC", "PE": "G"}], [1313, "경영지원센터", "임임원", "경영지원 AX팀 1", "임다은", "G2", 0, {"DA": "Y", "ML": "B", "AU": "Y"}], [1314, "경영지원센터", "임임원", "경영지원 AX팀 1", "주건우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G"}], [1315, "경영지원센터", "임임원", "경영지원 AX팀 1", "인단아", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B"}], [1316, "경영지원센터", "임임원", "경영지원 AX팀 1", "윤봄", "G3", 0, {"PP": "G", "ML": "GC", "AU": "G"}], [1317, "경영지원센터", "임임원", "경영지원 AX팀 1", "유민서", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "G", "DV": "B", "AU": "B"}], [1318, "경영지원센터", "임임원", "경영지원 AX팀 1", "권은우", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "GC", "AU": "B"}], [1319, "경영지원센터", "임임원", "경영지원 AX팀 1", "이윤서", "G2", 0, {"CL": "G", "DA": "G", "ML": "G", "AU": "SC"}], [1320, "경영지원센터", "임임원", "경영지원 AX팀 1", "구서진", "G1", 0, {"DS": "G", "CL": "Y", "DA": "Y", "ML": "G", "DV": "G", "AU": "G", "PE": "G"}], [1321, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "엄도윤", "G1", 0, {"DA": "GC"}], [1322, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "홍하은", "G3", 0, {"CL": "Y", "ML": "B"}], [1323, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "황아인", "G3", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G", "AU": "GC"}], [1324, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "현지훈", "G2", 0, {"CL": "G", "DA": "B", "ML": "G"}], [1325, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "신정현", "G1", 0, {"CL": "B", "DA": "Y", "DV": "B", "PE": "B"}], [1326, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "문광남", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "DV": "GC", "AU": "G"}], [1327, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "현서연", "G2", 0, {"CL": "G", "ML": "Y", "AU": "B"}], [1328, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "손민서", "G1", 0, {"CL": "G", "ML": "B", "DV": "B"}], [1329, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "전서윤", "G1", 1, {"CL": "Y", "DA": "B", "ML": "G", "DV": "B", "PE": "Y"}], [1330, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "주수아", "G2", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "B", "DV": "SC", "AU": "G"}], [1331, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "오나은", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "DV": "B", "AU": "B", "PE": "B"}], [1332, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "노하윤", "G1", 0, {"CL": "G", "DA": "G", "DV": "Y"}], [1333, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "홍하윤", "G3", 0, {"PP": "Y", "ML": "Y", "AU": "B"}], [1334, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "고우진", "G1", 0, {"CL": "SC", "DA": "B", "ML": "B", "DV": "SC"}], [1335, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "고해인", "G2", 0, {"CL": "G", "DA": "G", "ML": "B", "AU": "Y"}], [1336, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "장단아", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "AU": "Y"}], [1337, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "주선우", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B"}], [1338, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "박지민", "G3", 0, {"CL": "Y", "ML": "G"}], [1339, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "구수아", "G1", 0, {"CL": "B", "DA": "B", "ML": "G", "DV": "Y"}], [1340, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "공준서", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "PE": "G"}], [1341, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "남민서", "G1", 0, {"CL": "B", "DA": "B", "ML": "G", "DV": "G", "AU": "SC", "PE": "G"}], [1342, "바이오소재사업본부", "임임원", "바이오소재 연구팀 1", "마정현", "G1", 0, {"CL": "B", "ML": "G", "DV": "GC"}], [1343, "인재개발센터", "임임원", "인재개발 관리팀", "육지호", "G1", 0, {"CL": "G", "ML": "B", "PE": "G"}], [1344, "인재개발센터", "임임원", "인재개발 관리팀", "현민서", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "G", "PE": "B"}], [1345, "인재개발센터", "임임원", "인재개발 관리팀", "성영태", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "GC", "DV": "G", "PE": "G"}], [1346, "인재개발센터", "임임원", "인재개발 관리팀", "곽광남", "G3", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "B", "DV": "B", "AU": "G", "PE": "B"}], [1347, "인재개발센터", "임임원", "인재개발 관리팀", "진윤서", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "Y"}], [1348, "인재개발센터", "임임원", "인재개발 관리팀", "서서연", "G2", 0, {"PP": "G", "ML": "B"}], [1349, "인재개발센터", "임임원", "인재개발 관리팀", "연단아", "G1", 0, {"CL": "G", "DA": "B", "ML": "G"}], [1350, "인재개발센터", "임임원", "인재개발 관리팀", "정연우", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "GC", "AU": "B"}], [1351, "인재개발센터", "임임원", "인재개발 관리팀", "권주원", "G2", 0, {"CL": "B", "DA": "G", "ML": "B"}], [1352, "인재개발센터", "임임원", "인재개발 관리팀", "구채원", "G3", 0, {"CL": "Y", "PP": "G", "ML": "G", "AU": "G"}], [1353, "인재개발센터", "임임원", "인재개발 관리팀", "원정우", "G3", 0, {"CL": "Y", "ML": "G", "AU": "B"}], [1354, "인재개발센터", "임임원", "인재개발 관리팀", "위지아", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "B", "PE": "G"}], [1355, "인재개발센터", "임임원", "인재개발 관리팀", "명건우", "G3", 0, {"CL": "G", "DA": "Y", "ML": "SC", "AU": "B"}], [1356, "인재개발센터", "임임원", "인재개발 관리팀", "민윤서", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "AU": "B"}], [1357, "인재개발센터", "임임원", "인재개발 관리팀", "전선우", "G3", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "SC", "DV": "G", "AU": "GC"}], [1358, "인재개발센터", "임임원", "인재개발 관리팀", "도서진", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "B", "DV": "B", "AU": "G"}], [1359, "인재개발센터", "임임원", "인재개발 관리팀", "배주아", "G2", 0, {"CL": "G", "DA": "G", "ML": "G"}], [1360, "인재개발센터", "임임원", "인재개발 관리팀", "왕지훈", "G2", 0, {"ML": "G"}], [1361, "인재개발센터", "임임원", "인재개발 관리팀", "장하윤", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "G", "AU": "B"}], [1362, "인재개발센터", "임임원", "인재개발 관리팀", "인해인", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B", "AU": "G"}], [1363, "인재개발센터", "임임원", "인재개발 관리팀", "여봄", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "AU": "B"}], [1364, "인재개발센터", "임임원", "인재개발 관리팀", "신광남", "G1", 0, {"DS": "B", "CL": "B", "DA": "B", "ML": "B", "DV": "G"}], [1365, "인재개발센터", "임임원", "인재개발 관리팀", "유시우", "G3", 0, {"ML": "G"}], [1366, "인재개발센터", "임임원", "인재개발 관리팀", "고영태", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "AU": "Y"}], [1367, "인재개발센터", "임임원", "인재개발 관리팀", "석서윤", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "SC", "AU": "B"}], [1368, "인재개발센터", "임임원", "인재개발 관리팀", "배도윤", "G1", 0, {"DS": "Y", "CL": "SC", "DA": "G", "ML": "G", "DV": "B"}], [1369, "품질경영센터", "강임원", "품질경영 인사팀 1", "노지유", "G3", 0, {"CL": "G", "PP": "G", "ML": "G", "AU": "B"}], [1370, "품질경영센터", "강임원", "품질경영 인사팀 1", "임건우", "G1", 0, {"DS": "B", "CL": "G", "DA": "B", "ML": "GC", "DV": "G", "PE": "G"}], [1371, "품질경영센터", "강임원", "품질경영 인사팀 1", "임영태", "G1", 0, {"DS": "Y", "CL": "SC", "DA": "G", "PP": "B", "ML": "SC", "DV": "SC", "AU": "B", "PE": "G"}], [1372, "품질경영센터", "강임원", "품질경영 인사팀 1", "성하준", "G1", 0, {"CL": "Y", "DA": "SC", "DV": "G"}], [1373, "품질경영센터", "강임원", "품질경영 인사팀 1", "옥지유", "G2", 0, {"CL": "Y", "DA": "Y", "ML": "B", "AU": "SC"}], [1374, "품질경영센터", "강임원", "품질경영 인사팀 1", "한주아", "G2", 0, {"CL": "G", "ML": "B", "AU": "G"}], [1375, "품질경영센터", "강임원", "품질경영 인사팀 1", "여지호", "G3", 0, {"CL": "G", "ML": "SC", "AU": "G"}], [1376, "품질경영센터", "강임원", "품질경영 인사팀 1", "민정우", "G3", 0, {"CL": "G", "PP": "SC", "ML": "B", "AU": "B"}], [1377, "품질경영센터", "강임원", "품질경영 인사팀 1", "염우진", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G"}], [1378, "품질경영센터", "강임원", "품질경영 인사팀 1", "신서연", "G1", 0, {"CL": "Y", "DA": "SC", "ML": "B"}], [1379, "품질경영센터", "강임원", "품질경영 인사팀 1", "원미자", "G2", 1, {"CL": "Y", "DA": "G", "ML": "G"}], [1380, "품질경영센터", "강임원", "품질경영 인사팀 1", "임지우", "G2", 0, {"DA": "G", "PP": "Y", "ML": "G", "AU": "B"}], [1381, "품질경영센터", "강임원", "품질경영 인사팀 1", "유하은", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "GC", "AU": "B"}], [1382, "품질경영센터", "강임원", "품질경영 인사팀 1", "문서준", "G1", 0, {}], [1383, "품질경영센터", "강임원", "품질경영 인사팀 1", "정광남", "G2", 0, {"DA": "G", "PP": "G", "ML": "GC"}], [1384, "품질경영센터", "강임원", "품질경영 인사팀 1", "유건우", "G1", 0, {"DS": "Y", "CL": "G", "DA": "SC", "ML": "G", "PE": "GC"}], [1385, "품질경영센터", "강임원", "품질경영 인사팀 1", "송하윤", "G2", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "GC", "AU": "B"}], [1386, "품질경영센터", "강임원", "품질경영 인사팀 1", "류연우", "G3", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "B", "AU": "G"}], [1387, "생산기술센터", "강임원", "생산기술 AX팀", "안주희", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G", "AU": "B"}], [1388, "생산기술센터", "강임원", "생산기술 AX팀", "방봄", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [1389, "생산기술센터", "강임원", "생산기술 AX팀", "배유찬", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "SC", "DV": "B", "AU": "B", "PE": "G"}], [1390, "생산기술센터", "강임원", "생산기술 AX팀", "천지아", "G2", 0, {"DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [1391, "생산기술센터", "강임원", "생산기술 AX팀", "노유찬", "G3", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G", "AU": "B"}], [1392, "생산기술센터", "강임원", "생산기술 AX팀", "진정우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "B"}], [1393, "생산기술센터", "강임원", "생산기술 AX팀", "표시우", "G2", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "G", "AU": "Y"}], [1394, "생산기술센터", "강임원", "생산기술 AX팀", "소채원", "G2", 0, {"CL": "G", "DA": "B", "PP": "B", "ML": "Y"}], [1395, "생산기술센터", "강임원", "생산기술 AX팀", "배주원", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "G", "AU": "Y"}], [1396, "생산기술센터", "강임원", "생산기술 AX팀", "차지유", "G2", 0, {"DA": "Y", "ML": "G"}], [1397, "생산기술센터", "강임원", "생산기술 AX팀", "공소율", "G2", 0, {"CL": "G", "DA": "GC", "ML": "B", "AU": "B"}], [1398, "생산기술센터", "강임원", "생산기술 AX팀", "천도윤", "G1", 0, {"CL": "G", "DA": "B", "ML": "B", "DV": "SC", "PE": "G"}], [1399, "생산기술센터", "강임원", "생산기술 AX팀", "함정현", "G3", 0, {"CL": "G", "PP": "G", "ML": "B", "AU": "Y"}], [1400, "생산기술센터", "강임원", "생산기술 AX팀", "연지유", "G1", 1, {"CL": "Y", "DA": "B", "ML": "G", "DV": "G"}], [1401, "생산기술센터", "강임원", "생산기술 AX팀", "손지민", "G2", 0, {"CL": "G", "DA": "Y", "ML": "G", "AU": "B"}], [1402, "생산기술센터", "강임원", "생산기술 AX팀", "강유찬", "G2", 0, {"CL": "B", "ML": "G"}], [1403, "생산기술센터", "강임원", "생산기술 AX팀", "육나은", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "SC", "DV": "SC", "AU": "G", "PE": "G"}], [1404, "생산기술센터", "강임원", "생산기술 AX팀", "성시아", "G3", 0, {"CL": "B", "ML": "G"}], [1405, "생산기술센터", "강임원", "생산기술 AX팀", "신지우", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [1406, "생산기술센터", "강임원", "생산기술 AX팀", "반준우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "GC"}], [1407, "경영지원센터", "강임원", "경영지원 관리팀", "성선우", "G2", 0, {"CL": "G", "DA": "SC", "ML": "G"}], [1408, "경영지원센터", "강임원", "경영지원 관리팀", "백지민", "G1", 0, {"DS": "Y", "CL": "SC", "DA": "B", "ML": "G", "DV": "B"}], [1409, "경영지원센터", "강임원", "경영지원 관리팀", "백하준", "G1", 0, {"CL": "G", "ML": "G", "DV": "B"}], [1410, "경영지원센터", "강임원", "경영지원 관리팀", "도준우", "G1", 0, {"DS": "Y", "CL": "SC", "DA": "G", "ML": "B", "DV": "G"}], [1411, "경영지원센터", "강임원", "경영지원 관리팀", "채지호", "G1", 0, {"CL": "Y", "DA": "G", "ML": "SC", "DV": "SC"}], [1412, "경영지원센터", "강임원", "경영지원 관리팀", "왕광남", "G3", 0, {"CL": "Y", "PP": "G", "ML": "SC", "DV": "B", "AU": "B"}], [1413, "경영지원센터", "강임원", "경영지원 관리팀", "장유찬", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "SC", "AU": "B"}], [1414, "경영지원센터", "강임원", "경영지원 관리팀", "인서연", "G3", 0, {"PP": "Y", "ML": "SC", "AU": "B"}], [1415, "경영지원센터", "강임원", "경영지원 관리팀", "명지우", "G2", 1, {"DA": "G", "ML": "G"}], [1416, "경영지원센터", "강임원", "경영지원 관리팀", "서아인", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "GC", "DV": "B", "AU": "SC", "PE": "B"}], [1417, "경영지원센터", "강임원", "경영지원 관리팀", "한다은", "G1", 0, {"DS": "B", "CL": "Y", "DA": "G", "PP": "B", "ML": "SC", "DV": "SC", "AU": "B", "PE": "G"}], [1418, "경영지원센터", "강임원", "경영지원 관리팀", "권도윤", "G1", 0, {"CL": "B", "ML": "G", "DV": "SC"}], [1419, "경영지원센터", "강임원", "경영지원 관리팀", "염지유", "G3", 0, {"CL": "G", "ML": "B", "AU": "GC"}], [1420, "경영지원센터", "강임원", "경영지원 관리팀", "옥채원", "G3", 0, {"PP": "Y", "ML": "Y", "AU": "G"}], [1421, "경영지원센터", "강임원", "경영지원 관리팀", "전건우", "G3", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "B", "DV": "SC", "AU": "SC", "PE": "SC"}], [1422, "경영지원센터", "강임원", "경영지원 관리팀", "류영태", "G2", 0, {"DA": "Y", "PP": "B", "ML": "G"}], [1423, "경영지원센터", "강임원", "경영지원 관리팀", "금은우", "G2", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "SC", "DV": "SC", "AU": "B"}], [1424, "경영지원센터", "강임원", "경영지원 관리팀", "노연우", "G3", 0, {"CL": "Y", "ML": "B", "DV": "B", "AU": "G"}], [1425, "경영지원센터", "강임원", "경영지원 관리팀", "가지우", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "AU": "GC"}], [1426, "경영지원센터", "강임원", "경영지원 관리팀", "손지우", "G2", 1, {"CL": "G", "DA": "Y", "PP": "G", "ML": "B", "AU": "B"}], [1427, "경영지원센터", "강임원", "경영지원 관리팀", "현은우", "G1", 0, {"CL": "B", "DA": "Y", "ML": "G", "DV": "G", "PE": "G"}], [1428, "경영지원센터", "강임원", "경영지원 관리팀", "도채원", "G3", 0, {"CL": "Y", "DA": "B", "PP": "SC", "ML": "B", "AU": "GC"}], [1429, "경영지원센터", "강임원", "경영지원 관리팀", "유주아", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "DV": "SC", "AU": "GC", "PE": "GC"}], [1430, "경영지원센터", "강임원", "경영지원 관리팀", "황하준", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "SC", "DV": "B", "PE": "B"}], [1431, "품질경영센터", "강임원", "품질경영 안전팀", "도선우", "G3", 0, {"CL": "Y", "ML": "G", "AU": "B"}], [1432, "품질경영센터", "강임원", "품질경영 안전팀", "문지호", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G"}], [1433, "품질경영센터", "강임원", "품질경영 안전팀", "여민서", "G1", 0, {"DS": "G", "CL": "G", "DA": "SC", "PP": "G", "ML": "G", "DV": "B", "AU": "G", "PE": "B"}], [1434, "품질경영센터", "강임원", "품질경영 안전팀", "기서윤", "G2", 0, {"ML": "G"}], [1435, "품질경영센터", "강임원", "품질경영 안전팀", "육나은", "G1", 0, {"CL": "SC", "DA": "G", "DV": "GC", "PE": "G"}], [1436, "품질경영센터", "강임원", "품질경영 안전팀", "이영태", "G1", 0, {"CL": "G", "DA": "Y", "DV": "B"}], [1437, "품질경영센터", "강임원", "품질경영 안전팀", "엄준서", "G1", 0, {"CL": "B", "DA": "B", "DV": "B", "PE": "B"}], [1438, "품질경영센터", "강임원", "품질경영 안전팀", "설유찬", "G3", 0, {"CL": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "Y"}], [1439, "품질경영센터", "강임원", "품질경영 안전팀", "진도윤", "G2", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "B"}], [1440, "품질경영센터", "강임원", "품질경영 안전팀", "금서진", "G3", 0, {"CL": "G", "ML": "GC"}], [1441, "품질경영센터", "강임원", "품질경영 안전팀", "강미자", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [1442, "품질경영센터", "강임원", "품질경영 안전팀", "공서윤", "G2", 0, {"CL": "B", "DA": "G", "ML": "G", "AU": "G"}], [1443, "품질경영센터", "강임원", "품질경영 안전팀", "정예준", "G2", 0, {"DA": "B", "PP": "B", "ML": "G", "AU": "B"}], [1444, "품질경영센터", "강임원", "품질경영 안전팀", "방하준", "G2", 1, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G", "DV": "B", "AU": "Y"}], [1445, "품질경영센터", "강임원", "품질경영 안전팀", "전다은", "G3", 0, {"CL": "G", "PP": "G", "ML": "B", "DV": "G", "AU": "Y"}], [1446, "품질경영센터", "강임원", "품질경영 안전팀", "신윤서", "G2", 0, {"CL": "B", "DA": "B", "ML": "G", "AU": "G"}], [1447, "품질경영센터", "강임원", "품질경영 안전팀", "금지아", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "GC", "PE": "B"}], [1448, "품질경영센터", "강임원", "품질경영 안전팀", "천정우", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "GC"}], [1449, "품질경영센터", "강임원", "품질경영 안전팀", "천예준", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "SC"}], [1450, "DX센터", "유임원", "DX 혁신팀 1", "기지유", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "GC", "AU": "B"}], [1451, "DX센터", "유임원", "DX 혁신팀 1", "노은우", "G3", 0, {"DA": "Y", "ML": "B", "AU": "G"}], [1452, "DX센터", "유임원", "DX 혁신팀 1", "엄봄", "G3", 0, {"CL": "G", "PP": "SC", "ML": "G", "AU": "G"}], [1453, "DX센터", "유임원", "DX 혁신팀 1", "라지민", "G1", 0, {"CL": "G", "DA": "G", "ML": "SC", "DV": "B"}], [1454, "DX센터", "유임원", "DX 혁신팀 1", "선단아", "G1", 0, {"CL": "G", "DA": "G"}], [1455, "DX센터", "유임원", "DX 혁신팀 1", "위수아", "G3", 0, {"CL": "G", "PP": "B", "ML": "G", "AU": "SC"}], [1456, "DX센터", "유임원", "DX 혁신팀 1", "성유찬", "G3", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "DV": "B", "AU": "B", "PE": "G"}], [1457, "DX센터", "유임원", "DX 혁신팀 1", "여주희", "G3", 0, {"CL": "G", "PP": "B", "ML": "G", "AU": "G"}], [1458, "DX센터", "유임원", "DX 혁신팀 1", "신미자", "G1", 0, {"CL": "Y", "DA": "Y"}], [1459, "DX센터", "유임원", "DX 혁신팀 1", "선시아", "G2", 0, {"CL": "Y", "ML": "Y", "AU": "G"}], [1460, "DX센터", "유임원", "DX 혁신팀 1", "차지우", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "B"}], [1461, "DX센터", "유임원", "DX 혁신팀 1", "지준서", "G2", 0, {"CL": "Y", "DA": "Y", "ML": "G"}], [1462, "DX센터", "유임원", "DX 혁신팀 1", "명봄", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B"}], [1463, "DX센터", "유임원", "DX 혁신팀 1", "명영태", "G2", 0, {"CL": "Y", "DA": "G", "PP": "Y", "ML": "G", "DV": "G", "AU": "B"}], [1464, "DX센터", "유임원", "DX 혁신팀 1", "석유찬", "G3", 0, {"ML": "Y", "AU": "GC"}], [1465, "DX센터", "유임원", "DX 혁신팀 1", "위서진", "G3", 0, {"CL": "G", "PP": "B", "ML": "B", "AU": "G"}], [1466, "DX센터", "유임원", "DX 혁신팀 1", "주봄", "G3", 0, {"CL": "G", "PP": "GC", "ML": "G", "AU": "G"}], [1467, "DX센터", "유임원", "DX 혁신팀 1", "황지민", "G2", 0, {"CL": "Y", "DA": "B", "PP": "SC", "ML": "B", "DV": "B", "AU": "B"}], [1468, "DX센터", "유임원", "DX 혁신팀 1", "여은우", "G2", 0, {"DA": "Y", "PP": "G", "ML": "G", "AU": "G"}], [1469, "DX센터", "유임원", "DX 혁신팀 1", "도서준", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G", "PE": "G"}], [1470, "DX센터", "유임원", "DX 혁신팀 1", "도시우", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "SC", "DV": "G", "PE": "G"}], [1471, "품질경영센터", "유임원", "품질경영 회계팀 2", "유유찬", "G2", 0, {"ML": "G"}], [1472, "품질경영센터", "유임원", "품질경영 회계팀 2", "백지호", "G3", 0, {"ML": "Y", "AU": "B"}], [1473, "품질경영센터", "유임원", "품질경영 회계팀 2", "구채원", "G3", 0, {"CL": "Y", "ML": "Y", "AU": "SC"}], [1474, "품질경영센터", "유임원", "품질경영 회계팀 2", "도주원", "G2", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "G", "DV": "G", "AU": "GC", "PE": "B"}], [1475, "품질경영센터", "유임원", "품질경영 회계팀 2", "현준우", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "SC"}], [1476, "품질경영센터", "유임원", "품질경영 회계팀 2", "유하준", "G3", 0, {"CL": "Y", "PP": "G", "ML": "B", "AU": "SC"}], [1477, "품질경영센터", "유임원", "품질경영 회계팀 2", "조지아", "G2", 0, {"DA": "Y", "ML": "G", "AU": "B"}], [1478, "품질경영센터", "유임원", "품질경영 회계팀 2", "류윤서", "G1", 0, {"DS": "Y", "CL": "G", "DA": "B", "ML": "G", "DV": "B", "PE": "SC"}], [1479, "품질경영센터", "유임원", "품질경영 회계팀 2", "라서준", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "G"}], [1480, "품질경영센터", "유임원", "품질경영 회계팀 2", "허지호", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [1481, "품질경영센터", "유임원", "품질경영 회계팀 2", "송윤서", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "G", "DV": "G", "AU": "GC", "PE": "Y"}], [1482, "품질경영센터", "유임원", "품질경영 회계팀 2", "백하은", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "G", "PE": "GC"}], [1483, "품질경영센터", "유임원", "품질경영 회계팀 2", "손하윤", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "G"}], [1484, "품질경영센터", "유임원", "품질경영 회계팀 2", "곽은우", "G3", 0, {"CL": "G", "PP": "B", "ML": "B", "AU": "SC"}], [1485, "품질경영센터", "유임원", "품질경영 회계팀 2", "남하준", "G3", 0, {"CL": "B", "PP": "Y", "ML": "G", "AU": "G"}], [1486, "품질경영센터", "유임원", "품질경영 회계팀 2", "전지우", "G2", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "Y"}], [1487, "품질경영센터", "유임원", "품질경영 회계팀 2", "구미자", "G3", 0, {"CL": "G", "PP": "B", "ML": "G", "AU": "G"}], [1488, "품질경영센터", "유임원", "품질경영 회계팀 2", "노채원", "G1", 0, {"DS": "G", "CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "GC", "AU": "SC", "PE": "SC"}], [1489, "품질경영센터", "유임원", "품질경영 회계팀 2", "권주희", "G2", 0, {"DA": "G", "ML": "GC", "AU": "B"}], [1490, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "안봄", "G3", 0, {"DS": "B", "DOE": "B", "CL": "Y", "DA": "SC", "PP": "B", "ML": "B", "DV": "B", "AU": "G", "TB": "B", "PE": "G"}], [1491, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "윤다은", "G2", 0, {"DA": "Y", "PP": "Y", "ML": "B", "AU": "B"}], [1492, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "소지아", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "GC", "AU": "G"}], [1493, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "염주희", "G2", 0, {"DA": "Y", "ML": "G", "AU": "G"}], [1494, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "문서준", "G3", 0, {"CL": "G", "DA": "Y", "PP": "B", "ML": "G", "DV": "SC", "AU": "G"}], [1495, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "오주원", "G2", 0, {"DA": "G", "ML": "B", "AU": "Y"}], [1496, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "조지민", "G1", 0, {"DV": "G"}], [1497, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "금민서", "G3", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "G"}], [1498, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "윤지훈", "G2", 0, {"CL": "Y", "DA": "G", "PP": "GC", "ML": "B", "AU": "B"}], [1499, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "강해인", "G1", 0, {"DA": "G", "ML": "G", "DV": "SC"}], [1500, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "정정우", "G3", 0, {"CL": "G", "ML": "B", "AU": "G"}], [1501, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "신준서", "G3", 0, {"ML": "G", "AU": "B"}], [1502, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "마하은", "G2", 1, {"PP": "G", "ML": "G", "AU": "G"}], [1503, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "신지호", "G2", 1, {"CL": "B", "DA": "G", "PP": "G", "ML": "G", "AU": "G"}], [1504, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "신미자", "G2", 1, {"DA": "B", "ML": "B"}], [1505, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "노해인", "G1", 0, {"CL": "Y", "DA": "G", "DV": "G", "PE": "B"}], [1506, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "백선우", "G1", 1, {"DS": "B", "CL": "G", "DA": "G", "ML": "G", "DV": "SC", "AU": "SC", "PE": "B"}], [1507, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "하아인", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [1508, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "민정우", "G2", 0, {"CL": "B", "DA": "G", "PP": "SC", "ML": "GC", "DV": "G", "AU": "G"}], [1509, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "라민준", "G1", 0, {"CL": "B", "DA": "G", "ML": "G", "DV": "SC", "PE": "G"}], [1510, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "마우진", "G3", 0, {"CL": "G", "PP": "SC", "ML": "G", "AU": "B"}], [1511, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "반지우", "G1", 1, {"CL": "G", "DA": "B", "DV": "Y"}], [1512, "글로벌사업센터", "유임원", "글로벌사업 마케팅팀", "방수아", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "B", "ML": "G", "DV": "G", "AU": "B", "PE": "G"}], [1513, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "우민서", "G1", 0, {"DS": "G", "CL": "Y", "DA": "G", "DV": "G", "PE": "G"}], [1514, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "신봄", "G2", 0, {"DA": "SC", "ML": "G", "AU": "GC"}], [1515, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "소미자", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "G"}], [1516, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "전우진", "G2", 0, {"CL": "G", "DA": "B", "ML": "G", "DV": "GC", "AU": "G"}], [1517, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "지서현", "G2", 0, {"CL": "B", "PP": "SC", "ML": "B"}], [1518, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "권하윤", "G2", 0, {"PP": "G", "ML": "B", "AU": "SC"}], [1519, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "하연우", "G3", 0, {"CL": "B", "PP": "Y", "ML": "B"}], [1520, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "황하윤", "G1", 0, {"CL": "G", "DA": "G", "ML": "B", "DV": "B"}], [1521, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "하수아", "G1", 0, {"CL": "G", "DA": "Y", "ML": "B", "DV": "GC"}], [1522, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "홍준서", "G3", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "SC", "DV": "B", "AU": "SC"}], [1523, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "차우진", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [1524, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "곽미자", "G2", 0, {"ML": "G", "AU": "G"}], [1525, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "송주희", "G2", 0, {"CL": "G", "DA": "G", "ML": "B"}], [1526, "정밀화학사업본부", "유임원", "정밀화학 AX팀 2", "양주아", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "SC", "DV": "B", "PE": "B"}], [1527, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "인하은", "G2", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "B", "DV": "B", "AU": "G"}], [1528, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "반유찬", "G3", 0, {"CL": "G", "ML": "B", "DV": "G", "AU": "Y"}], [1529, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "공지호", "G2", 0, {"ML": "B"}], [1530, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "정주원", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "AU": "G"}], [1531, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "연지훈", "G3", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "G", "AU": "G"}], [1532, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "하은우", "G2", 0, {"CL": "G", "DA": "GC", "PP": "G", "ML": "SC", "AU": "B"}], [1533, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "진광남", "G3", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "B", "DV": "G", "AU": "Y"}], [1534, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "선하준", "G3", 0, {"CL": "B", "DA": "Y", "PP": "Y", "ML": "G", "DV": "G", "AU": "GC", "PE": "Y"}], [1535, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "길광남", "G2", 0, {"ML": "B"}], [1536, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "임채원", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "G", "PE": "B"}], [1537, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "유은우", "G1", 0, {"DS": "G", "CL": "Y", "DA": "B", "PP": "G", "ML": "GC", "DV": "G", "AU": "G", "PE": "B"}], [1538, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "차예준", "G2", 0, {"CL": "Y", "DA": "B", "PP": "GC", "ML": "GC"}], [1539, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "유선우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "B"}], [1540, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "유서현", "G1", 0, {"DS": "B", "CL": "B", "DA": "B", "ML": "G", "DV": "G", "AU": "B", "PE": "Y"}], [1541, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "표아인", "G1", 0, {"DS": "G", "CL": "B", "DA": "G", "ML": "GC", "DV": "B", "AU": "SC"}], [1542, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "원윤서", "G2", 0, {"CL": "B", "DA": "B", "PP": "B", "ML": "G", "AU": "G"}], [1543, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "오소율", "G1", 1, {"CL": "B", "DA": "B", "DV": "G", "PE": "G"}], [1544, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "위시아", "G3", 0, {"ML": "B", "AU": "SC"}], [1545, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "고하준", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "G", "AU": "B"}], [1546, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "구주아", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "SC", "DV": "G", "AU": "Y"}], [1547, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "강다은", "G2", 0, {"CL": "G", "DA": "B", "ML": "G", "AU": "G"}], [1548, "글로벌사업센터", "도임원", "글로벌사업 사업팀 1", "천서준", "G2", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "G", "DV": "B", "AU": "G"}], [1549, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "신정현", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "Y"}], [1550, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "박단아", "G2", 1, {"CL": "G", "DA": "Y", "ML": "G"}], [1551, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "장다은", "G1", 0, {"CL": "B", "DA": "Y", "ML": "G", "DV": "G", "PE": "G"}], [1552, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "라준우", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "AU": "GC"}], [1553, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "명예준", "G1", 0, {"CL": "Y", "DA": "SC", "ML": "G", "DV": "B", "PE": "G"}], [1554, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "함지민", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "B"}], [1555, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "윤윤서", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "B", "PE": "G"}], [1556, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "안미자", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "G", "ML": "B"}], [1557, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "라시아", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "B", "PP": "G", "ML": "B", "DV": "B", "AU": "B", "PE": "G"}], [1558, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "손해인", "G1", 0, {"CL": "Y", "DA": "G", "DV": "G", "PE": "B"}], [1559, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "임봄", "G1", 0, {"DS": "Y", "CL": "G", "DA": "SC", "PP": "G", "ML": "G", "DV": "B", "PE": "B"}], [1560, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "최도윤", "G3", 0, {"CL": "B", "PP": "B", "ML": "B"}], [1561, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "강지유", "G2", 1, {"CL": "B", "DA": "G", "ML": "GC"}], [1562, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "노소율", "G3", 0, {"CL": "Y", "ML": "SC"}], [1563, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "진하준", "G1", 1, {"CL": "G", "DA": "Y", "DV": "B"}], [1564, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "이영태", "G2", 0, {"CL": "Y", "DA": "Y", "ML": "B", "AU": "G"}], [1565, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "엄하준", "G1", 0, {"CL": "B", "DA": "Y", "DV": "SC"}], [1566, "신사업기획센터", "도임원", "신사업기획 AX팀 1", "구준우", "G3", 0, {"DA": "B", "PP": "G", "ML": "B", "AU": "G"}], [1567, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "배하윤", "G1", 0, {"DS": "Y", "CL": "Y", "DA": "B", "ML": "G", "DV": "B", "PE": "B"}], [1568, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "문예준", "G1", 0, {"CL": "B", "DA": "G", "ML": "G", "DV": "G"}], [1569, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "여지유", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "DV": "G", "AU": "G"}], [1570, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "여준우", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "GC", "DV": "B", "AU": "B"}], [1571, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "백정현", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "B"}], [1572, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "노주원", "G3", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "DV": "G", "AU": "G"}], [1573, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "고주원", "G3", 0, {"CL": "Y", "ML": "B", "AU": "Y"}], [1574, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "강윤서", "G3", 0, {"CL": "Y", "ML": "Y"}], [1575, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "가수아", "G2", 0, {"DA": "B", "ML": "G"}], [1576, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "안연우", "G1", 0, {"CL": "Y", "ML": "G"}], [1577, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "가민서", "G3", 0, {"CL": "Y", "PP": "Y", "ML": "G", "AU": "G"}], [1578, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "최서윤", "G2", 0, {"CL": "B", "DA": "B", "ML": "SC", "AU": "G"}], [1579, "글로벌사업센터", "도임원", "글로벌사업 AX팀", "신아인", "G3", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "G", "DV": "B", "AU": "Y"}], [1580, "경영지원센터", "도임원", "경영지원 구매팀 2", "방서진", "G3", 0, {"CL": "B", "ML": "Y", "AU": "G"}], [1581, "경영지원센터", "도임원", "경영지원 구매팀 2", "함도윤", "G1", 0, {"CL": "B", "DA": "Y", "ML": "B", "DV": "SC"}], [1582, "경영지원센터", "도임원", "경영지원 구매팀 2", "안단아", "G3", 0, {"DS": "G", "CL": "Y", "DA": "G", "PP": "G", "ML": "GC", "DV": "G", "AU": "B", "PE": "SC"}], [1583, "경영지원센터", "도임원", "경영지원 구매팀 2", "윤서연", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "DV": "G", "AU": "G"}], [1584, "경영지원센터", "도임원", "경영지원 구매팀 2", "서단아", "G1", 0, {"CL": "G", "DA": "Y", "ML": "SC"}], [1585, "경영지원센터", "도임원", "경영지원 구매팀 2", "채소율", "G1", 0, {"DS": "G", "CL": "Y", "DA": "Y", "PP": "B", "ML": "B", "DV": "G", "AU": "SC", "PE": "Y"}], [1586, "경영지원센터", "도임원", "경영지원 구매팀 2", "신주희", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "DV": "GC", "AU": "G"}], [1587, "경영지원센터", "도임원", "경영지원 구매팀 2", "차준서", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "G", "AU": "G"}], [1588, "경영지원센터", "도임원", "경영지원 구매팀 2", "노은우", "G2", 0, {"PP": "G", "ML": "B"}], [1589, "경영지원센터", "도임원", "경영지원 구매팀 2", "전예준", "G2", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "B"}], [1590, "경영지원센터", "도임원", "경영지원 구매팀 2", "배아인", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B"}], [1591, "경영지원센터", "도임원", "경영지원 구매팀 2", "류단아", "G1", 0, {"CL": "G", "DA": "B", "DV": "GC", "PE": "G"}], [1592, "경영지원센터", "도임원", "경영지원 구매팀 2", "금정현", "G2", 0, {"CL": "SC", "DA": "B", "PP": "G", "ML": "SC", "AU": "Y"}], [1593, "경영지원센터", "도임원", "경영지원 구매팀 2", "주유찬", "G2", 0, {"CL": "SC", "DA": "G", "PP": "G", "ML": "SC"}], [1594, "경영지원센터", "도임원", "경영지원 구매팀 2", "이서준", "G3", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "G", "DV": "G", "AU": "Y"}], [1595, "경영지원센터", "도임원", "경영지원 구매팀 2", "양주원", "G2", 0, {"CL": "G", "DA": "B", "ML": "G", "AU": "G"}], [1596, "경영지원센터", "도임원", "경영지원 구매팀 2", "유미자", "G2", 0, {"DA": "G", "PP": "B", "ML": "G"}], [1597, "경영지원센터", "도임원", "경영지원 구매팀 2", "금주아", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G", "DV": "B", "AU": "B"}], [1598, "경영지원센터", "도임원", "경영지원 구매팀 2", "왕지민", "G3", 0, {"CL": "Y", "PP": "B", "ML": "B", "AU": "B"}], [1599, "경영지원센터", "도임원", "경영지원 구매팀 2", "류채원", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G", "AU": "G"}], [1600, "경영지원센터", "도임원", "경영지원 구매팀 2", "금영태", "G1", 0, {"CL": "G", "DA": "G", "ML": "G", "DV": "GC", "PE": "G"}], [1601, "경영지원센터", "도임원", "경영지원 구매팀 2", "정서현", "G2", 1, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "DV": "G", "AU": "G"}], [1602, "경영지원센터", "도임원", "경영지원 구매팀 2", "주해인", "G2", 0, {"DA": "SC", "PP": "G", "ML": "B", "AU": "GC"}], [1603, "경영지원센터", "도임원", "경영지원 구매팀 2", "명나은", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "SC", "AU": "G"}], [1604, "경영지원센터", "도임원", "경영지원 구매팀 2", "류민준", "G1", 0, {"CL": "B", "DA": "Y", "ML": "B", "DV": "SC", "PE": "B"}], [1605, "경영지원센터", "도임원", "경영지원 구매팀 2", "권지호", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "Y", "ML": "G", "DV": "G", "AU": "GC", "PE": "Y"}], [1606, "DX센터", "마임원", "DX 사업팀 1", "곽은우", "G1", 0, {"CL": "G", "DA": "Y", "ML": "SC", "PE": "B"}], [1607, "DX센터", "마임원", "DX 사업팀 1", "방주아", "G3", 0, {"CL": "G", "DA": "Y", "PP": "SC", "ML": "B", "AU": "G"}], [1608, "DX센터", "마임원", "DX 사업팀 1", "한민서", "G3", 0, {"CL": "SC", "DA": "B", "ML": "SC", "AU": "Y"}], [1609, "DX센터", "마임원", "DX 사업팀 1", "인준우", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "B", "AU": "G"}], [1610, "DX센터", "마임원", "DX 사업팀 1", "라민준", "G3", 0, {"PP": "SC", "ML": "B", "AU": "Y"}], [1611, "DX센터", "마임원", "DX 사업팀 1", "양지아", "G2", 0, {"CL": "Y", "DA": "SC", "ML": "B"}], [1612, "DX센터", "마임원", "DX 사업팀 1", "배지호", "G1", 0, {"CL": "Y", "DA": "G", "DV": "B", "PE": "G"}], [1613, "DX센터", "마임원", "DX 사업팀 1", "전다은", "G3", 0, {"CL": "G", "PP": "B", "ML": "G", "AU": "G"}], [1614, "DX센터", "마임원", "DX 사업팀 1", "전해인", "G1", 0, {"CL": "G", "DA": "Y", "DV": "SC", "PE": "Y"}], [1615, "DX센터", "마임원", "DX 사업팀 1", "서수아", "G1", 0, {"DS": "Y", "CL": "G", "DA": "SC", "ML": "G", "DV": "B"}], [1616, "DX센터", "마임원", "DX 사업팀 1", "정유찬", "G3", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "G", "DV": "GC", "AU": "G", "PE": "Y"}], [1617, "DX센터", "마임원", "DX 사업팀 1", "현아인", "G3", 0, {"CL": "G", "PP": "G", "ML": "B", "AU": "G"}], [1618, "DX센터", "마임원", "DX 사업팀 1", "설미자", "G3", 0, {"CL": "G", "DA": "SC", "PP": "B", "ML": "G", "DV": "B", "AU": "Y"}], [1619, "DX센터", "마임원", "DX 사업팀 1", "엄지우", "G3", 0, {"CL": "Y", "PP": "B", "ML": "B", "AU": "SC"}], [1620, "DX센터", "마임원", "DX 사업팀 1", "오단아", "G3", 0, {"CL": "Y", "DA": "B", "PP": "B", "ML": "B", "AU": "B"}], [1621, "DX센터", "마임원", "DX 사업팀 1", "진서준", "G1", 0, {"CL": "B", "DA": "G", "ML": "G", "DV": "G", "PE": "B"}], [1622, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "노준서", "G3", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "B", "AU": "Y"}], [1623, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "한수아", "G2", 0, {"DA": "G", "PP": "B", "ML": "B"}], [1624, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "함지아", "G2", 0, {"CL": "Y", "DA": "B", "ML": "B"}], [1625, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "송시우", "G1", 0, {"DS": "G", "CL": "Y", "DA": "SC", "DV": "G", "PE": "SC"}], [1626, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "여시우", "G2", 0, {"CL": "B", "DA": "Y", "PP": "SC", "ML": "GC", "DV": "B", "AU": "SC", "PE": "G"}], [1627, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "엄민준", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "Y", "ML": "SC", "DV": "B", "AU": "B", "PE": "B"}], [1628, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "현지유", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "SC", "DV": "B", "AU": "G", "PE": "B"}], [1629, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "이윤서", "G3", 0, {"ML": "B", "AU": "G"}], [1630, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "류연우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "GC", "ML": "G", "DV": "G", "AU": "G"}], [1631, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "위주희", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "AU": "Y"}], [1632, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "류시아", "G3", 0, {"CL": "SC", "PP": "B", "ML": "G", "AU": "SC"}], [1633, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "손선우", "G1", 0, {"CL": "G", "DA": "G"}], [1634, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "백해인", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "SC", "DV": "G", "AU": "B", "PE": "B"}], [1635, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "노민준", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "DV": "SC", "AU": "G"}], [1636, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "유지호", "G3", 0, {"CL": "Y", "ML": "G", "AU": "B"}], [1637, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "전연우", "G3", 0, {"CL": "B", "DA": "B", "PP": "SC", "ML": "GC", "DV": "G", "AU": "B"}], [1638, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "권나은", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "B"}], [1639, "기초소재사업본부", "마임원", "기초소재 개발팀 2", "유단아", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "SC", "ML": "G", "AU": "SC"}], [1640, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "우하은", "G2", 0, {"CL": "G", "DA": "G", "ML": "B"}], [1641, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "채윤서", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B", "DV": "B"}], [1642, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "진시아", "G3", 0, {"CL": "Y", "PP": "G", "ML": "G", "DV": "SC", "AU": "B"}], [1643, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "문다은", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "B", "AU": "B"}], [1644, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "문은우", "G3", 0, {"CL": "Y", "ML": "G"}], [1645, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "도소율", "G3", 0, {"CL": "Y", "ML": "G", "AU": "GC"}], [1646, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "배채원", "G1", 0, {"CL": "Y", "DA": "B", "ML": "Y", "DV": "G", "PE": "B"}], [1647, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "추서현", "G1", 0, {"DS": "B", "CL": "Y", "DA": "G", "ML": "B", "DV": "B", "AU": "B", "PE": "G"}], [1648, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "길선우", "G3", 0, {"CL": "Y", "DA": "B", "ML": "SC", "AU": "SC"}], [1649, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "임서준", "G2", 0, {"DA": "B", "ML": "GC", "AU": "B"}], [1650, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "전민준", "G2", 0, {"DA": "Y", "PP": "Y", "ML": "SC", "AU": "B"}], [1651, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "기하은", "G1", 0, {"DS": "B", "CL": "G", "DA": "G", "ML": "G", "DV": "G", "AU": "B", "PE": "Y"}], [1652, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "강채원", "G2", 0, {"ML": "SC"}], [1653, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "여윤서", "G3", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "GC", "DV": "SC", "AU": "B"}], [1654, "첨단소재사업본부", "마임원", "첨단소재 인사팀", "길서윤", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "G"}], [1655, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "백소율", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G", "DV": "G", "PE": "GC"}], [1656, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "안서진", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "B", "DV": "G", "PE": "B"}], [1657, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "노서연", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "B", "PE": "B"}], [1658, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "진윤서", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "B"}], [1659, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "길주희", "G2", 0, {"DA": "B"}], [1660, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "정서현", "G1", 0, {"CL": "B", "DA": "Y", "ML": "B", "DV": "GC"}], [1661, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "고하윤", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B", "DV": "G", "AU": "G"}], [1662, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "석지호", "G2", 1, {"DA": "Y", "PP": "B", "ML": "G", "AU": "GC"}], [1663, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "지채원", "G2", 0, {"CL": "G", "DA": "G", "ML": "G"}], [1664, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "곽선우", "G1", 0, {"CL": "G", "DA": "SC", "ML": "B"}], [1665, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "노채원", "G1", 0, {"CL": "B", "ML": "B"}], [1666, "정밀화학사업본부", "마임원", "정밀화학 구매팀 1", "길주아", "G2", 0, {"CL": "Y", "DA": "G", "ML": "B", "AU": "G"}], [1667, "DX센터", "심임원", "DX 혁신팀", "육지훈", "G1", 0, {"CL": "G", "DA": "B", "ML": "B", "DV": "G", "PE": "G"}], [1668, "DX센터", "심임원", "DX 혁신팀", "방주희", "G3", 0, {"ML": "G"}], [1669, "DX센터", "심임원", "DX 혁신팀", "반도윤", "G1", 0, {"CL": "G", "DA": "Y", "DV": "G", "PE": "G"}], [1670, "DX센터", "심임원", "DX 혁신팀", "김서준", "G2", 0, {"CL": "G", "DA": "G", "ML": "B"}], [1671, "DX센터", "심임원", "DX 혁신팀", "설주아", "G2", 0, {"DA": "G", "ML": "G", "AU": "GC"}], [1672, "DX센터", "심임원", "DX 혁신팀", "왕연우", "G1", 0, {"CL": "B", "ML": "G", "DV": "G"}], [1673, "DX센터", "심임원", "DX 혁신팀", "천서준", "G1", 0, {"CL": "B", "DA": "G", "ML": "G", "DV": "G"}], [1674, "DX센터", "심임원", "DX 혁신팀", "공시아", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "G"}], [1675, "DX센터", "심임원", "DX 혁신팀", "표민서", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B", "DV": "G", "PE": "SC"}], [1676, "DX센터", "심임원", "DX 혁신팀", "이우진", "G3", 0, {"CL": "G", "PP": "B", "ML": "Y"}], [1677, "DX센터", "심임원", "DX 혁신팀", "원아인", "G1", 0, {"CL": "B", "DA": "B", "DV": "G"}], [1678, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "신정우", "G3", 0, {"CL": "G", "DA": "G", "PP": "B", "ML": "B", "AU": "G"}], [1679, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "문채원", "G1", 0, {"ML": "B", "DV": "SC"}], [1680, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "기수아", "G3", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "B"}], [1681, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "진선우", "G2", 0, {"CL": "Y", "DA": "SC", "ML": "B", "AU": "G"}], [1682, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "조서진", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "B"}], [1683, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "표하윤", "G1", 0, {"CL": "B", "DA": "G", "DV": "G"}], [1684, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "현하준", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [1685, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "함서윤", "G1", 0, {"CL": "G", "DA": "G", "ML": "Y", "DV": "G"}], [1686, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "조해인", "G1", 0, {"CL": "G", "DA": "SC", "DV": "G"}], [1687, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "엄정현", "G2", 0, {"CL": "B", "DA": "B", "PP": "G", "ML": "GC", "AU": "B"}], [1688, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "남서현", "G2", 0, {"DA": "B", "ML": "SC"}], [1689, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "이광남", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B", "DV": "G", "AU": "G", "PE": "G"}], [1690, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "길민서", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "B", "ML": "G", "AU": "GC"}], [1691, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "심영태", "G1", 0, {"CL": "Y", "DA": "G", "DV": "SC", "PE": "B"}], [1692, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "임단아", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "B", "AU": "GC"}], [1693, "정밀화학사업본부", "심임원", "정밀화학 기획팀 2", "진건우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "GC"}], [1694, "경영지원센터", "심임원", "경영지원 생산팀", "문채원", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G"}], [1695, "경영지원센터", "심임원", "경영지원 생산팀", "최주원", "G2", 0, {"CL": "G", "DA": "G", "ML": "G", "AU": "G"}], [1696, "경영지원센터", "심임원", "경영지원 생산팀", "오단아", "G1", 0, {"CL": "Y", "DA": "B", "ML": "Y", "DV": "G"}], [1697, "경영지원센터", "심임원", "경영지원 생산팀", "민주희", "G2", 1, {"CL": "G", "DA": "B", "ML": "B"}], [1698, "경영지원센터", "심임원", "경영지원 생산팀", "문예준", "G3", 0, {"ML": "G"}], [1699, "경영지원센터", "심임원", "경영지원 생산팀", "조다은", "G1", 0, {"CL": "G", "DA": "G", "ML": "SC", "DV": "B"}], [1700, "경영지원센터", "심임원", "경영지원 생산팀", "윤시아", "G3", 0, {"CL": "G", "DA": "G", "PP": "Y", "ML": "B", "AU": "B"}], [1701, "경영지원센터", "심임원", "경영지원 생산팀", "옥지민", "G2", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "G", "DV": "GC", "AU": "G"}], [1702, "경영지원센터", "심임원", "경영지원 생산팀", "강건우", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B", "AU": "G"}], [1703, "경영지원센터", "심임원", "경영지원 생산팀", "전주희", "G3", 0, {"CL": "B", "PP": "G", "ML": "B", "DV": "B", "AU": "G"}], [1704, "경영지원센터", "심임원", "경영지원 생산팀", "가해인", "G2", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "SC"}], [1705, "경영지원센터", "심임원", "경영지원 생산팀", "원주희", "G3", 0, {"CL": "SC", "ML": "B", "AU": "G"}], [1706, "경영지원센터", "심임원", "경영지원 생산팀", "신서준", "G3", 0, {"CL": "Y", "PP": "G", "ML": "GC", "AU": "B"}], [1707, "경영지원센터", "심임원", "경영지원 생산팀", "문소율", "G2", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "AU": "Y"}], [1708, "경영지원센터", "심임원", "경영지원 생산팀", "위지호", "G1", 0, {"DS": "G", "CL": "G", "DA": "B", "ML": "G", "DV": "B", "AU": "GC", "PE": "G"}], [1709, "경영지원센터", "심임원", "경영지원 생산팀", "양주희", "G2", 0, {"CL": "Y", "DA": "G", "PP": "SC", "ML": "B"}], [1710, "경영지원센터", "심임원", "경영지원 생산팀", "오건우", "G1", 0, {"CL": "G", "DA": "G", "DV": "B", "PE": "B"}], [1711, "경영지원센터", "심임원", "경영지원 생산팀", "손윤서", "G3", 0, {"ML": "Y", "AU": "G"}], [1712, "경영지원센터", "심임원", "경영지원 생산팀", "최주아", "G1", 0, {"CL": "B", "DA": "B", "ML": "B", "DV": "B", "PE": "B"}], [1713, "경영지원센터", "심임원", "경영지원 생산팀", "위서준", "G2", 0, {"CL": "G", "DA": "SC", "ML": "G", "AU": "B"}], [1714, "경영지원센터", "심임원", "경영지원 생산팀", "엄은우", "G1", 0, {"CL": "Y", "DA": "Y", "DV": "G"}], [1715, "경영지원센터", "심임원", "경영지원 생산팀", "심서연", "G2", 1, {"DA": "G", "PP": "G", "ML": "G"}], [1716, "경영지원센터", "심임원", "경영지원 생산팀", "정영태", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "G", "DV": "G", "AU": "B"}], [1717, "경영지원센터", "심임원", "경영지원 생산팀", "유주아", "G1", 0, {"CL": "G", "DA": "B"}], [1718, "환경안전센터", "라임원", "환경안전 품질팀", "반지훈", "G2", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "G", "DV": "SC", "AU": "Y"}], [1719, "환경안전센터", "라임원", "환경안전 품질팀", "인정우", "G3", 0, {"CL": "SC", "ML": "B", "AU": "B"}], [1720, "환경안전센터", "라임원", "환경안전 품질팀", "진민서", "G1", 0, {"CL": "B", "DA": "G", "DV": "G"}], [1721, "환경안전센터", "라임원", "환경안전 품질팀", "오유찬", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "B"}], [1722, "환경안전센터", "라임원", "환경안전 품질팀", "천해인", "G2", 0, {"CL": "B", "DA": "G", "PP": "B", "ML": "B", "AU": "Y"}], [1723, "환경안전센터", "라임원", "환경안전 품질팀", "신준우", "G2", 0, {"CL": "Y", "DA": "B", "PP": "GC", "ML": "G", "AU": "G"}], [1724, "환경안전센터", "라임원", "환경안전 품질팀", "오도윤", "G1", 0, {"CL": "Y", "DA": "G", "ML": "G", "DV": "B"}], [1725, "환경안전센터", "라임원", "환경안전 품질팀", "윤단아", "G2", 1, {"CL": "G", "DA": "B", "ML": "B", "AU": "B"}], [1726, "환경안전센터", "라임원", "환경안전 품질팀", "진하윤", "G2", 0, {"CL": "B", "ML": "G"}], [1727, "환경안전센터", "라임원", "환경안전 품질팀", "명정우", "G1", 0, {"CL": "G", "DA": "Y", "ML": "G", "DV": "G", "PE": "G"}], [1728, "환경안전센터", "라임원", "환경안전 품질팀", "문서준", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "G", "DV": "B", "PE": "Y"}], [1729, "기초소재사업본부", "라임원", "기초소재 안전팀", "원준우", "G2", 0, {"CL": "Y", "DA": "B", "PP": "SC", "ML": "G", "AU": "G"}], [1730, "기초소재사업본부", "라임원", "기초소재 안전팀", "류지우", "G3", 0, {"CL": "G", "DA": "Y", "PP": "G", "ML": "SC", "DV": "G", "AU": "Y"}], [1731, "기초소재사업본부", "라임원", "기초소재 안전팀", "이지민", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G", "AU": "G"}], [1732, "기초소재사업본부", "라임원", "기초소재 안전팀", "우건우", "G3", 0, {"CL": "B", "DA": "Y", "PP": "G", "ML": "G", "AU": "Y"}], [1733, "기초소재사업본부", "라임원", "기초소재 안전팀", "엄서진", "G3", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "B", "DV": "B", "AU": "SC"}], [1734, "기초소재사업본부", "라임원", "기초소재 안전팀", "손서진", "G1", 0, {"DA": "G", "ML": "Y"}], [1735, "기초소재사업본부", "라임원", "기초소재 안전팀", "권건우", "G3", 0, {"CL": "Y", "ML": "G", "AU": "G"}], [1736, "기초소재사업본부", "라임원", "기초소재 안전팀", "정우진", "G3", 0, {"CL": "G", "DA": "B", "PP": "B", "ML": "B", "AU": "G"}], [1737, "기초소재사업본부", "라임원", "기초소재 안전팀", "현정현", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "AU": "GC"}], [1738, "기초소재사업본부", "라임원", "기초소재 안전팀", "고지아", "G3", 0, {"CL": "G", "PP": "Y", "ML": "Y", "DV": "G", "AU": "G"}], [1739, "기초소재사업본부", "라임원", "기초소재 안전팀", "하서준", "G2", 0, {"CL": "G", "DA": "G", "ML": "G", "AU": "B"}], [1740, "기초소재사업본부", "라임원", "기초소재 안전팀", "곽연우", "G3", 0, {"CL": "Y", "PP": "SC", "ML": "B", "AU": "G"}], [1741, "기초소재사업본부", "라임원", "기초소재 안전팀", "기지유", "G2", 0, {"CL": "G", "DA": "B", "PP": "G", "ML": "B", "AU": "G"}], [1742, "기초소재사업본부", "라임원", "기초소재 안전팀", "임준서", "G3", 0, {"CL": "B", "DA": "G", "PP": "Y", "ML": "G", "DV": "B", "AU": "SC", "PE": "G"}], [1743, "기초소재사업본부", "라임원", "기초소재 안전팀", "최하준", "G3", 0, {"CL": "G", "PP": "Y", "ML": "G", "DV": "SC", "AU": "B"}], [1744, "기초소재사업본부", "라임원", "기초소재 안전팀", "곽지아", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "B", "AU": "G"}], [1745, "기초소재사업본부", "라임원", "기초소재 안전팀", "염지아", "G1", 0, {"CL": "G", "DA": "G", "DV": "SC", "PE": "G"}], [1746, "기초소재사업본부", "라임원", "기초소재 안전팀", "서서연", "G2", 0, {"CL": "B", "DA": "SC", "PP": "B", "ML": "G", "AU": "SC"}], [1747, "기초소재사업본부", "라임원", "기초소재 안전팀", "금주희", "G1", 0, {"CL": "Y", "DA": "Y", "ML": "G", "DV": "SC"}], [1748, "기초소재사업본부", "라임원", "기초소재 안전팀", "엄지아", "G3", 0, {"CL": "G", "PP": "B", "ML": "SC", "AU": "B"}], [1749, "기초소재사업본부", "라임원", "기초소재 안전팀", "구미자", "G2", 0, {"DA": "GC", "ML": "G"}], [1750, "기초소재사업본부", "라임원", "기초소재 안전팀", "황하은", "G1", 0, {"CL": "Y", "DA": "B", "ML": "B", "PE": "G"}], [1751, "기초소재사업본부", "라임원", "기초소재 안전팀", "옥미자", "G2", 0, {"DA": "Y", "ML": "G", "AU": "G"}], [1752, "기초소재사업본부", "라임원", "기초소재 안전팀", "현지호", "G2", 0, {"DA": "Y", "ML": "B"}], [1753, "기초소재사업본부", "라임원", "기초소재 안전팀", "송주아", "G1", 0, {"CL": "G", "DA": "G", "DV": "G"}], [1754, "기초소재사업본부", "라임원", "기초소재 안전팀", "전수아", "G1", 0, {"CL": "Y", "DA": "G", "ML": "B"}], [1755, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "박주아", "G2", 1, {"CL": "Y", "DA": "B", "PP": "B", "ML": "B", "AU": "G"}], [1756, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "허도윤", "G1", 0, {"CL": "Y", "DA": "B", "ML": "G"}], [1757, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "조서준", "G2", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "G", "DV": "G", "AU": "B", "PE": "G"}], [1758, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "성하은", "G1", 0, {"CL": "G", "ML": "Y", "DV": "B", "PE": "G"}], [1759, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "반하윤", "G1", 0, {"CL": "G", "DA": "GC", "ML": "B", "DV": "G"}], [1760, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "최아인", "G2", 0, {"PP": "Y", "ML": "Y", "AU": "B"}], [1761, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "민시우", "G1", 0, {"DS": "Y", "CL": "B", "DA": "B", "ML": "B", "DV": "Y"}], [1762, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "정지호", "G2", 0, {"CL": "G", "DA": "G", "PP": "G", "ML": "G", "DV": "B", "AU": "B", "PE": "G"}], [1763, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "석단아", "G1", 0, {"CL": "G", "PE": "B"}], [1764, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "양도윤", "G3", 0, {"CL": "Y", "ML": "SC"}], [1765, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "강은우", "G1", 0, {"CL": "Y", "DA": "G", "ML": "SC", "DV": "G"}], [1766, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "현지훈", "G2", 0, {"DA": "Y", "ML": "Y", "AU": "SC"}], [1767, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "염예준", "G2", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "G", "AU": "GC", "PE": "G"}], [1768, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "남다은", "G3", 0, {"CL": "G", "PP": "Y", "ML": "G", "AU": "G"}], [1769, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "도시아", "G1", 0, {"CL": "B", "DA": "B"}], [1770, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "도다은", "G3", 0, {"CL": "Y", "DA": "Y", "PP": "G", "ML": "G", "DV": "G", "AU": "B"}], [1771, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "유시아", "G3", 0, {"CL": "B", "ML": "G"}], [1772, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "임선우", "G1", 0, {"CL": "G", "DA": "B", "ML": "SC", "DV": "G", "PE": "Y"}], [1773, "글로벌사업센터", "라임원", "글로벌사업 환경팀 3", "하하은", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "AU": "SC"}], [1774, "경영지원센터", "라임원", "경영지원 연구팀", "심윤서", "G2", 0, {"CL": "Y", "DA": "G", "PP": "GC", "ML": "B", "AU": "G"}], [1775, "경영지원센터", "라임원", "경영지원 연구팀", "마지아", "G2", 0, {"CL": "B", "DA": "G", "PP": "G", "ML": "B", "AU": "Y"}], [1776, "경영지원센터", "라임원", "경영지원 연구팀", "금민준", "G2", 0, {"CL": "B", "DA": "G", "ML": "B"}], [1777, "경영지원센터", "라임원", "경영지원 연구팀", "기윤서", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "B"}], [1778, "경영지원센터", "라임원", "경영지원 연구팀", "백준서", "G3", 0, {"CL": "Y", "DA": "G", "PP": "G", "ML": "G", "DV": "G", "AU": "G", "PE": "G"}], [1779, "경영지원센터", "라임원", "경영지원 연구팀", "정시아", "G2", 0, {"CL": "Y", "DA": "G", "PP": "B", "ML": "G"}], [1780, "경영지원센터", "라임원", "경영지원 연구팀", "손단아", "G2", 0, {"CL": "G", "DA": "G", "ML": "B"}], [1781, "경영지원센터", "라임원", "경영지원 연구팀", "채정우", "G3", 0, {"ML": "GC"}], [1782, "경영지원센터", "라임원", "경영지원 연구팀", "임주아", "G3", 0, {"CL": "G", "ML": "G", "AU": "SC"}], [1783, "경영지원센터", "라임원", "경영지원 연구팀", "양서준", "G2", 0, {"CL": "B", "DA": "G", "ML": "G"}], [1784, "경영지원센터", "라임원", "경영지원 연구팀", "원주아", "G3", 0, {"CL": "G", "PP": "G", "ML": "G", "AU": "B"}], [1785, "경영지원센터", "라임원", "경영지원 연구팀", "엄하윤", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "G", "DV": "B", "PE": "Y"}], [1786, "경영지원센터", "라임원", "경영지원 연구팀", "가단아", "G1", 0, {"CL": "Y", "DA": "G", "DV": "B"}], [1787, "경영지원센터", "라임원", "경영지원 연구팀", "금유찬", "G1", 0, {"CL": "G", "DA": "G", "ML": "SC", "DV": "GC"}], [1788, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "육소율", "G1", 0, {"CL": "G", "DA": "G", "ML": "Y", "PE": "G"}], [1789, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "심서연", "G2", 0, {"CL": "Y", "DA": "B", "ML": "SC", "AU": "G"}], [1790, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "지시아", "G3", 0, {"CL": "Y", "PP": "G", "ML": "B", "AU": "B"}], [1791, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "정나은", "G2", 0, {"CL": "G", "DA": "G", "PP": "SC", "ML": "G", "AU": "G"}], [1792, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "인나은", "G2", 1, {"CL": "Y", "DA": "B", "ML": "B", "AU": "B"}], [1793, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "여선우", "G2", 0, {"ML": "B"}], [1794, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "설민준", "G2", 0, {"DA": "G", "PP": "Y", "ML": "SC", "AU": "B"}], [1795, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "유민서", "G2", 0, {"CL": "Y", "DA": "G", "ML": "G"}], [1796, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "채지우", "G1", 0, {"DS": "Y", "CL": "G", "DA": "G", "ML": "G", "DV": "B", "PE": "G"}], [1797, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "설소율", "G1", 0, {"DS": "Y", "CL": "B", "DA": "Y", "ML": "B", "DV": "G", "PE": "B"}], [1798, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "옥준우", "G2", 0, {"CL": "Y", "DA": "B", "PP": "G", "ML": "B"}], [1799, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "유봄", "G3", 0, {"CL": "Y", "PP": "B", "ML": "G", "AU": "Y"}], [1800, "정밀화학사업본부", "라임원", "정밀화학 혁신팀 2", "표서연", "G3", 0, {"CL": "Y", "DA": "G", "ML": "G", "AU": "G"}]];

interface MissingBadge {
  badge: string;
  label: string;
  requiredTier: number;
  current: string;
  currentTier: number;
}

interface Employee {
  id: string;
  org: string;
  exec: string;
  team: string;
  name: string;
  rank: 'G1' | 'G2' | 'G3';
  isPromo: boolean;
  badges: Record<string, string>;
  passed: boolean;
  missingBadges: MissingBadge[];
  fulfilledCount: number;
  totalRequired: number;
  fulfillRate: number;
}

interface ExecutiveStat {
  exec: string;
  org: string;
  total: number;
  failedCount: number;
  passedCount: number;
  nonFulfillRate: number;
  promoCount: number;
  promoFailedCount: number;
}

interface PastEmail {
  id: string;
  targetType: 'executive' | 'employee' | 'offline_course';
  targetKey: string;
  recipientName: string;
  recipientEmail: string;
  date: string;
  subject: string;
  content: string;
  sender: string;
}

// 순차적 배지 수준 체계 (낮은 순 -> 높은 순):
// Tier 1: Y  (Yellow - 교육이수)
// Tier 2: G  (Green - 검증통과)
// Tier 3: B  (Black - 지도실행)
// Tier 4: SC (Silver Crown - 사외자격)
// Tier 5: GC (Gold Crown - 사내강사)
// * 상위 배지(예: SC/Tier 4)를 보유하면 하위 배지(Y/1, G/2, B/3)는 이미 모두 보유한 것으로 자동 충족됨.

const CRITERIA_MAP = {
  G1: [
    { badge: 'DS', minTier: 2, label: 'DS_G', name: 'Data Science (Green)' },
    { badge: 'CL', minTier: 2, label: 'CL_G', name: 'CL(Coding Literacy) (Green)' },
    { badge: 'DA', minTier: 2, label: 'DA_G', name: 'Data Analytics (Green)' },
    { badge: 'PE', minTier: 2, label: 'PE_G', name: 'Prompt Eng. (Green)' },
    { badge: 'DV', minTier: 2, label: 'DV_G', name: 'Data Visualization (Green)' },
  ],
  G2: [
    { badge: 'DA', minTier: 3, label: 'DA_B', name: 'Data Analytics (Black)' },
    { badge: 'PP', minTier: 2, label: 'PP_G', name: 'Python Prog. (Green)' },
    { badge: 'ML', minTier: 2, label: 'ML_G', name: 'Machine Learning (Green)' },
    { badge: 'AU', minTier: 3, label: 'AU_B', name: 'Automation (Black)' },
  ],
  G3: [
    { badge: 'ML', minTier: 3, label: 'ML_B', name: 'Machine Learning (Black)' },
    { badge: 'AU', minTier: 3, label: 'AU_B', name: 'Automation (Black)' },
    { badge: 'PP', minTier: 3, label: 'PP_B', name: 'Python Prog. (Black)' },
  ],
};

const ALL_BADGE_CODES = [
  { code: 'DS', name: 'Data Science (DS)' },
  { code: 'CL', name: 'CL(Coding Literacy)' },
  { code: 'DA', name: 'Data Analytics (DA)' },
  { code: 'PP', name: 'Python Programming (PP)' },
  { code: 'ML', name: 'Machine Learning (ML)' },
  { code: 'DV', name: 'Data Visualization (DV)' },
  { code: 'AU', name: 'Automation (AU)' },
  { code: 'PE', name: 'Prompt Engineering (PE)' },
  { code: 'TB', name: 'Tableau (TB)' },
  { code: 'DOE', name: 'DOE' },
];

// 순서대로 낮은 순 -> 높은 순: Y(1) -> G(2) -> B(3) -> SC(4) -> GC(5)
const TIER_LEVELS = [
  { val: 1, code: 'Y', name: 'Yellow(교육이수)' },
  { val: 2, code: 'G', name: 'Green(검증통과)' },
  { val: 3, code: 'B', name: 'Black(지도실행)' },
  { val: 4, code: 'SC', name: 'Silver Crown(사외자격)' },
  { val: 5, code: 'GC', name: 'Gold Crown(사내강사)' },
];

function getTierValue(code?: string): number {
  if (!code) return 0;
  const c = code.toUpperCase();
  if (c === 'Y') return 1;  // Yellow(교육이수)
  if (c === 'G') return 2;  // Green(검증통과)
  if (c === 'B') return 3;  // Black(지도실행)
  if (c === 'SC') return 4; // Silver Crown(사외자격)
  if (c === 'GC') return 5; // Gold Crown(사내강사)
  return 0;
}

function getTierName(tier: number): string {
  switch (tier) {
    case 1: return 'Yellow(교육이수)';
    case 2: return 'Green(검증통과)';
    case 3: return 'Black(지도실행)';
    case 4: return 'Silver Crown(사외자격)';
    case 5: return 'Gold Crown(사내강사)';
    default: return '미취득';
  }
}

function getPureTierName(tier: number): string {
  switch (tier) {
    case 1: return 'Yellow';
    case 2: return 'Green';
    case 3: return 'Black';
    case 4: return 'Silver Crown';
    case 5: return 'Gold Crown';
    default: return '미취득';
  }
}

function getTierBadgeClass(code?: string): string {
  if (!code) return 'bg-slate-100 text-slate-400 border border-slate-200';
  const c = code.toUpperCase();
  if (c === 'Y') return 'bg-amber-50 text-amber-700 border border-amber-200 font-medium';
  if (c === 'G') return 'bg-emerald-50 text-emerald-800 border border-emerald-300 font-semibold';
  if (c === 'B') return 'bg-slate-800 text-white border border-slate-700 font-medium';
  if (c === 'SC') return 'bg-sky-50 text-sky-800 border border-sky-300 font-semibold';
  if (c === 'GC') return 'bg-purple-50 text-purple-800 border border-purple-300 font-bold';
  return 'bg-slate-100 text-slate-500 border border-slate-200';
}

export default function App() {
  // Sync state
  const [syncTime, setSyncTime] = useState<string>('2026.10.10 01:45');
  const [isRefreshing, setIsRefreshing] = useState(false);
  const [toastMessage, setToastMessage] = useState<string | null>(null);

  // Filter & Search states
  const [execSearch, setExecSearch] = useState('');
  const [empSearch, setEmpSearch] = useState('');
  const [selectedExecRankTab, setSelectedExecRankTab] = useState<'all' | 'high_risk'>('all');
  const [empFilterMode, setEmpFilterMode] = useState<'all' | 'promo_only'>('all');
  const [selectedRankFilter, setSelectedRankFilter] = useState<'all' | 'G1' | 'G2' | 'G3'>('all');

  // Filter by missing badge and tier (e.g. badge=DS, tier=Green / 2)
  const [missingFilterBadge, setMissingFilterBadge] = useState<string>('all');
  const [missingFilterTier, setMissingFilterTier] = useState<number>(2); // Default Green(검증통과 / Tier 2)

  // Checkbox Selection states
  const [selectedExecs, setSelectedExecs] = useState<string[]>([]);
  const [selectedEmps, setSelectedEmps] = useState<string[]>([]);

  // Modals state
  const [activeExecModal, setActiveExecModal] = useState<ExecutiveStat | null>(null);
  const [activeEmpModal, setActiveEmpModal] = useState<Employee | null>(null);
  const [isBulkExecModalOpen, setIsBulkExecModalOpen] = useState(false);
  const [isBulkEmpModalOpen, setIsBulkEmpModalOpen] = useState(false);
  const [isOfflineCourseModalOpen, setIsOfflineCourseModalOpen] = useState(false);

  // Email Modal Internal Edit & History states
  const [isEditingExecEmail, setIsEditingExecEmail] = useState(false);
  const [execEmailSubject, setExecEmailSubject] = useState('');
  const [execEmailBody, setExecEmailBody] = useState('');
  const [showExecPastHistory, setShowExecPastHistory] = useState(false);

  const [isEditingEmpEmail, setIsEditingEmpEmail] = useState(false);
  const [empEmailSubject, setEmpEmailSubject] = useState('');
  const [empEmailBody, setEmpEmailBody] = useState('');
  const [showEmpPastHistory, setShowEmpPastHistory] = useState(false);

  // Offline course email state
  const [isEditingOfflineEmail, setIsEditingOfflineEmail] = useState(false);
  const [offlineEmailSubject, setOfflineEmailSubject] = useState('');
  const [offlineEmailBody, setOfflineEmailBody] = useState('');
  const [showOfflinePastHistory, setShowOfflinePastHistory] = useState(false);

  // Chart interactivity states
  const [hoveredPoint, setHoveredPoint] = useState<{
    month: string;
    rank: string;
    rate: number;
    passed: number;
    total: number;
    x: number;
    y: number;
    color: string;
  } | null>(null);
  const [selectedRankChartTab, setSelectedRankChartTab] = useState<'all' | 'G1' | 'G2' | 'G3'>('all');

  // Past Emails Repository
  const [pastEmails, setPastEmails] = useState<PastEmail[]>([
    {
      id: 'pe-01',
      targetType: 'executive',
      targetKey: '채임원',
      recipientName: '채임원',
      recipientEmail: 'chae.exec@company.com',
      date: '2026.04.15 09:30',
      subject: '[AXAGE 배지 지휘 요청] 1분기 진급 대상자 및 필수 배지 취득 현황 점검 안내',
      content: '채임원님, 구매물류센터 1분기 기준 필수 배지 미취득 인원에 대한 사전 지휘를 요청드립니다.\nAXAGE 에 대한 자세한 내용은 AXAGE 포털(https://test22-taupe-one.vercel.app/)을 참고하시기 바랍니다.',
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    },
    {
      id: 'pe-02',
      targetType: 'executive',
      targetKey: '채임원',
      recipientName: '채임원',
      recipientEmail: 'chae.exec@company.com',
      date: '2026.07.20 14:10',
      subject: '[AXAGE 배지 지휘 요청] 2분기 조직원 필수 배지 미충족 현황 및 멘토링 권고',
      content: '구매물류센터 진급대상자 중 DA 및 ML 배지 기준 미달 인원에 대해 집중 학습 지도를 부탁드립니다.\nAXAGE 에 대한 자세한 내용은 AXAGE 포털(https://test22-taupe-one.vercel.app/)을 참고하시기 바랍니다.',
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    },
    {
      id: 'pe-03',
      targetType: 'executive',
      targetKey: '박임원',
      recipientName: '박임원',
      recipientEmail: 'park.exec@company.com',
      date: '2026.05.10 11:00',
      subject: '[AXAGE 배지 지휘 요청] R&D 및 친환경소재 배지 취득 촉진 요청',
      content: '소속 인원 104명 중 필수 기준 미충족자 배지 취득 독려를 요청드립니다.',
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    },
    {
      id: 'pe-04',
      targetType: 'executive',
      targetKey: '명임원',
      recipientName: '명임원',
      recipientEmail: 'myeong.exec@company.com',
      date: '2026.08.18 10:25',
      subject: '[AXAGE 배지 지휘 요청] 하반기 진급 심사 대비 필수 배지 충족 지도 요청',
      content: '명임원님, 하반기 진급평가 대상자가 배지 미충족으로 누락되지 않도록 지도 부탁드립니다.\nAXAGE 에 대한 자세한 내용은 AXAGE 포털(https://test22-taupe-one.vercel.app/)을 참고하시기 바랍니다.',
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    },
    {
      id: 'pe-05',
      targetType: 'employee',
      targetKey: '신미자',
      recipientName: '신미자',
      recipientEmail: 'mija.shin@company.com',
      date: '2026.05.20 15:40',
      subject: '[AXAGE 배지 취득 권고] 신미자님, G1 필수 배지(DS, DA, DV) 취득 권고 안내',
      content: '신미자님, 진급 대상자로서 G1 승진 필수 요건인 DS_G, DA_G, DV_G 배지를 기한 내 취득하시기 바랍니다.\n배지 취득을 위한 신청은 AXAGE 아카데미 앱(https://test14-wyc8.vercel.app/)을 이용 바랍니다.',
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    },
    {
      id: 'pe-06',
      targetType: 'employee',
      targetKey: '노하윤',
      recipientName: '노하윤',
      recipientEmail: 'hayoon.noh@company.com',
      date: '2026.06.12 16:00',
      subject: '[AXAGE 배지 취득 권고] G2 승진 심사 대비 PP_G, ML_G 배지 취득 안내',
      content: '노하윤님, 현재 취득 현황 분석 결과 PP(Green), ML(Green) 배지의 보완이 필요합니다.\n배지 취득을 위한 신청은 AXAGE 아카데미 앱(https://test14-wyc8.vercel.app/)을 이용 바랍니다.',
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    },
    {
      id: 'pe-07',
      targetType: 'offline_course',
      targetKey: 'DS_Green',
      recipientName: 'DS_Green 미취득자 일동',
      recipientEmail: 'target-group@company.com',
      date: '2026.09.15 11:20',
      subject: '[AXAGE 오프라인 교육 개설 안내] DS(Green) 취득을 위한 오프라인 집중 과정 개설 안내',
      content: 'DS_Green 배지 미취득 인원을 대상으로 오프라인 실습 집중 과정이 개설되었습니다. 이번 기회를 놓치지 말고 꼭 신청해 주시기 바랍니다.',
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    }
  ]);

  // Toast trigger helper
  const showToast = (msg: string) => {
    setToastMessage(msg);
    setTimeout(() => {
      setToastMessage(null);
    }, 3200);
  };

  // 1. Process and compute employees with sequential criteria logic
  // (e.g. SC holders already fulfill Y, G, B)
  const processedEmployees: Employee[] = useMemo(() => {
    return RAW_EMPLOYEES.map(([idNum, org, exec, team, name, rankStr, isPromoNum, badges]) => {
      const rank = rankStr as 'G1' | 'G2' | 'G3';
      const isPromo = isPromoNum === 1;
      const reqs = CRITERIA_MAP[rank] || [];
      const missingBadges: MissingBadge[] = [];
      let fulfilledCount = 0;

      for (const req of reqs) {
        const currentVal = badges[req.badge] || '';
        const currentTier = getTierValue(currentVal);
        // Sequential check: if current tier >= req.minTier, fulfilled!
        if (currentTier >= req.minTier) {
          fulfilledCount++;
        } else {
          missingBadges.push({
            badge: req.badge,
            label: req.label,
            requiredTier: req.minTier,
            current: currentVal,
            currentTier,
          });
        }
      }

      const passed = missingBadges.length === 0;
      const fulfillRate = reqs.length > 0 ? (fulfilledCount / reqs.length) * 100 : 100;

      return {
        id: `emp-${idNum}`,
        org,
        exec,
        team,
        name,
        rank,
        isPromo,
        badges,
        passed,
        missingBadges,
        fulfilledCount,
        totalRequired: reqs.length,
        fulfillRate: Math.round(fulfillRate * 10) / 10,
      };
    });
  }, []);

  // 2. Executive statistics (Sorted by highest non-fulfillment rate descending)
  const executiveStats: ExecutiveStat[] = useMemo(() => {
    const map = new Map<string, { org: string; total: number; failed: number; promo: number; promoFailed: number }>();

    for (const emp of processedEmployees) {
      if (!map.has(emp.exec)) {
        map.set(emp.exec, { org: emp.org, total: 0, failed: 0, promo: 0, promoFailed: 0 });
      }
      const entry = map.get(emp.exec)!;
      entry.total++;
      if (!emp.passed) entry.failed++;
      if (emp.isPromo) {
        entry.promo++;
        if (!emp.passed) entry.promoFailed++;
      }
    }

    const list: ExecutiveStat[] = [];
    for (const [exec, data] of map.entries()) {
      const nonFulfillRate = data.total > 0 ? (data.failed / data.total) * 100 : 0;
      list.push({
        exec,
        org: data.org,
        total: data.total,
        failedCount: data.failed,
        passedCount: data.total - data.failed,
        nonFulfillRate: Math.round(nonFulfillRate * 10) / 10,
        promoCount: data.promo,
        promoFailedCount: data.promoFailed,
      });
    }

    // Sort descending by non-fulfillment rate
    return list.sort((a, b) => b.nonFulfillRate - a.nonFulfillRate);
  }, [processedEmployees]);

  // 3. Criteria Badges Acquisition Rate (Sorted ascending by lowest rate)
  const badgeRates = useMemo(() => {
    const criteriaItems = [
      { name: 'DS_G', badge: 'DS', tier: 2, rank: 'G1', tierName: 'Green', desc: 'G1 필수' },
      { name: 'PE_G', badge: 'PE', tier: 2, rank: 'G1', tierName: 'Green', desc: 'G1 필수' },
      { name: 'PP_G', badge: 'PP', tier: 2, rank: 'G2', tierName: 'Green', desc: 'G2 필수' },
      { name: 'CL_G', badge: 'CL', tier: 2, rank: 'G1', tierName: 'Green', desc: 'G1 필수' },
      { name: 'DA_G', badge: 'DA', tier: 2, rank: 'G1', tierName: 'Green', desc: 'G1 필수' },
      { name: 'DV_G', badge: 'DV', tier: 2, rank: 'G1', tierName: 'Green', desc: 'G1 필수' },
      { name: 'ML_G', badge: 'ML', tier: 2, rank: 'G2', tierName: 'Green', desc: 'G2 필수' },
      { name: 'PP_B', badge: 'PP', tier: 3, rank: 'G3', tierName: 'Black', desc: 'G3 필수' },
      { name: 'AU_B (G2)', badge: 'AU', tier: 3, rank: 'G2', tierName: 'Black', desc: 'G2 필수' },
      { name: 'DA_B', badge: 'DA', tier: 3, rank: 'G2', tierName: 'Black', desc: 'G2 필수' },
      { name: 'AU_B (G3)', badge: 'AU', tier: 3, rank: 'G3', tierName: 'Black', desc: 'G3 필수' },
      { name: 'ML_B', badge: 'ML', tier: 3, rank: 'G3', tierName: 'Black', desc: 'G3 필수' },
    ];

    return criteriaItems.map(item => {
      const targetEmps = processedEmployees.filter(e => e.rank === item.rank);
      const denom = targetEmps.length;
      // Sequential: holder with tier >= item.tier is counted as acquired
      const num = targetEmps.filter(e => getTierValue(e.badges[item.badge]) >= item.tier).length;
      const rate = denom > 0 ? (num / denom) * 100 : 0;
      return {
        ...item,
        num,
        denom,
        rate: Math.round(rate * 10) / 10,
      };
    }).sort((a, b) => a.rate - b.rate); // Low to high
  }, [processedEmployees]);

  // 4. Monthly Trend Data (Recent 6 months leading to current snapshot)
  const monthlyTrendData = useMemo(() => {
    const g1Current = processedEmployees.filter(e => e.rank === 'G1');
    const g2Current = processedEmployees.filter(e => e.rank === 'G2');
    const g3Current = processedEmployees.filter(e => e.rank === 'G3');

    const g1Rate = Math.round((g1Current.filter(e => e.passed).length / g1Current.length) * 1000) / 10;
    const g2Rate = Math.round((g2Current.filter(e => e.passed).length / g2Current.length) * 1000) / 10;
    const g3Rate = Math.round((g3Current.filter(e => e.passed).length / g3Current.length) * 1000) / 10;
    const totalRate = Math.round((processedEmployees.filter(e => e.passed).length / processedEmployees.length) * 1000) / 10;

    return [
      { month: '2026.05', g1: 1.1, g2: 1.5, g3: 1.3, total: 1.3, g1Passed: 6, g1Total: g1Current.length, g2Passed: 11, g2Total: g2Current.length, g3Passed: 7, g3Total: g3Current.length, totalPassed: 24, allTotal: processedEmployees.length },
      { month: '2026.06', g1: 1.8, g2: 2.3, g3: 2.1, total: 2.1, g1Passed: 10, g1Total: g1Current.length, g2Passed: 17, g2Total: g2Current.length, g3Passed: 11, g3Total: g3Current.length, totalPassed: 38, allTotal: processedEmployees.length },
      { month: '2026.07', g1: 2.6, g2: 3.2, g3: 3.0, total: 2.9, g1Passed: 14, g1Total: g1Current.length, g2Passed: 23, g2Total: g2Current.length, g3Passed: 16, g3Total: g3Current.length, totalPassed: 53, allTotal: processedEmployees.length },
      { month: '2026.08', g1: 3.5, g2: 4.0, g3: 3.8, total: 3.8, g1Passed: 19, g1Total: g1Current.length, g2Passed: 29, g2Total: g2Current.length, g3Passed: 20, g3Total: g3Current.length, totalPassed: 68, allTotal: processedEmployees.length },
      { month: '2026.09', g1: 4.3, g2: 4.7, g3: 4.7, total: 4.6, g1Passed: 23, g1Total: g1Current.length, g2Passed: 34, g2Total: g2Current.length, g3Passed: 25, g3Total: g3Current.length, totalPassed: 82, allTotal: processedEmployees.length },
      { month: '2026.10', g1: g1Rate, g2: g2Rate, g3: g3Rate, total: totalRate, g1Passed: g1Current.filter(e => e.passed).length, g1Total: g1Current.length, g2Passed: g2Current.filter(e => e.passed).length, g2Total: g2Current.length, g3Passed: g3Current.filter(e => e.passed).length, g3Total: g3Current.length, totalPassed: processedEmployees.filter(e => e.passed).length, allTotal: processedEmployees.length },
    ];
  }, [processedEmployees]);

  // 5. Unfulfilled Individuals List (Sorted with Promo First, then lowest rate)
  const unfulfilledEmployees = useMemo(() => {
    const list = processedEmployees.filter(e => !e.passed);
    return list.sort((a, b) => {
      // 1. Promotion candidates first (isPromo: true before false)
      if (a.isPromo && !b.isPromo) return -1;
      if (!a.isPromo && b.isPromo) return 1;
      // 2. Lower fulfillment rate first
      if (a.fulfillRate !== b.fulfillRate) return a.fulfillRate - b.fulfillRate;
      // 3. More missing badges first
      return b.missingBadges.length - a.missingBadges.length;
    });
  }, [processedEmployees]);

  // Filtered Unfulfilled Employees with Sequential Missing Badge Filter
  const filteredUnfulfilledEmployees = useMemo(() => {
    return unfulfilledEmployees.filter(emp => {
      if (empFilterMode === 'promo_only' && !emp.isPromo) return false;
      if (selectedRankFilter !== 'all' && emp.rank !== selectedRankFilter) return false;

      // Filter by specific missing badge and tier (e.g. badge=DS, tier=Green / 2)
      // If currentTier >= missingFilterTier, the user ALREADY possesses it, so do NOT show as missing!
      if (missingFilterBadge !== 'all') {
        const currentTier = getTierValue(emp.badges[missingFilterBadge]);
        if (currentTier >= missingFilterTier) {
          return false;
        }
      }

      if (empSearch.trim()) {
        const q = empSearch.trim().toLowerCase();
        const matchName = emp.name.toLowerCase().includes(q);
        const matchTeam = emp.team.toLowerCase().includes(q);
        const matchOrg = emp.org.toLowerCase().includes(q);
        const matchExec = emp.exec.toLowerCase().includes(q);
        return matchName || matchTeam || matchOrg || matchExec;
      }
      return true;
    });
  }, [unfulfilledEmployees, empFilterMode, selectedRankFilter, missingFilterBadge, missingFilterTier, empSearch]);

  // Filtered Executives
  const filteredExecutives = useMemo(() => {
    return executiveStats.filter(stat => {
      if (selectedExecRankTab === 'high_risk' && stat.nonFulfillRate < 85) return false;
      if (execSearch.trim()) {
        const q = execSearch.trim().toLowerCase();
        return stat.exec.toLowerCase().includes(q) || stat.org.toLowerCase().includes(q);
      }
      return true;
    });
  }, [executiveStats, selectedExecRankTab, execSearch]);

  // Handlers
  const handleRefresh = () => {
    setIsRefreshing(true);
    setTimeout(() => {
      const now = new Date();
      const formatted = `${now.getFullYear()}.${String(now.getMonth() + 1).padStart(2, '0')}.${String(now.getDate()).padStart(2, '0')} ${String(now.getHours()).padStart(2, '0')}:${String(now.getMinutes()).padStart(2, '0')}`;
      setSyncTime(formatted);
      setIsRefreshing(false);
      showToast('업데이트 완료되었습니다.');
    }, 650);
  };

  // Open Executive Modal
  const openExecutiveModal = (execStat: ExecutiveStat) => {
    setActiveExecModal(execStat);
    setShowExecPastHistory(false);
    setIsEditingExecEmail(false);

    const underEmps = unfulfilledEmployees.filter(e => e.exec === execStat.exec);
    const promoEmps = underEmps.filter(e => e.isPromo);
    const nonPromoEmps = underEmps.filter(e => !e.isPromo);

    const subject = `[AXAGE 배지 지휘 요청] ${execStat.org} ${execStat.exec}님, 소속 구성원 배지 기준 미충족(${execStat.failedCount}명) 지도 및 진급 대상자(${execStat.promoFailedCount}명) 관리 요청의 건`;
    
    let body = `안녕하십니까, ${execStat.exec}님.\nAX Innovation 센터 AXAGE 운영팀입니다.\n\n현재 인사시스템 분석 결과, ${execStat.org} 소속 구성원 ${execStat.total}명 중 ${execStat.failedCount}명(${execStat.nonFulfillRate}%)이 직급별 필수 배지 취득 기준을 충족하지 못하고 있습니다.\n(※ 배지 등급 체계는 Yellow → Green → Black → Silver Crown → Gold Crown 순차 승급으로 상위 배지 보유 시 하위 배지 자격이 누적 인정됩니다.)\n\n특히 '진급대상자'의 경우, 기한 내 필수 배지를 취득하지 못하면 회사 규정에 따라 진급 심사 명단에서 전원 자동 누락되는 중대한 불이익이 발생합니다. 각 임원께서 소속 구성원들이 기한을 놓치지 않고 배지를 취득할 수 있도록 적극적인 지휘와 독려를 부탁드립니다.\n\n=========================================\n[중점지휘 대상자 명단 (${promoEmps.length}명)]\n=========================================\n`;

    if (promoEmps.length === 0) {
      body += `(현재 소속 진급대상자 중 미충족 인원 없음)\n`;
    } else {
      promoEmps.forEach((e, idx) => {
        const missingList = e.missingBadges.map(m => `${m.label}(현재: ${m.current ? getTierName(m.currentTier) : '미취득'})`).join(', ');
        body += `${idx + 1}. [중점지휘 대상자] ${e.name} (${e.rank} / ${e.team}) - 충족율: ${e.fulfillRate}%\n   ▶ 추가 취득 요구 배지: ${missingList}\n`;
      });
    }

    body += `\n=========================================\n[일반 구성원 배지 미충족 명단 (${nonPromoEmps.length}명, 취득율 낮은 순)]\n=========================================\n`;
    nonPromoEmps.slice(0, 15).forEach((e, idx) => {
      const missingList = e.missingBadges.map(m => `${m.label}(현재: ${m.current ? getTierName(m.currentTier) : '미취득'})`).join(', ');
      body += `${idx + 1}. ${e.name} (${e.rank} / ${e.team}) - 충족율: ${e.fulfillRate}%\n   ▶ 추가 취득 요구 배지: ${missingList}\n`;
    });
    if (nonPromoEmps.length > 15) {
      body += `... 외 ${nonPromoEmps.length - 15}명 (상세 대시보드 참고)\n`;
    }

    body += `\n조직원들의 역량 강화 및 원활한 승진 심사를 위해 임원님의 각별한 관심과 독려를 부탁드립니다.\n\n※ AXAGE 에 대한 자세한 내용은 AXAGE 포털을 참고하시기 바랍니다.\n( https://test22-taupe-one.vercel.app/ )\n\n감사합니다.\n\nAXAGE 운영팀 드림`;

    setExecEmailSubject(subject);
    setExecEmailBody(body);
  };

  // Open Individual Employee Modal
  const openEmployeeModal = (emp: Employee) => {
    setActiveEmpModal(emp);
    setShowEmpPastHistory(false);
    setIsEditingEmpEmail(false);

    const subject = `[AXAGE 배지 취득 권고] ${emp.name}님, ${emp.rank} 직급 필수 배지 취득 기준 충족 및 ${emp.isPromo ? '진급 대상자 우선 지원' : '역량 인증'} 안내`;
    
    let body = `안녕하십니까, ${emp.name}님 (${emp.team} / ${emp.rank}).\nAX Innovation 센터 AXAGE 운영팀입니다.\n\n현재 인사시스템 기준, ${emp.name}님의 ${emp.rank} 직급 필수 배지 충족율은 ${emp.fulfillRate}% (${emp.fulfilledCount}/${emp.totalRequired}개 취득)로 필수 기준에 미달하고 있습니다.\n`;

    if (emp.isPromo) {
      body += `\n★ [중요 경고: 중점지휘 대상자 필수 안내] ★\n${emp.name}님은 올해 '진급 대상자'입니다. 회사 인사 규정상 필수 배지 기준을 충족하지 못하면 진급 심사 명단에서 사전 누락되어 불이익을 받게 됩니다. 반드시 정기 승진 심사 전까지 부족한 배지를 취득하시기 바랍니다.\n`;
    }

    body += `\n[필수 배지 기준 대비 본인 취득 현황 및 부족 배지]\n`;
    const reqs = CRITERIA_MAP[emp.rank] || [];
    reqs.forEach((r, idx) => {
      const current = emp.badges[r.badge] || '';
      const currentTier = getTierValue(current);
      const isMet = currentTier >= r.minTier;
      body += `${idx + 1}. ${r.name} (${r.label}) : [현재: ${current ? getPureTierName(currentTier) : '미취득'}] → ${isMet ? '✔ 획득' : '❌ 미획득'}\n`;
    });

    body += `\n[배지 취득 신청 안내]\n배지 취득을 위한 신청은 AXAGE 아카데미 앱을 이용 바랍니다.\n( https://test14-wyc8.vercel.app/ )\n\n시기를 놓치지 않고 취득하시어 불이익이 없으시길 바랍니다.\n감사합니다.\n\n- 소속 임원: ${emp.exec} (참조)\n- AX Innovation 센터 AXAGE 운영팀 드림`;

    setEmpEmailSubject(subject);
    setEmpEmailBody(body);
  };

  // Open Offline Course Announcement Modal (for filtered missing badge employees)
  const openOfflineCourseModal = () => {
    setIsOfflineCourseModalOpen(true);
    setShowOfflinePastHistory(false);
    setIsEditingOfflineEmail(false);

    const badgeObj = ALL_BADGE_CODES.find(b => b.code === missingFilterBadge);
    const badgeName = badgeObj ? badgeObj.name : missingFilterBadge;
    const tierName = getTierName(missingFilterTier);
    const targetLabel = `${missingFilterBadge}_${tierName}`;

    const targetList = selectedEmps.length > 0 
      ? filteredUnfulfilledEmployees.filter(e => selectedEmps.includes(e.id))
      : filteredUnfulfilledEmployees;

    const subject = `[AXAGE 오프라인 교육 개설 안내] ${targetLabel} 배지 취득을 위한 오프라인 집중 과정 개설 및 수강 신청 안내`;
    
    let body = `안녕하십니까, 임직원 여러분.\nAX Innovation 센터 AXAGE 운영팀입니다.\n\n임직원 여러분의 실무 역량 강화와 필수 배지 취득을 지원하기 위해, \n【${badgeName} (${tierName}) 오프라인 집중 실습 과정】이 신규 개설되었습니다.\n\n현재 본 과정은 ${targetLabel} 배지를 아직 취득하지 못하신 분들을 대상으로 현업 전문 강사진의 집중 코칭과 함께 진행됩니다. 배지 기준 미충족에 따른 평가 및 진급 상의 불이익을 방지하고 역량을 한 단계 도약시킬 수 있는 기회이오니, 이번 기회를 놓치지 마시고 꼭 신청하시어 배지를 취득하시기 바랍니다.\n\n■ 교육 과정명: [오프라인 집중 과정] ${badgeName} (${tierName}) 달성 마스터 클래스\n■ 교육 대상: ${targetLabel} 미취득자 (${targetList.length}명 대상 추천)\n■ 교육일정: 1. 2027년 5월 13일(목) 오전 10시 ~ 오후 4시\n■ 교육 장소: AX Innovation 센터 본관 4층 멀티미디어 실습실\n■ 혜택: 이수 시 실습 과제 평가를 통한 ${targetLabel} 공식 인증 부여\n\n배지 취득을 위한 신청은 AXAGE 아카데미 앱을 이용 바랍니다.\n( https://test14-wyc8.vercel.app/ )\n\n정원 마감 전 서둘러 신청해 주시기 바랍니다.\n감사합니다.\n\nAX Innovation 센터 AXAGE 운영팀 드림`;

    setOfflineEmailSubject(subject);
    setOfflineEmailBody(body);
  };

  // Send Executive Email
  const handleSendExecEmail = () => {
    if (!activeExecModal) return;
    const newEntry: PastEmail = {
      id: `pe-${Date.now()}`,
      targetType: 'executive',
      targetKey: activeExecModal.exec,
      recipientName: activeExecModal.exec,
      recipientEmail: `${activeExecModal.exec.replace('임원', '')}.exec@company.com`,
      date: new Date().toISOString().replace('T', ' ').substring(0, 16).replace(/-/g, '.'),
      subject: execEmailSubject,
      content: execEmailBody,
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    };
    setPastEmails(prev => [newEntry, ...prev]);
    setActiveExecModal(null);
    showToast('이메일이 발송되었습니다.');
  };

  // Send Employee Email
  const handleSendEmpEmail = () => {
    if (!activeEmpModal) return;
    const newEntry: PastEmail = {
      id: `pe-${Date.now()}`,
      targetType: 'employee',
      targetKey: activeEmpModal.name,
      recipientName: activeEmpModal.name,
      recipientEmail: `${activeEmpModal.name}@company.com`,
      date: new Date().toISOString().replace('T', ' ').substring(0, 16).replace(/-/g, '.'),
      subject: empEmailSubject,
      content: empEmailBody,
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    };
    setPastEmails(prev => [newEntry, ...prev]);
    setActiveEmpModal(null);
    showToast('이메일이 발송되었습니다.');
  };

  // Send Offline Course Email
  const handleSendOfflineEmail = () => {
    const targetLabel = `${missingFilterBadge}_${getTierName(missingFilterTier)}`;
    const newEntry: PastEmail = {
      id: `pe-offline-${Date.now()}`,
      targetType: 'offline_course',
      targetKey: targetLabel,
      recipientName: `${targetLabel} 미취득자`,
      recipientEmail: 'target-group@company.com',
      date: new Date().toISOString().replace('T', ' ').substring(0, 16).replace(/-/g, '.'),
      subject: offlineEmailSubject,
      content: offlineEmailBody,
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    };
    setPastEmails(prev => [newEntry, ...prev]);
    setIsOfflineCourseModalOpen(false);
    setSelectedEmps([]);
    showToast('오프라인 교육 안내 이메일이 발송되었습니다.');
  };

  // Bulk Actions
  const handleSelectAllExecs = () => {
    if (selectedExecs.length === filteredExecutives.length) {
      setSelectedExecs([]);
    } else {
      setSelectedExecs(filteredExecutives.map(e => e.exec));
    }
  };

  const handleSelectAllEmps = () => {
    if (selectedEmps.length === filteredUnfulfilledEmployees.length) {
      setSelectedEmps([]);
    } else {
      setSelectedEmps(filteredUnfulfilledEmployees.map(e => e.id));
    }
  };

  const handleSelectOnlyPromoEmps = () => {
    const promoIds = filteredUnfulfilledEmployees.filter(e => e.isPromo).map(e => e.id);
    setSelectedEmps(promoIds);
    showToast(`중점지휘 대상자 ${promoIds.length}명이 선택되었습니다.`);
  };

  const handleBulkSendExecs = () => {
    if (selectedExecs.length === 0) return;
    const nowStr = new Date().toISOString().replace('T', ' ').substring(0, 16).replace(/-/g, '.');
    const newEntries: PastEmail[] = selectedExecs.map((execName, idx) => ({
      id: `pe-bulk-exec-${Date.now()}-${idx}`,
      targetType: 'executive',
      targetKey: execName,
      recipientName: execName,
      recipientEmail: `${execName.replace('임원', '')}.exec@company.com`,
      date: nowStr,
      subject: `[AXAGE 배지 지휘 요청] ${execName}님 소속 부서 배지 기준 충족 및 진급대상자 관리 안내`,
      content: `임원님 소속 조직의 배지 미충족 구성원 대상 지휘를 일괄 요청드립니다.\nAXAGE 에 대한 자세한 내용은 AXAGE 포털(https://test22-taupe-one.vercel.app/)을 참고하시기 바랍니다.`,
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    }));
    setPastEmails(prev => [...newEntries, ...prev]);
    setIsBulkExecModalOpen(false);
    setSelectedExecs([]);
    showToast('이메일이 발송되었습니다.');
  };

  const handleBulkSendEmps = () => {
    if (selectedEmps.length === 0) return;
    const nowStr = new Date().toISOString().replace('T', ' ').substring(0, 16).replace(/-/g, '.');
    const targetEmps = processedEmployees.filter(e => selectedEmps.includes(e.id));
    const newEntries: PastEmail[] = targetEmps.map((emp, idx) => ({
      id: `pe-bulk-emp-${Date.now()}-${idx}`,
      targetType: 'employee',
      targetKey: emp.name,
      recipientName: emp.name,
      recipientEmail: `${emp.name}@company.com`,
      date: nowStr,
      subject: `[AXAGE 배지 취득 권고] ${emp.name}님, ${emp.rank} 필수 배지 취득 기준 충족 안내`,
      content: `필수 배지 취득 기준 미충족에 따른 취득 권고 안내입니다.\n배지 취득을 위한 신청은 AXAGE 아카데미 앱(https://test14-wyc8.vercel.app/)을 이용 바랍니다.`,
      sender: 'AX Innovation 센터 AXAGE 운영팀'
    }));
    setPastEmails(prev => [...newEntries, ...prev]);
    setIsBulkEmpModalOpen(false);
    setSelectedEmps([]);
    showToast('이메일이 발송되었습니다.');
  };

  // Past Emails for selected target
  const execPastList = useMemo(() => {
    if (!activeExecModal) return [];
    return pastEmails.filter(p => p.targetType === 'executive' && p.targetKey === activeExecModal.exec);
  }, [activeExecModal, pastEmails]);

  const empPastList = useMemo(() => {
    if (!activeEmpModal) return [];
    return pastEmails.filter(p => p.targetType === 'employee' && p.targetKey === activeEmpModal.name);
  }, [activeEmpModal, pastEmails]);

  const offlinePastList = useMemo(() => {
    const targetKey = `${missingFilterBadge}_${getTierName(missingFilterTier)}`;
    return pastEmails.filter(p => p.targetType === 'offline_course' && p.targetKey === targetKey);
  }, [missingFilterBadge, missingFilterTier, pastEmails]);

  // Overall counts
  const totalEmployeesCount = processedEmployees.length;
  const passedEmployeesCount = processedEmployees.filter(e => e.passed).length;
  const overallPassRate = Math.round((passedEmployeesCount / totalEmployeesCount) * 1000) / 10;
  const promoTotal = processedEmployees.filter(e => e.isPromo).length;
  const promoFailedTotal = processedEmployees.filter(e => e.isPromo && !e.passed).length;

  return (
    <div className="min-h-screen bg-slate-50/70 text-slate-900 pb-16 font-sans">
      {/* Toast Notification */}
      {toastMessage && (
        <div className="fixed top-5 right-6 z-50 flex items-center gap-3 px-5 py-3.5 bg-slate-900 text-white rounded-xl shadow-xl border border-slate-700 animate-in fade-in slide-in-from-top-4 duration-200">
          <CheckCircle className="w-5 h-5 text-emerald-400 shrink-0" />
          <span className="text-sm font-medium">{toastMessage}</span>
        </div>
      )}

      {/* Top Bar Header */}
      <header className="sticky top-0 z-40 bg-white/95 backdrop-blur-md border-b border-slate-200/90 shadow-2xs">
        <div className="max-w-7xl mx-auto px-4 sm:px-6 lg:px-8 py-3.5 flex items-center justify-between gap-6">
          <div className="flex items-center gap-3 shrink-0">
            <div className="w-9 h-9 rounded-lg bg-indigo-600 flex items-center justify-center text-white font-bold text-lg shadow-sm">
              AX
            </div>
            <div>
              <div className="flex items-center gap-2">
                <h1 className="text-lg font-bold text-slate-900 tracking-tight">AXAGE 매니징 시스템</h1>
              </div>
              <p className="text-xs text-slate-500 hidden sm:block">
                임원 조직원 직급별 필수 배지 취득 모니터링 & 진급 대상자 집중 지휘
              </p>
            </div>
          </div>

          <div className="flex items-center gap-4 shrink-0">
            <div className="hidden lg:flex items-center gap-2 text-xs text-slate-500">
              <span className="inline-block w-2 h-2 rounded-full bg-emerald-500" />
              <span>인사시스템 연동 정상</span>
              <span className="text-slate-300">|</span>
              <span className="font-mono tabular-nums text-slate-600">동기화: {syncTime}</span>
            </div>

            <button
              onClick={handleRefresh}
              disabled={isRefreshing}
              className="inline-flex items-center gap-2 px-3.5 py-2 text-xs font-semibold text-white bg-slate-900 hover:bg-slate-800 active:scale-97 rounded-lg transition-all shadow-xs cursor-pointer disabled:opacity-70"
            >
              <RefreshCw className={`w-3.5 h-3.5 ${isRefreshing ? 'animate-spin' : ''}`} />
              <span>배지정보 새로고침</span>
            </button>
          </div>
        </div>
      </header>

      <main className="max-w-7xl mx-auto px-4 sm:px-6 lg:px-8 pt-6 space-y-6">
        {/* KPI Strip */}
        <section className="grid grid-cols-2 lg:grid-cols-4 gap-4">
          <div className="bg-white p-4 rounded-xl border border-slate-200/80 shadow-2xs">
            <div className="text-xs font-medium text-slate-500 mb-1 flex items-center justify-between">
              <span>전사 임직원</span>
              <Users className="w-4 h-4 text-slate-400" />
            </div>
            <div className="text-2xl font-bold tracking-tight text-slate-900 font-mono tabular-nums">
              {totalEmployeesCount.toLocaleString()}
              <span className="text-xs font-normal text-slate-500 ml-1">명</span>
            </div>
            <div className="mt-1.5 text-xs text-slate-500 flex items-center gap-1.5">
              <span>G1: 541명</span> · <span>G2: 728명</span> · <span>G3: 531명</span>
            </div>
          </div>

          <div className="bg-white p-4 rounded-xl border border-rose-200/90 bg-gradient-to-br from-white to-rose-50/40 shadow-2xs">
            <div className="text-xs font-medium text-rose-700 mb-1 flex items-center justify-between">
              <span className="font-semibold">진급 대상자 우선 지원</span>
              <AlertTriangle className="w-4 h-4 text-rose-500" />
            </div>
            <div className="text-2xl font-bold tracking-tight text-rose-600 font-mono tabular-nums">
              {promoFailedTotal}
              <span className="text-xs font-normal text-rose-600/80 ml-1">명 미충족 / {promoTotal}명</span>
            </div>
            <div className="mt-1.5 text-xs font-medium text-rose-600">
              미취득 배지 우선 취득 지원
            </div>
          </div>

          <div className="bg-white p-4 rounded-xl border border-slate-200/80 shadow-2xs">
            <div className="text-xs font-medium text-slate-500 mb-1 flex items-center justify-between">
              <span>전사 배지 기준 충족율</span>
              <Award className="w-4 h-4 text-indigo-500" />
            </div>
            <div className="text-2xl font-bold tracking-tight text-slate-900 font-mono tabular-nums">
              {overallPassRate}%
              <span className="text-xs font-normal text-slate-500 ml-1">({passedEmployeesCount}/{totalEmployeesCount}명)</span>
            </div>
            <div className="mt-1.5 text-xs text-slate-500 flex items-center gap-1.5">
              <span>미충족 {(totalEmployeesCount - passedEmployeesCount).toLocaleString()}명 (지휘 관리 대상)</span>
            </div>
          </div>

          <div className="bg-white p-4 rounded-xl border border-slate-200/80 shadow-2xs">
            <div className="text-xs font-medium text-slate-500 mb-1 flex items-center justify-between">
              <span>총괄 임원 관리 조직</span>
              <User className="w-4 h-4 text-slate-400" />
            </div>
            <div className="text-2xl font-bold tracking-tight text-slate-900 font-mono tabular-nums">
              24
              <span className="text-xs font-normal text-slate-500 ml-1">개 조직</span>
            </div>
            <div className="mt-1.5 text-xs text-amber-700 font-medium">
              미충족 비중 85% 이상 24개 조직 우선 지휘
            </div>
          </div>
        </section>

        {/* Top Charts Row: (Left) Monthly Fulfillment Trend by Rank, (Right) Required Badge Rates */}
        <section className="grid grid-cols-1 lg:grid-cols-2 gap-6">
          {/* Top Left: Monthly Trend Chart */}
          <div className="bg-white rounded-xl p-5 border border-slate-200/90 shadow-2xs flex flex-col justify-between relative">
            <div>
              <div className="flex items-start justify-between gap-4 mb-2">
                <div>
                  <h2 className="text-base font-bold text-slate-900 flex items-center gap-2">
                    <TrendingUp className="w-4 h-4 text-indigo-600" />
                    직급별 배지 기준 충족율 월별 추이
                  </h2>
                  <p className="text-xs text-slate-500 mt-0.5">
                    산식: (직급별 배지 취득 성공 인원 / 직급별 인원수) × 100% (누적 승급 반영)
                  </p>
                </div>
                <div className="flex items-center gap-1 bg-slate-100 p-0.5 rounded-lg text-xs font-medium shrink-0">
                  {(['all', 'G1', 'G2', 'G3'] as const).map(tab => (
                    <button
                      key={tab}
                      onClick={() => setSelectedRankChartTab(tab)}
                      className={`px-2 py-1 rounded-md transition-colors cursor-pointer ${
                        selectedRankChartTab === tab ? 'bg-white text-slate-900 shadow-2xs font-semibold' : 'text-slate-600 hover:text-slate-900'
                      }`}
                    >
                      {tab === 'all' ? '전체' : tab}
                    </button>
                  ))}
                </div>
              </div>

              {/* Legend & Current Snapshots */}
              <div className="grid grid-cols-4 gap-2 my-3 p-2.5 bg-slate-50/80 rounded-lg text-xs">
                <div className="text-center border-r border-slate-200">
                  <span className="text-slate-500 block">전사 전체</span>
                  <span className="font-bold text-slate-900 font-mono tabular-nums">
                    {monthlyTrendData[5].total}%
                  </span>
                </div>
                <div className="text-center border-r border-slate-200">
                  <span className="text-rose-600 font-semibold block">G1</span>
                  <span className="font-bold text-rose-700 font-mono tabular-nums">
                    {monthlyTrendData[5].g1}% <span className="text-2xs font-normal">({monthlyTrendData[5].g1Passed}/541)</span>
                  </span>
                </div>
                <div className="text-center border-r border-slate-200">
                  <span className="text-amber-600 font-semibold block">G2</span>
                  <span className="font-bold text-amber-700 font-mono tabular-nums">
                    {monthlyTrendData[5].g2}% <span className="text-2xs font-normal">({monthlyTrendData[5].g2Passed}/728)</span>
                  </span>
                </div>
                <div className="text-center">
                  <span className="text-emerald-600 font-semibold block">G3</span>
                  <span className="font-bold text-emerald-700 font-mono tabular-nums">
                    {monthlyTrendData[5].g3}% <span className="text-2xs font-normal">({monthlyTrendData[5].g3Passed}/531)</span>
                  </span>
                </div>
              </div>

              {/* Interactive SVG Line Graph with Enhanced Hover Tooltips (Scale: 0% - 8%) */}
              <div className="relative h-52 w-full mt-2">
                <svg viewBox="0 0 500 200" className="w-full h-full overflow-visible">
                  {/* Grid lines (0% to 8% to fit actual 1%~6% data) */}
                  {[0, 2, 4, 6, 8].map((val, idx) => {
                    const y = 180 - (val / 8) * 155;
                    return (
                      <g key={idx}>
                        <line x1="40" y1={y} x2="480" y2={y} stroke="#e2e8f0" strokeDasharray="3 3" />
                        <text x="32" y={y + 4} textAnchor="end" className="text-2xs fill-slate-400 font-mono font-medium">
                          {val}%
                        </text>
                      </g>
                    );
                  })}

                  {/* Vertical guide line when hovered */}
                  {hoveredPoint && (
                    <line
                      x1={hoveredPoint.x}
                      y1="20"
                      x2={hoveredPoint.x}
                      y2="180"
                      stroke="#94a3b8"
                      strokeWidth="1.5"
                      strokeDasharray="3 3"
                    />
                  )}

                  {/* Total Line (Blue) */}
                  {(selectedRankChartTab === 'all') && (
                    <polyline
                      fill="none"
                      stroke="#4f46e5"
                      strokeWidth="2.5"
                      points={monthlyTrendData.map((d, i) => `${60 + i * 80},${180 - (d.total / 8) * 155}`).join(' ')}
                    />
                  )}

                  {/* G3 Line (Green) */}
                  {(selectedRankChartTab === 'all' || selectedRankChartTab === 'G3') && (
                    <polyline
                      fill="none"
                      stroke="#10b981"
                      strokeWidth="2.5"
                      points={monthlyTrendData.map((d, i) => `${60 + i * 80},${180 - (d.g3 / 8) * 155}`).join(' ')}
                    />
                  )}

                  {/* G2 Line (Amber) */}
                  {(selectedRankChartTab === 'all' || selectedRankChartTab === 'G2') && (
                    <polyline
                      fill="none"
                      stroke="#f59e0b"
                      strokeWidth="2.5"
                      points={monthlyTrendData.map((d, i) => `${60 + i * 80},${180 - (d.g2 / 8) * 155}`).join(' ')}
                    />
                  )}

                  {/* G1 Line (Rose) */}
                  {(selectedRankChartTab === 'all' || selectedRankChartTab === 'G1') && (
                    <polyline
                      fill="none"
                      stroke="#e11d48"
                      strokeWidth="2.5"
                      points={monthlyTrendData.map((d, i) => `${60 + i * 80},${180 - (d.g1 / 8) * 155}`).join(' ')}
                    />
                  )}

                  {/* Interactive Data Points with Hover Handlers */}
                  {monthlyTrendData.map((d, i) => {
                    const x = 60 + i * 80;
                    return (
                      <g key={i}>
                        {/* Month text label */}
                        <text x={x} y="196" textAnchor="middle" className="text-2xs fill-slate-500 font-mono">
                          {d.month.split('.')[1]}월
                        </text>

                        {/* G3 Point */}
                        {(selectedRankChartTab === 'all' || selectedRankChartTab === 'G3') && (
                          <circle
                            cx={x}
                            cy={180 - (d.g3 / 8) * 155}
                            r={hoveredPoint?.rank === 'G3' && hoveredPoint?.month === d.month ? 7 : 4}
                            className="fill-emerald-500 stroke-white stroke-2 cursor-pointer transition-all duration-150"
                            onMouseEnter={() => setHoveredPoint({
                              month: d.month,
                              rank: 'G3',
                              rate: d.g3,
                              passed: d.g3Passed,
                              total: d.g3Total,
                              x,
                              y: 180 - (d.g3 / 8) * 155,
                              color: 'text-emerald-600'
                            })}
                            onMouseLeave={() => setHoveredPoint(null)}
                          />
                        )}

                        {/* G2 Point */}
                        {(selectedRankChartTab === 'all' || selectedRankChartTab === 'G2') && (
                          <circle
                            cx={x}
                            cy={180 - (d.g2 / 8) * 155}
                            r={hoveredPoint?.rank === 'G2' && hoveredPoint?.month === d.month ? 7 : 4}
                            className="fill-amber-500 stroke-white stroke-2 cursor-pointer transition-all duration-150"
                            onMouseEnter={() => setHoveredPoint({
                              month: d.month,
                              rank: 'G2',
                              rate: d.g2,
                              passed: d.g2Passed,
                              total: d.g2Total,
                              x,
                              y: 180 - (d.g2 / 8) * 155,
                              color: 'text-amber-600'
                            })}
                            onMouseLeave={() => setHoveredPoint(null)}
                          />
                        )}

                        {/* G1 Point */}
                        {(selectedRankChartTab === 'all' || selectedRankChartTab === 'G1') && (
                          <circle
                            cx={x}
                            cy={180 - (d.g1 / 8) * 155}
                            r={hoveredPoint?.rank === 'G1' && hoveredPoint?.month === d.month ? 7 : 4}
                            className="fill-rose-500 stroke-white stroke-2 cursor-pointer transition-all duration-150"
                            onMouseEnter={() => setHoveredPoint({
                              month: d.month,
                              rank: 'G1',
                              rate: d.g1,
                              passed: d.g1Passed,
                              total: d.g1Total,
                              x,
                              y: 180 - (d.g1 / 8) * 155,
                              color: 'text-rose-600'
                            })}
                            onMouseLeave={() => setHoveredPoint(null)}
                          />
                        )}

                        {/* Total Point */}
                        {selectedRankChartTab === 'all' && (
                          <circle
                            cx={x}
                            cy={180 - (d.total / 8) * 155}
                            r={hoveredPoint?.rank === '전체' && hoveredPoint?.month === d.month ? 7 : 4.5}
                            className="fill-indigo-600 stroke-white stroke-2 cursor-pointer transition-all duration-150"
                            onMouseEnter={() => setHoveredPoint({
                              month: d.month,
                              rank: '전체',
                              rate: d.total,
                              passed: d.totalPassed,
                              total: d.allTotal,
                              x,
                              y: 180 - (d.total / 8) * 155,
                              color: 'text-indigo-600'
                            })}
                            onMouseLeave={() => setHoveredPoint(null)}
                          />
                        )}
                      </g>
                    );
                  })}
                </svg>

                {/* Floating Tooltip Box */}
                {hoveredPoint && (
                  <div
                    className="absolute z-20 pointer-events-none bg-slate-900/95 backdrop-blur-sm text-white px-3 py-2 rounded-lg shadow-xl text-xs border border-slate-700 font-sans transform -translate-x-1/2 -translate-y-full animate-in fade-in zoom-in-95 duration-100"
                    style={{
                      left: `${(hoveredPoint.x / 500) * 100}%`,
                      top: `${Math.max(hoveredPoint.y - 12, 10)}px`,
                    }}
                  >
                    <div className="flex items-center gap-2 mb-0.5">
                      <span className="font-semibold text-slate-300">{hoveredPoint.month}</span>
                      <span className="font-bold text-white px-1.5 py-0.2 bg-slate-800 rounded border border-slate-700">
                        {hoveredPoint.rank}
                      </span>
                    </div>
                    <div className="flex items-baseline gap-2">
                      <span className="text-sm font-bold text-emerald-400 font-mono tabular-nums">
                        충족율 {hoveredPoint.rate}%
                      </span>
                      <span className="text-2xs text-slate-400 font-mono">
                        ({hoveredPoint.passed}/{hoveredPoint.total}명)
                      </span>
                    </div>
                  </div>
                )}
              </div>
            </div>

            <div className="mt-3 pt-3 border-t border-slate-100 flex items-center justify-between text-xs text-slate-500">
              <span className="text-2xs text-slate-400">
                * 각 월별 포인트에 마우스를 올리면 직급별 정확한 충족율 수치 및 인원수가 표시됩니다.
              </span>
              <span className="flex items-center gap-1.5 shrink-0">
                <span className="w-2.5 h-2.5 rounded-full bg-indigo-600 inline-block" /> 전사 종합 충족율
              </span>
            </div>
          </div>

          {/* Top Right: Criteria Badges Acquisition Rate (Sorted Ascending) */}
          <div className="bg-white rounded-xl p-5 border border-slate-200/90 shadow-2xs flex flex-col justify-between">
            <div>
              <div className="flex items-start justify-between gap-4 mb-2">
                <div>
                  <h2 className="text-base font-bold text-slate-900 flex items-center gap-2">
                    <BarChart3 className="w-4 h-4 text-indigo-600" />
                    주요배지 취득율 현황
                  </h2>
                </div>
              </div>

              {/* Progress bars list */}
              <div className="space-y-2.5 mt-3 max-h-60 overflow-y-auto pr-1">
                {badgeRates.map((b, idx) => {
                  const isUrgent = b.rate < 35;
                  const isModerate = b.rate >= 35 && b.rate < 60;
                  return (
                    <div key={idx} className="group hover:bg-slate-50/80 p-1.5 rounded-lg transition-colors">
                      <div className="flex items-center justify-between text-xs mb-1">
                        <div className="flex items-center gap-2">
                          <span className="font-mono text-slate-400 text-2xs w-3 text-right">{idx + 1}</span>
                          <span className="font-bold text-slate-900">{b.name}</span>
                          <span className="text-2xs px-1.5 py-0.2 bg-slate-100 text-slate-600 rounded">
                            {b.desc}
                          </span>
                        </div>
                        <div className="flex items-center gap-2 font-mono tabular-nums text-xs">
                          <span className="text-slate-500 text-2xs">({b.num}/{b.denom}명)</span>
                          <span className={`font-bold ${isUrgent ? 'text-rose-600' : isModerate ? 'text-amber-600' : 'text-emerald-700'}`}>
                            {b.rate}%
                          </span>
                        </div>
                      </div>

                      <div className="w-full bg-slate-100 h-2 rounded-full overflow-hidden">
                        <div
                          className={`h-full rounded-full transition-all duration-500 ${
                            isUrgent ? 'bg-rose-500' : isModerate ? 'bg-amber-500' : 'bg-emerald-500'
                          }`}
                          style={{ width: `${Math.max(b.rate, 4)}%` }}
                        />
                      </div>
                    </div>
                  );
                })}
              </div>
            </div>

            <div className="mt-3 pt-3 border-t border-slate-100 flex items-center justify-between text-xs text-slate-500">
              <span className="text-2xs text-slate-500">
                * 취득율이 낮은 배지(DS_G 12.0%, PP_B 24.3%, DA_B 25.7%)를 중심으로 임원 지휘 요청
              </span>
            </div>
          </div>
        </section>

        {/* Main Workspace Split (Left: Executive Non-fulfillment Ranking & Action, Right: Individual Member Actions) */}
        <section className="grid grid-cols-1 lg:grid-cols-2 gap-6 items-start">
          {/* Main Left: Executive Ranking List */}
          <div className="bg-white rounded-xl border border-slate-200/90 shadow-2xs overflow-hidden">
            <div className="p-4 border-b border-slate-100 bg-slate-50/50 flex flex-col gap-3">
              <div className="flex items-center justify-between">
                <div>
                  <h3 className="text-sm font-bold text-slate-900 flex items-center gap-2">
                    <User className="w-4 h-4 text-indigo-600" />
                    임원별 배지 기준 미충족 현황
                  </h3>
                  <p className="text-2xs text-slate-500 mt-0.5">
                    개별 임원명 클릭 또는 선택을 통해 지휘 요청 이메일 발송
                  </p>
                </div>

                {selectedExecs.length > 0 && (
                  <button
                    onClick={() => setIsBulkExecModalOpen(true)}
                    className="inline-flex items-center gap-1.5 px-2.5 py-1.5 bg-indigo-600 text-white text-xs font-semibold rounded-lg hover:bg-indigo-700 active:scale-97 cursor-pointer transition-all shadow-xs"
                  >
                    <Mail className="w-3.5 h-3.5" />
                    <span>선택 임원 일괄 발송 ({selectedExecs.length}명)</span>
                  </button>
                )}
              </div>

              {/* Action Bar */}
              <div className="flex items-center justify-between gap-3">
                <div className="flex items-center gap-2">
                  <button
                    onClick={handleSelectAllExecs}
                    className="flex items-center gap-1.5 text-xs text-slate-600 hover:text-slate-900 cursor-pointer font-medium"
                  >
                    {selectedExecs.length === filteredExecutives.length && filteredExecutives.length > 0 ? (
                      <CheckSquare className="w-4 h-4 text-indigo-600" />
                    ) : (
                      <Square className="w-4 h-4 text-slate-400" />
                    )}
                    <span>전체선택 ({filteredExecutives.length}명)</span>
                  </button>

                  <div className="flex items-center gap-1 bg-slate-200/60 p-0.5 rounded-md text-2xs font-medium ml-2">
                    <button
                      onClick={() => setSelectedExecRankTab('all')}
                      className={`px-2 py-0.5 rounded cursor-pointer ${selectedExecRankTab === 'all' ? 'bg-white text-slate-900 font-semibold shadow-2xs' : 'text-slate-600'}`}
                    >
                      전체 ({executiveStats.length})
                    </button>
                    <button
                      onClick={() => setSelectedExecRankTab('high_risk')}
                      className={`px-2 py-0.5 rounded cursor-pointer ${selectedExecRankTab === 'high_risk' ? 'bg-white text-rose-700 font-semibold shadow-2xs' : 'text-slate-600'}`}
                    >
                      85% 이상 긴급 ({executiveStats.filter(e => e.nonFulfillRate >= 85).length})
                    </button>
                  </div>
                </div>

                <div className="relative w-44">
                  <Search className="w-3.5 h-3.5 text-slate-400 absolute left-2.5 top-2.5" />
                  <input
                    type="text"
                    placeholder="임원명/부서 검색"
                    value={execSearch}
                    onChange={e => setExecSearch(e.target.value)}
                    className="w-full pl-8 pr-2.5 py-1 text-xs border border-slate-200 rounded-lg focus:outline-none focus:border-indigo-500 bg-white"
                  />
                </div>
              </div>
            </div>

            {/* Executives List */}
            <div className="divide-y divide-slate-100 max-h-165 overflow-y-auto">
              {filteredExecutives.map((stat, idx) => {
                const isSelected = selectedExecs.includes(stat.exec);
                return (
                  <div
                    key={stat.exec}
                    className={`p-3.5 flex items-center justify-between gap-4 transition-colors hover:bg-slate-50/90 ${
                      isSelected ? 'bg-indigo-50/40' : ''
                    }`}
                  >
                    <div className="flex items-center gap-3">
                      <input
                        type="checkbox"
                        checked={isSelected}
                        onChange={() => {
                          if (isSelected) {
                            setSelectedExecs(selectedExecs.filter(e => e !== stat.exec));
                          } else {
                            setSelectedExecs([...selectedExecs, stat.exec]);
                          }
                        }}
                        className="w-4 h-4 rounded text-indigo-600 cursor-pointer"
                      />

                      <span className="text-2xs font-mono text-slate-400 w-4 text-center">{idx + 1}</span>

                      <div>
                        <div className="flex items-center gap-2">
                          <button
                            onClick={() => openExecutiveModal(stat)}
                            className="text-sm font-bold text-slate-900 hover:text-indigo-600 underline-offset-2 hover:underline cursor-pointer flex items-center gap-1"
                          >
                            <span>{stat.exec}</span>
                            <ArrowUpRight className="w-3 h-3 text-slate-400" />
                          </button>
                          <span className="text-xs text-slate-500 font-normal">
                            {stat.org}
                          </span>
                          {stat.promoFailedCount > 0 && (
                            <span className="text-xs font-semibold px-2 py-0.5 bg-rose-50 text-rose-700 border border-rose-300 rounded-md">
                              진급대상자 {stat.promoFailedCount}명 집중지휘 필요
                            </span>
                          )}
                        </div>

                        <div className="flex items-center gap-2 mt-1 text-xs text-slate-500">
                          <span>총 인원: <strong className="text-slate-800 font-mono">{stat.total}명</strong></span>
                          <span>·</span>
                          <span>미충족: <strong className="text-rose-600 font-mono">{stat.failedCount}명</strong></span>
                        </div>
                      </div>
                    </div>

                    <div className="flex items-center gap-3 shrink-0">
                      <div className="text-right">
                        <div className="text-sm font-bold text-rose-600 font-mono tabular-nums">
                          {stat.nonFulfillRate}%
                        </div>
                        <div className="w-20 bg-slate-100 h-1.5 rounded-full overflow-hidden mt-1">
                          <div
                            className="bg-rose-500 h-full rounded-full"
                            style={{ width: `${stat.nonFulfillRate}%` }}
                          />
                        </div>
                      </div>

                      <button
                        onClick={() => openExecutiveModal(stat)}
                        className="px-2.5 py-1 text-xs font-semibold text-slate-700 bg-slate-100 hover:bg-indigo-600 hover:text-white rounded-lg transition-colors cursor-pointer shrink-0"
                      >
                        지휘요청
                      </button>
                    </div>
                  </div>
                );
              })}
            </div>
          </div>

          {/* Main Right: Individual Unfulfilled Employees List with Sequential Missing Badge Filter */}
          <div className="bg-white rounded-xl border border-slate-200/90 shadow-2xs overflow-hidden">
            <div className="p-4 border-b border-slate-100 bg-slate-50/50 flex flex-col gap-3">
              <div className="flex items-center justify-between">
                <div>
                  <h3 className="text-sm font-bold text-slate-900 flex items-center gap-2">
                    <AlertCircle className="w-4 h-4 text-rose-600" />
                    개인별 배지 취득 현황
                  </h3>
                </div>

                <div className="flex items-center gap-2">
                  {missingFilterBadge !== 'all' && (
                    <button
                      onClick={openOfflineCourseModal}
                      className="inline-flex items-center gap-1.5 px-3 py-1.5 bg-emerald-600 text-white text-xs font-semibold rounded-lg hover:bg-emerald-700 active:scale-97 cursor-pointer transition-all shadow-xs"
                    >
                      <GraduationCap className="w-4 h-4" />
                      <span>
                        {missingFilterBadge}_{getTierName(missingFilterTier)} 오프라인 교육 안내 발송 ({selectedEmps.length > 0 ? selectedEmps.length : filteredUnfulfilledEmployees.length}명)
                      </span>
                    </button>
                  )}

                  {selectedEmps.length > 0 && (
                    <button
                      onClick={() => setIsBulkEmpModalOpen(true)}
                      className="inline-flex items-center gap-1.5 px-2.5 py-1.5 bg-rose-600 text-white text-xs font-semibold rounded-lg hover:bg-rose-700 active:scale-97 cursor-pointer transition-all shadow-xs"
                    >
                      <Mail className="w-3.5 h-3.5" />
                      <span>선택 인원 일괄 발송 ({selectedEmps.length}명)</span>
                    </button>
                  )}
                </div>
              </div>

              {/* Action Bar & General Filters */}
              <div className="flex flex-wrap items-center justify-between gap-2">
                <div className="flex items-center gap-2">
                  <button
                    onClick={handleSelectAllEmps}
                    className="flex items-center gap-1 text-xs text-slate-600 hover:text-slate-900 cursor-pointer font-medium"
                  >
                    {selectedEmps.length === filteredUnfulfilledEmployees.length && filteredUnfulfilledEmployees.length > 0 ? (
                      <CheckSquare className="w-4 h-4 text-rose-600" />
                    ) : (
                      <Square className="w-4 h-4 text-slate-400" />
                    )}
                    <span>전체선택 ({filteredUnfulfilledEmployees.length}명)</span>
                  </button>

                  <button
                    onClick={handleSelectOnlyPromoEmps}
                    className="text-xs px-2 py-0.5 rounded-md bg-rose-100/80 text-rose-800 font-semibold hover:bg-rose-200 cursor-pointer border border-rose-300/80 transition-colors"
                  >
                    ★ 중점지휘 대상자만
                  </button>

                  {/* Mode Filter */}
                  <div className="flex items-center gap-1 bg-slate-200/60 p-0.5 rounded-md text-2xs font-medium ml-1">
                    <button
                      onClick={() => setEmpFilterMode('all')}
                      className={`px-2 py-0.5 rounded cursor-pointer ${empFilterMode === 'all' ? 'bg-white text-slate-900 font-semibold shadow-2xs' : 'text-slate-600'}`}
                    >
                      전체 ({unfulfilledEmployees.length})
                    </button>
                    <button
                      onClick={() => setEmpFilterMode('promo_only')}
                      className={`px-2 py-0.5 rounded cursor-pointer ${empFilterMode === 'promo_only' ? 'bg-white text-rose-700 font-semibold shadow-2xs' : 'text-slate-600'}`}
                    >
                      중점지휘 대상자만 ({promoFailedTotal})
                    </button>
                  </div>
                </div>

                <div className="flex items-center gap-2">
                  <select
                    value={selectedRankFilter}
                    onChange={e => setSelectedRankFilter(e.target.value as any)}
                    className="text-xs border border-slate-200 rounded-lg px-2 py-1 bg-white focus:outline-none"
                  >
                    <option value="all">직급 전체</option>
                    <option value="G1">G1</option>
                    <option value="G2">G2</option>
                    <option value="G3">G3</option>
                  </select>

                  <div className="relative w-36">
                    <Search className="w-3.5 h-3.5 text-slate-400 absolute left-2 top-2.5" />
                    <input
                      type="text"
                      placeholder="사원명/팀명"
                      value={empSearch}
                      onChange={e => setEmpSearch(e.target.value)}
                      className="w-full pl-7 pr-2 py-1 text-xs border border-slate-200 rounded-lg focus:outline-none bg-white"
                    />
                  </div>
                </div>
              </div>

              {/* 미취득 배지 및 순차적 기준 수준 필터 바 */}
              <div className="pt-2 border-t border-slate-200/70 flex flex-wrap items-center justify-between gap-2 bg-indigo-50/40 p-2.5 rounded-lg border border-indigo-100">
                <div className="flex items-center gap-2 flex-wrap">
                  <span className="text-xs font-bold text-indigo-950 flex items-center gap-1">
                    <BookOpen className="w-3.5 h-3.5 text-indigo-600" />
                    미취득 배지 필터:
                  </span>

                  <select
                    value={missingFilterBadge}
                    onChange={e => {
                      setMissingFilterBadge(e.target.value);
                      setSelectedEmps([]);
                    }}
                    className="text-xs font-semibold border border-indigo-200 rounded-md px-2 py-1 bg-white focus:outline-none text-slate-800"
                  >
                    <option value="all">배지 전체</option>
                    {ALL_BADGE_CODES.map(b => (
                      <option key={b.code} value={b.code}>{b.name}</option>
                    ))}
                  </select>

                  <span className="text-2xs text-slate-500 font-medium">기준 수준:</span>
                  <select
                    value={missingFilterTier}
                    onChange={e => {
                      setMissingFilterTier(Number(e.target.value));
                      setSelectedEmps([]);
                    }}
                    className="text-xs font-semibold border border-indigo-200 rounded-md px-2 py-1 bg-white focus:outline-none text-slate-800"
                  >
                    {TIER_LEVELS.map(t => (
                      <option key={t.val} value={t.val}>{t.name}</option>
                    ))}
                  </select>

                  {missingFilterBadge !== 'all' && (
                    <button
                      onClick={() => {
                        setMissingFilterBadge('all');
                        setSelectedEmps([]);
                      }}
                      className="text-2xs px-2 py-1 rounded bg-slate-200 text-slate-700 hover:bg-slate-300 font-medium cursor-pointer"
                    >
                      필터 해제
                    </button>
                  )}
                </div>

                {/* Quick Presets (순차 승급 체계 기반: Green=2, Black=3) */}
                <div className="flex items-center gap-1 flex-wrap text-2xs">
                  <span className="text-slate-400">빠른선택:</span>
                  {[
                    { b: 'DS', t: 2, label: 'DS_Green' },
                    { b: 'CL', t: 2, label: 'CL_Green' },
                    { b: 'DA', t: 2, label: 'DA_Green' },
                    { b: 'PP', t: 2, label: 'PP_Green' },
                    { b: 'ML', t: 2, label: 'ML_Green' },
                    { b: 'PE', t: 2, label: 'PE_Green' },
                    { b: 'AU', t: 3, label: 'AU_Black' },
                    { b: 'DA', t: 3, label: 'DA_Black' },
                    { b: 'PP', t: 3, label: 'PP_Black' },
                    { b: 'ML', t: 3, label: 'ML_Black' },
                  ].map(p => {
                    const isActive = missingFilterBadge === p.b && missingFilterTier === p.t;
                    return (
                      <button
                        key={p.label}
                        onClick={() => {
                          setMissingFilterBadge(p.b);
                          setMissingFilterTier(p.t);
                          setSelectedEmps([]);
                        }}
                        className={`px-1.5 py-0.5 rounded cursor-pointer transition-colors ${
                          isActive 
                            ? 'bg-indigo-600 text-white font-bold' 
                            : 'bg-white text-indigo-700 border border-indigo-200 hover:bg-indigo-100 font-medium'
                        }`}
                      >
                        {p.label}
                      </button>
                    );
                  })}
                </div>
              </div>
            </div>

            {/* Individual List */}
            <div className="divide-y divide-slate-100 max-h-165 overflow-y-auto">
              {filteredUnfulfilledEmployees.length === 0 ? (
                <div className="p-8 text-center text-xs text-slate-400">
                  해당 조건의 미취득 인원이 없습니다.
                </div>
              ) : (
                filteredUnfulfilledEmployees.map((emp) => {
                  const isSelected = selectedEmps.includes(emp.id);
                  return (
                    <div
                      key={emp.id}
                      className={`p-3.5 flex items-center justify-between gap-3 transition-colors hover:bg-slate-50/90 ${
                        emp.isPromo ? 'bg-rose-50/30' : ''
                      } ${isSelected ? 'bg-rose-100/40' : ''}`}
                    >
                      <div className="flex items-center gap-3">
                        <input
                          type="checkbox"
                          checked={isSelected}
                          onChange={() => {
                            if (isSelected) {
                              setSelectedEmps(selectedEmps.filter(id => id !== emp.id));
                            } else {
                              setSelectedEmps([...selectedEmps, emp.id]);
                            }
                          }}
                          className="w-4 h-4 rounded text-rose-600 cursor-pointer"
                        />

                        <div>
                          <div className="flex items-center gap-2 flex-wrap">
                            <button
                              onClick={() => openEmployeeModal(emp)}
                              className="text-sm font-bold text-slate-900 hover:text-rose-600 underline-offset-2 hover:underline cursor-pointer flex items-center gap-1"
                            >
                              <span>{emp.name}</span>
                              <ArrowUpRight className="w-3 h-3 text-slate-400" />
                            </button>

                            <span className="text-xs font-semibold px-1.5 py-0.2 bg-slate-100 text-slate-700 rounded font-mono">
                              {emp.rank}
                            </span>

                            {emp.isPromo && (
                              <span className="text-xs font-semibold px-2 py-0.5 bg-rose-50 text-rose-700 border border-rose-300 rounded-md">
                                중점지휘 대상자
                              </span>
                            )}

                            <span className="text-xs text-slate-500">
                              {emp.team} · {emp.exec}
                            </span>
                          </div>

                          {/* Refined smaller font for missing badges */}
                          <div className="flex items-center gap-1 mt-1 flex-wrap">
                            <span className="text-[10px] text-slate-400 font-medium">부족 배지:</span>
                            {emp.missingBadges.map((m, mIdx) => (
                              <span
                                key={mIdx}
                                className="text-[10px] leading-tight font-medium px-1.5 py-0.5 bg-rose-50 text-rose-700 border border-rose-200/70 rounded"
                              >
                                {m.label} ({m.current ? getTierName(m.currentTier) : '미취득'})
                              </span>
                            ))}
                          </div>
                        </div>
                      </div>

                      <div className="flex items-center gap-3 shrink-0">
                        <div className="text-right">
                          <div className="text-xs font-bold font-mono tabular-nums text-slate-900">
                            충족율 {emp.fulfillRate}%
                          </div>
                          <div className="text-2xs text-slate-400 font-mono">
                            {emp.fulfilledCount}/{emp.totalRequired}개 충족
                          </div>
                        </div>

                        <button
                          onClick={() => openEmployeeModal(emp)}
                          className="px-2.5 py-1 text-xs font-semibold text-rose-700 bg-rose-50 hover:bg-rose-600 hover:text-white rounded-lg transition-colors cursor-pointer border border-rose-200/80 shrink-0"
                        >
                          취득권고
                        </button>
                      </div>
                    </div>
                  );
                })
              )}
            </div>
          </div>
        </section>
      </main>

      {/* MODAL 1: Executive Email Dialog with Portal Link */}
      {activeExecModal && (
        <div className="fixed inset-0 z-50 flex items-center justify-center p-4 bg-slate-900/60 backdrop-blur-xs animate-in fade-in duration-150">
          <div className="bg-white rounded-2xl shadow-2xl border border-slate-200 w-full max-w-2xl max-h-[90vh] flex flex-col overflow-hidden">
            {/* Header */}
            <div className="px-6 py-4 border-b border-slate-100 bg-slate-50/70 flex items-center justify-between">
              <div>
                <h3 className="text-base font-bold text-slate-900 flex items-center gap-2">
                  <Mail className="w-5 h-5 text-indigo-600" />
                  <span>{activeExecModal.exec} 지휘 요청 이메일 발송</span>
                </h3>
                <p className="text-xs text-slate-500 mt-0.5">
                  {activeExecModal.org} 소속 배지 미충족 {activeExecModal.failedCount}명 (진급대상자 {activeExecModal.promoFailedCount}명 포함) 지도 요청
                </p>
              </div>
              <button
                onClick={() => setActiveExecModal(null)}
                className="text-slate-400 hover:text-slate-700 p-1 rounded-lg cursor-pointer"
              >
                <X className="w-5 h-5" />
              </button>
            </div>

            {/* Body */}
            <div className="p-6 overflow-y-auto space-y-4 text-xs">
              {/* Recipient & Subject Header */}
              <div className="space-y-2 bg-slate-50 p-3.5 rounded-xl border border-slate-200/70">
                <div className="flex items-center gap-2">
                  <span className="text-slate-500 w-16 shrink-0 font-medium">수신자:</span>
                  <span className="font-semibold text-slate-900">
                    {activeExecModal.exec} ({activeExecModal.exec.replace('임원', '')}.exec@company.com)
                  </span>
                </div>
                <div className="flex items-center gap-2">
                  <span className="text-slate-500 w-16 shrink-0 font-medium">제목:</span>
                  {isEditingExecEmail ? (
                    <input
                      type="text"
                      value={execEmailSubject}
                      onChange={e => setExecEmailSubject(e.target.value)}
                      className="w-full text-xs font-semibold px-2 py-1 border border-slate-300 rounded bg-white focus:outline-none focus:border-indigo-500"
                    />
                  ) : (
                    <span className="font-semibold text-slate-900">{execEmailSubject}</span>
                  )}
                </div>
              </div>

              {/* Portal Link Highlight Box */}
              <div className="p-3 bg-indigo-50/70 rounded-xl border border-indigo-200 flex items-center justify-between gap-3 text-xs">
                <div className="flex items-center gap-2 text-indigo-900">
                  <ExternalLink className="w-4 h-4 text-indigo-600 shrink-0" />
                  <span>AXAGE 에 대한 자세한 내용은 AXAGE 포털을 참고하시기 바랍니다.</span>
                </div>
                <a
                  href="https://test22-taupe-one.vercel.app/"
                  target="_blank"
                  rel="noopener noreferrer"
                  className="px-2.5 py-1 bg-indigo-600 text-white rounded font-medium text-2xs hover:bg-indigo-700 shrink-0 flex items-center gap-1"
                >
                  포털 방문 <ArrowUpRight className="w-3 h-3" />
                </a>
              </div>

              {/* Past History Toggle Section */}
              {showExecPastHistory && (
                <div className="p-4 bg-amber-50/60 rounded-xl border border-amber-200">
                  <div className="flex items-center justify-between mb-2">
                    <span className="font-bold text-amber-900 flex items-center gap-1.5">
                      <Clock className="w-4 h-4 text-amber-700" />
                      지난 1년간 {activeExecModal.exec}에게 발송된 이메일 이력 ({execPastList.length}건)
                    </span>
                    <span className="text-2xs text-amber-700">
                      * 동일 내용 중복 발송 방지용 이력
                    </span>
                  </div>

                  {execPastList.length === 0 ? (
                    <p className="text-slate-500 text-xs py-2">지난 1년간 발송된 이력이 없습니다.</p>
                  ) : (
                    <div className="space-y-2 max-h-36 overflow-y-auto pr-1">
                      {execPastList.map(item => (
                        <div key={item.id} className="p-2.5 bg-white rounded-lg border border-amber-100 text-xs">
                          <div className="flex items-center justify-between text-slate-500 text-2xs mb-0.5">
                            <span className="font-mono">{item.date}</span>
                            <span>{item.sender}</span>
                          </div>
                          <div className="font-bold text-slate-900">{item.subject}</div>
                          <div className="text-slate-600 text-2xs mt-1 line-clamp-2">{item.content}</div>
                        </div>
                      ))}
                    </div>
                  )}
                </div>
              )}

              {/* Email Content Body */}
              <div>
                <label className="font-semibold text-slate-700 block mb-1.5">
                  이메일 본문 (진급대상자 우선 구성):
                </label>
                {isEditingExecEmail ? (
                  <textarea
                    rows={12}
                    value={execEmailBody}
                    onChange={e => setExecEmailBody(e.target.value)}
                    className="w-full text-xs p-3 font-mono border border-slate-300 rounded-xl bg-white focus:outline-none focus:border-indigo-500 focus:ring-1 focus:ring-indigo-500"
                  />
                ) : (
                  <div className="p-4 bg-white rounded-xl border border-slate-200 text-slate-800 whitespace-pre-wrap font-sans text-xs leading-relaxed max-h-72 overflow-y-auto">
                    {execEmailBody}
                  </div>
                )}
              </div>
            </div>

            {/* Footer with 3 required buttons */}
            <div className="px-6 py-4 border-t border-slate-100 bg-slate-50/80 flex items-center justify-between gap-3">
              <button
                type="button"
                onClick={() => setShowExecPastHistory(!showExecPastHistory)}
                className="inline-flex items-center gap-1.5 px-3 py-2 text-xs font-semibold text-slate-700 bg-white border border-slate-300 rounded-xl hover:bg-slate-100 active:scale-97 cursor-pointer transition-colors"
              >
                <History className="w-3.5 h-3.5 text-slate-500" />
                <span>과거 발송 정보 보기</span>
              </button>

              <div className="flex items-center gap-2">
                <button
                  type="button"
                  onClick={() => setIsEditingExecEmail(!isEditingExecEmail)}
                  className="inline-flex items-center gap-1.5 px-3.5 py-2 text-xs font-semibold text-slate-700 bg-white border border-slate-300 rounded-xl hover:bg-slate-100 active:scale-97 cursor-pointer transition-colors"
                >
                  <Edit3 className="w-3.5 h-3.5 text-slate-500" />
                  <span>{isEditingExecEmail ? '수정 완료' : '수정하기'}</span>
                </button>

                <button
                  type="button"
                  onClick={handleSendExecEmail}
                  className="inline-flex items-center gap-1.5 px-4 py-2 text-xs font-bold text-white bg-indigo-600 hover:bg-indigo-700 rounded-xl active:scale-97 cursor-pointer transition-all shadow-sm"
                >
                  <Send className="w-3.5 h-3.5" />
                  <span>그대로 발송하기</span>
                </button>
              </div>
            </div>
          </div>
        </div>
      )}

      {/* MODAL 2: Individual Employee Email Dialog with Academy Link */}
      {activeEmpModal && (
        <div className="fixed inset-0 z-50 flex items-center justify-center p-4 bg-slate-900/60 backdrop-blur-xs animate-in fade-in duration-150">
          <div className="bg-white rounded-2xl shadow-2xl border border-slate-200 w-full max-w-2xl max-h-[90vh] flex flex-col overflow-hidden">
            {/* Header */}
            <div className="px-6 py-4 border-b border-slate-100 bg-slate-50/70 flex items-center justify-between">
              <div>
                <div className="flex items-center gap-2">
                  <h3 className="text-base font-bold text-slate-900 flex items-center gap-2">
                    <Mail className="w-5 h-5 text-rose-600" />
                    <span>{activeEmpModal.name}님 배지 취득 권고 이메일 발송</span>
                  </h3>
                  {activeEmpModal.isPromo && (
                    <span className="text-xs font-semibold px-2 py-0.5 bg-rose-50 text-rose-700 border border-rose-300 rounded-md">
                      중점지휘 대상자
                    </span>
                  )}
                </div>
                <p className="text-xs text-slate-500 mt-0.5">
                  {activeEmpModal.team} · 직급 {activeEmpModal.rank} · 담당: {activeEmpModal.exec}
                </p>
              </div>
              <button
                onClick={() => setActiveEmpModal(null)}
                className="text-slate-400 hover:text-slate-700 p-1 rounded-lg cursor-pointer"
              >
                <X className="w-5 h-5" />
              </button>
            </div>

            {/* Body */}
            <div className="p-6 overflow-y-auto space-y-4 text-xs">
              {/* Academy App Link Highlight Box */}
              <div className="p-3 bg-rose-50/70 rounded-xl border border-rose-200 flex items-center justify-between gap-3 text-xs">
                <div className="flex items-center gap-2 text-rose-900">
                  <ExternalLink className="w-4 h-4 text-rose-600 shrink-0" />
                  <span>배지 취득을 위한 신청은 AXAGE 아카데미 앱을 이용 바랍니다.</span>
                </div>
                <a
                  href="https://test14-wyc8.vercel.app/"
                  target="_blank"
                  rel="noopener noreferrer"
                  className="px-2.5 py-1 bg-rose-600 text-white rounded font-medium text-2xs hover:bg-rose-700 shrink-0 flex items-center gap-1"
                >
                  아카데미 접속 <ArrowUpRight className="w-3 h-3" />
                </a>
              </div>

              {/* Badges Comparison Table */}
              <div className="bg-slate-50 p-3.5 rounded-xl border border-slate-200/80">
                <span className="font-bold text-slate-900 block mb-2">
                  {activeEmpModal.rank} 직급 요구 배지 기준 vs 현재 본인 배지 취득 현황:
                </span>
                <div className="grid grid-cols-1 sm:grid-cols-2 gap-2">
                  {CRITERIA_MAP[activeEmpModal.rank].map((req, i) => {
                    const currentVal = activeEmpModal.badges[req.badge] || '';
                    const currentTier = getTierValue(currentVal);
                    const isPassed = currentTier >= req.minTier;
                    return (
                      <div
                        key={i}
                        className={`p-2.5 rounded-lg border text-xs flex items-center justify-between ${
                          isPassed ? 'bg-emerald-50/50 border-emerald-200' : 'bg-rose-50/70 border-rose-200'
                        }`}
                      >
                        <div>
                          <div className="font-semibold text-slate-900">{req.name}</div>
                          <div className="text-2xs text-slate-500">필요: {getPureTierName(req.minTier)} 이상</div>
                        </div>
                        <div className="text-right">
                          <span className={`text-2xs px-2 py-0.5 rounded-md font-semibold ${getTierBadgeClass(currentVal)}`}>
                            현재: {currentVal ? getPureTierName(currentTier) : '미취득'}
                          </span>
                          <span className={`block text-2xs mt-0.5 font-bold ${isPassed ? 'text-emerald-700' : 'text-rose-600'}`}>
                            {isPassed ? '획득' : '미획득'}
                          </span>
                        </div>
                      </div>
                    );
                  })}
                </div>
              </div>

              {/* Past History Toggle */}
              {showEmpPastHistory && (
                <div className="p-4 bg-amber-50/60 rounded-xl border border-amber-200">
                  <div className="flex items-center justify-between mb-2">
                    <span className="font-bold text-amber-900 flex items-center gap-1.5">
                      <Clock className="w-4 h-4 text-amber-700" />
                      지난 1년간 {activeEmpModal.name}님에게 발송된 권고 이력 ({empPastList.length}건)
                    </span>
                    <span className="text-2xs text-amber-700">
                      * 동일 내용 잦은 발송 방지
                    </span>
                  </div>

                  {empPastList.length === 0 ? (
                    <p className="text-slate-500 text-xs py-2">지난 1년간 발송된 이력이 없습니다.</p>
                  ) : (
                    <div className="space-y-2 max-h-36 overflow-y-auto pr-1">
                      {empPastList.map(item => (
                        <div key={item.id} className="p-2.5 bg-white rounded-lg border border-amber-100 text-xs">
                          <div className="flex items-center justify-between text-slate-500 text-2xs mb-0.5">
                            <span className="font-mono">{item.date}</span>
                            <span>{item.sender}</span>
                          </div>
                          <div className="font-bold text-slate-900">{item.subject}</div>
                          <div className="text-slate-600 text-2xs mt-1 line-clamp-2">{item.content}</div>
                        </div>
                      ))}
                    </div>
                  )}
                </div>
              )}

              {/* Email Content Body */}
              <div>
                <label className="font-semibold text-slate-700 block mb-1.5">
                  권고 이메일 본문:
                </label>
                {isEditingEmpEmail ? (
                  <textarea
                    rows={10}
                    value={empEmailBody}
                    onChange={e => setEmpEmailBody(e.target.value)}
                    className="w-full text-xs p-3 font-mono border border-slate-300 rounded-xl bg-white focus:outline-none focus:border-rose-500"
                  />
                ) : (
                  <div className="p-4 bg-white rounded-xl border border-slate-200 text-slate-800 whitespace-pre-wrap font-sans text-xs leading-relaxed max-h-64 overflow-y-auto">
                    {empEmailBody}
                  </div>
                )}
              </div>
            </div>

            {/* Footer with 3 required buttons */}
            <div className="px-6 py-4 border-t border-slate-100 bg-slate-50/80 flex items-center justify-between gap-3">
              <button
                type="button"
                onClick={() => setShowEmpPastHistory(!showEmpPastHistory)}
                className="inline-flex items-center gap-1.5 px-3 py-2 text-xs font-semibold text-slate-700 bg-white border border-slate-300 rounded-xl hover:bg-slate-100 active:scale-97 cursor-pointer transition-colors"
              >
                <History className="w-3.5 h-3.5 text-slate-500" />
                <span>과거 발송 정보 보기</span>
              </button>

              <div className="flex items-center gap-2">
                <button
                  type="button"
                  onClick={() => setIsEditingEmpEmail(!isEditingEmpEmail)}
                  className="inline-flex items-center gap-1.5 px-3.5 py-2 text-xs font-semibold text-slate-700 bg-white border border-slate-300 rounded-xl hover:bg-slate-100 active:scale-97 cursor-pointer transition-colors"
                >
                  <Edit3 className="w-3.5 h-3.5 text-slate-500" />
                  <span>{isEditingEmpEmail ? '수정 완료' : '수정하기'}</span>
                </button>

                <button
                  type="button"
                  onClick={handleSendEmpEmail}
                  className="inline-flex items-center gap-1.5 px-4 py-2 text-xs font-bold text-white bg-rose-600 hover:bg-rose-700 rounded-xl active:scale-97 cursor-pointer transition-all shadow-sm"
                >
                  <Send className="w-3.5 h-3.5" />
                  <span>그대로 발송하기</span>
                </button>
              </div>
            </div>
          </div>
        </div>
      )}

      {/* MODAL 3: Offline Course Announcement Modal */}
      {isOfflineCourseModalOpen && (
        <div className="fixed inset-0 z-50 flex items-center justify-center p-4 bg-slate-900/60 backdrop-blur-xs animate-in fade-in duration-150">
          <div className="bg-white rounded-2xl shadow-2xl border border-slate-200 w-full max-w-2xl max-h-[90vh] flex flex-col overflow-hidden">
            {/* Header */}
            <div className="px-6 py-4 border-b border-slate-100 bg-emerald-50/80 flex items-center justify-between">
              <div>
                <h3 className="text-base font-bold text-slate-900 flex items-center gap-2">
                  <GraduationCap className="w-5 h-5 text-emerald-600" />
                  <span>오프라인 교육 과정 개설 안내 이메일 발송</span>
                </h3>
                <p className="text-xs text-slate-600 mt-0.5">
                  {missingFilterBadge}_{getTierName(missingFilterTier)} 미취득 대상자 ({selectedEmps.length > 0 ? selectedEmps.length : filteredUnfulfilledEmployees.length}명)에게 오프라인 실습 신청 안내 발송
                </p>
              </div>
              <button
                onClick={() => setIsOfflineCourseModalOpen(false)}
                className="text-slate-400 hover:text-slate-700 p-1 rounded-lg cursor-pointer"
              >
                <X className="w-5 h-5" />
              </button>
            </div>

            {/* Body */}
            <div className="p-6 overflow-y-auto space-y-4 text-xs">
              {/* Academy App Link Highlight Box */}
              <div className="p-3 bg-emerald-50/80 rounded-xl border border-emerald-200 flex items-center justify-between gap-3 text-xs">
                <div className="flex items-center gap-2 text-emerald-950 font-medium">
                  <ExternalLink className="w-4 h-4 text-emerald-600 shrink-0" />
                  <span>배지 취득을 위한 신청은 AXAGE 아카데미 앱을 이용 바랍니다.</span>
                </div>
                <a
                  href="https://test14-wyc8.vercel.app/"
                  target="_blank"
                  rel="noopener noreferrer"
                  className="px-2.5 py-1 bg-emerald-600 text-white rounded font-medium text-2xs hover:bg-emerald-700 shrink-0 flex items-center gap-1"
                >
                  아카데미 접속 <ArrowUpRight className="w-3 h-3" />
                </a>
              </div>

              {/* Subject */}
              <div className="bg-slate-50 p-3 rounded-xl border border-slate-200">
                <div className="flex items-center gap-2 mb-1.5">
                  <span className="text-slate-500 w-16 shrink-0 font-medium">발송 대상:</span>
                  <span className="font-semibold text-slate-900">
                    {missingFilterBadge}_{getTierName(missingFilterTier)} 미취득자 {selectedEmps.length > 0 ? selectedEmps.length : filteredUnfulfilledEmployees.length}명
                  </span>
                </div>
                <div className="flex items-center gap-2">
                  <span className="text-slate-500 w-16 shrink-0 font-medium">제목:</span>
                  {isEditingOfflineEmail ? (
                    <input
                      type="text"
                      value={offlineEmailSubject}
                      onChange={e => setOfflineEmailSubject(e.target.value)}
                      className="w-full text-xs font-semibold px-2 py-1 border border-slate-300 rounded bg-white focus:outline-none focus:border-emerald-500"
                    />
                  ) : (
                    <span className="font-semibold text-slate-900">{offlineEmailSubject}</span>
                  )}
                </div>
              </div>

              {/* Past History Toggle */}
              {showOfflinePastHistory && (
                <div className="p-4 bg-amber-50/60 rounded-xl border border-amber-200">
                  <div className="flex items-center justify-between mb-2">
                    <span className="font-bold text-amber-900 flex items-center gap-1.5">
                      <Clock className="w-4 h-4 text-amber-700" />
                      과거 오프라인 교육 발송 이력 ({offlinePastList.length}건)
                    </span>
                    <span className="text-2xs text-amber-700">
                      * 잦은 동일 과정 공지 방지
                    </span>
                  </div>

                  {offlinePastList.length === 0 ? (
                    <p className="text-slate-500 text-xs py-2">과거 발송된 오프라인 교육 공지 이력이 없습니다.</p>
                  ) : (
                    <div className="space-y-2 max-h-36 overflow-y-auto pr-1">
                      {offlinePastList.map(item => (
                        <div key={item.id} className="p-2.5 bg-white rounded-lg border border-amber-100 text-xs">
                          <div className="flex items-center justify-between text-slate-500 text-2xs mb-0.5">
                            <span className="font-mono">{item.date}</span>
                            <span>{item.sender}</span>
                          </div>
                          <div className="font-bold text-slate-900">{item.subject}</div>
                          <div className="text-slate-600 text-2xs mt-1 line-clamp-2">{item.content}</div>
                        </div>
                      ))}
                    </div>
                  )}
                </div>
              )}

              {/* Email Content Body */}
              <div>
                <label className="font-semibold text-slate-700 block mb-1.5">
                  이메일 본문 (오프라인 개설 및 이번 기회 취득 독려):
                </label>
                {isEditingOfflineEmail ? (
                  <textarea
                    rows={12}
                    value={offlineEmailBody}
                    onChange={e => setOfflineEmailBody(e.target.value)}
                    className="w-full text-xs p-3 font-mono border border-slate-300 rounded-xl bg-white focus:outline-none focus:border-emerald-500"
                  />
                ) : (
                  <div className="p-4 bg-white rounded-xl border border-slate-200 text-slate-800 whitespace-pre-wrap font-sans text-xs leading-relaxed max-h-64 overflow-y-auto">
                    {offlineEmailBody}
                  </div>
                )}
              </div>
            </div>

            {/* Footer with 3 required buttons */}
            <div className="px-6 py-4 border-t border-slate-100 bg-slate-50/80 flex items-center justify-between gap-3">
              <button
                type="button"
                onClick={() => setShowOfflinePastHistory(!showOfflinePastHistory)}
                className="inline-flex items-center gap-1.5 px-3 py-2 text-xs font-semibold text-slate-700 bg-white border border-slate-300 rounded-xl hover:bg-slate-100 active:scale-97 cursor-pointer transition-colors"
              >
                <History className="w-3.5 h-3.5 text-slate-500" />
                <span>과거 발송 정보 보기</span>
              </button>

              <div className="flex items-center gap-2">
                <button
                  type="button"
                  onClick={() => setIsEditingOfflineEmail(!isEditingOfflineEmail)}
                  className="inline-flex items-center gap-1.5 px-3.5 py-2 text-xs font-semibold text-slate-700 bg-white border border-slate-300 rounded-xl hover:bg-slate-100 active:scale-97 cursor-pointer transition-colors"
                >
                  <Edit3 className="w-3.5 h-3.5 text-slate-500" />
                  <span>{isEditingOfflineEmail ? '수정 완료' : '수정하기'}</span>
                </button>

                <button
                  type="button"
                  onClick={handleSendOfflineEmail}
                  className="inline-flex items-center gap-1.5 px-4 py-2 text-xs font-bold text-white bg-emerald-600 hover:bg-emerald-700 rounded-xl active:scale-97 cursor-pointer transition-all shadow-sm"
                >
                  <Send className="w-3.5 h-3.5" />
                  <span>그대로 발송하기</span>
                </button>
              </div>
            </div>
          </div>
        </div>
      )}

      {/* MODAL 4: Bulk Executive Email */}
      {isBulkExecModalOpen && (
        <div className="fixed inset-0 z-50 flex items-center justify-center p-4 bg-slate-900/60 backdrop-blur-xs">
          <div className="bg-white rounded-2xl shadow-2xl border border-slate-200 w-full max-w-lg p-6">
            <h3 className="text-base font-bold text-slate-900 flex items-center gap-2 mb-2">
              <Mail className="w-5 h-5 text-indigo-600" />
              <span>선택 임원 일괄 지휘요청 이메일 발송</span>
            </h3>
            <p className="text-xs text-slate-600 mb-4">
              선택된 <strong>{selectedExecs.length}명</strong>의 임원에게 각 소속 조직의 배지 미충족 인원 리스트(중점지휘 대상자 우선) 및 AXAGE 포털 링크(https://test22-taupe-one.vercel.app/)가 포함된 맞춤형 지휘 요청 이메일을 일괄 발송합니다.
            </p>

            <div className="bg-slate-50 p-3 rounded-lg border border-slate-200 text-xs mb-4 max-h-36 overflow-y-auto">
              <span className="font-semibold text-slate-700 block mb-1">발송 대상 임원 목록:</span>
              <div className="flex flex-wrap gap-1.5">
                {selectedExecs.map(ex => (
                  <span key={ex} className="px-2 py-0.5 bg-indigo-50 text-indigo-700 rounded border border-indigo-200 font-medium">
                    {ex}
                  </span>
                ))}
              </div>
            </div>

            <div className="flex items-center justify-end gap-2">
              <button
                onClick={() => setIsBulkExecModalOpen(false)}
                className="px-3.5 py-2 text-xs font-semibold text-slate-600 hover:bg-slate-100 rounded-lg cursor-pointer"
              >
                취소
              </button>
              <button
                onClick={handleBulkSendExecs}
                className="px-4 py-2 text-xs font-bold text-white bg-indigo-600 hover:bg-indigo-700 rounded-lg shadow-sm cursor-pointer"
              >
                일괄 발송하기 ({selectedExecs.length}건)
              </button>
            </div>
          </div>
        </div>
      )}

      {/* MODAL 5: Bulk Employee Email */}
      {isBulkEmpModalOpen && (
        <div className="fixed inset-0 z-50 flex items-center justify-center p-4 bg-slate-900/60 backdrop-blur-xs">
          <div className="bg-white rounded-2xl shadow-2xl border border-slate-200 w-full max-w-lg p-6">
            <h3 className="text-base font-bold text-slate-900 flex items-center gap-2 mb-2">
              <Mail className="w-5 h-5 text-rose-600" />
              <span>선택 인원 일괄 취득권고 이메일 발송</span>
            </h3>
            <p className="text-xs text-slate-600 mb-4">
              선택된 <strong>{selectedEmps.length}명</strong>의 구성원에게 각 개인별 부족 배지 정보 및 AXAGE 아카데미 앱 링크(https://test14-wyc8.vercel.app/)가 포함된 맞춤형 권고 이메일을 발송합니다.
            </p>

            <div className="flex items-center justify-end gap-2">
              <button
                onClick={() => setIsBulkEmpModalOpen(false)}
                className="px-3.5 py-2 text-xs font-semibold text-slate-600 hover:bg-slate-100 rounded-lg cursor-pointer"
              >
                취소
              </button>
              <button
                onClick={handleBulkSendEmps}
                className="px-4 py-2 text-xs font-bold text-white bg-rose-600 hover:bg-rose-700 rounded-lg shadow-sm cursor-pointer"
              >
                일괄 발송하기 ({selectedEmps.length}건)
              </button>
            </div>
          </div>
        </div>
      )}
    </div>
  );
}
